[{
  "distance": 11.66,
  "heading": 3.751,
  "instructions": [
    "Walk down one flight of stairs and stop on the landing. ",
    "Walk between the columns and make a sharp turn right. Walk down the steps and stop on the landing. ",
    "walk forward then turn right at the stairs then go down the stairs. "
  ],
  "path": [
    "af3af33b0120469c9a00daa0d0b36799",
    "5be145994f974347850a48cecd04cdcd",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 6250,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038374241318200754,
  "num_matches": 2219
},{
  "distance": 7.61,
  "heading": 3.272,
  "instructions": [
    "Walk into the hallway and through the entrance to the kitchen area. Walk  Passed the sink and stove area and stop between the refrigerator and dining table. ",
    "Walk through the kitchen. Go past the sink and stove stand in front of the dining table on the bench side. ",
    "Walk into the kitchen.  Walk past the refrigerator.  Stop directly in front of the wooden table. "
  ],
  "path": [
    "6c4ef6ac616042bc9fe4adc5f6d21b10",
    "f553a3287fb2438b979f09b09448c7c0",
    "e0d2a4e22abe44d7810d7e448fff6704",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "1b48df86b7a149fa8e90161265def866"
  ],
  "path_id": 48,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.06408404785286932,
  "num_matches": 2047
},{
  "distance": 13.34,
  "heading": 1.829,
  "instructions": [
    "Walk beside the outside doors and behind the chairs across the room. Turn right and walk up the stairs. Stop on the seventh step. ",
    "Turn left and walk through the living room. Exit the room, turn right and walk up the stairs. stop in th e middle of the stairs. ",
    "With the windows on your left, walk through the large room past the sitting areas.  Go through the door left of the tapestry and enter a wood paneled room with a circle table in the middle.  Go up the stairs and stop on the sixth step from the bottom. "
  ],
  "path": [
    "bd67e1a2dec64aab9e028df026ce4caf",
    "d2cf7bc1308c4d1b86973b4ad1336404",
    "6019439d967f4e5ab8332170d0d17a57",
    "913aefa5733c425eb79de9f5e225cd0e",
    "f745a3bf638a40dd85e29ce98d8c2aba",
    "81a50ecde0ab42cd81e0cf23a2529675",
    "7d9e8e6508884b1c8c9fedf59d70729e"
  ],
  "path_id": 6310,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.05702383628419374,
  "num_matches": 2553
},{
  "distance": 5.17,
  "heading": 3.964,
  "instructions": [
    "Turn right and move forward around the bed, enter the bathroom and wait there. ",
    "Walk around the bed and into the bathroom and stop. ",
    "Turn around and walk to the other side of the bed and stop in the bathroom doorway. "
  ],
  "path": [
    "8255979462744450aef8a399712c0d7f",
    "1dd50bf3662244b68314b8400ebb66b6",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "efe359ee05ea46c587196354c2d1cc96",
    "8b41e8798d78402f9f36b242972d729b",
    "45ee2d428b7c42a98afe21f68a8fa298"
  ],
  "path_id": 5577,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.09251555392217235,
  "num_matches": 3631
},{
  "distance": 13.23,
  "heading": 1.874,
  "instructions": [
    "Walk down the stairs and walk towards the red sofa. Turn left and enter the bathroom. ",
    "Walk down the stairs all the way and past the Christmas tree. Make a right turn and walk past the blue chair into the room with the white sink. ",
    "Walk down the stairs, walk into the room with the fireplace, walk around the chairs and turn left into the bathroom, stop in front of the sink. "
  ],
  "path": [
    "be3d7ae0352d481191e4c9e351e71b08",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "124c7635126f4fefaf3c57742dbe1193",
    "b6169d6b759547769509b4d781a8bff6",
    "69cbdf9fd3b64552b57887b813845cfa"
  ],
  "path_id": 211,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04086981985506459,
  "num_matches": 2446
},{
  "distance": 5.08,
  "heading": 5.386,
  "instructions": [
    "Walk across living room to tile floor. Stop next to the far side of the bar. ",
    "Go past the bed, the tv, and the desk. Stop at mirror by the entrance door. ",
    "Walk past the TV and continue toward the bathroom.  Stop before walking through the bathroom door. "
  ],
  "path": [
    "b7016dcb34d747d2b18281748a257f5a",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "7a920bf869fd41099e44a0829f818361",
    "71f79f342cde467ba037a196c4e04f6a",
    "6ca411a8612d4a569362c6231dcf1b68"
  ],
  "path_id": 3207,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.07961765531173681,
  "num_matches": 2661
},{
  "distance": 11.71,
  "heading": 5.703,
  "instructions": [
    "Walk toward the stairs. Walk down the stairs and stop on the landing. ",
    "Exit the room by walking down the stairs, then wait on the first landing by the banister. ",
    "Walk forward past the rope line and go down the stairs to the bottom of the first landing. "
  ],
  "path": [
    "1da0c5eb43fd4722a5f7f5c7d4e18b4e",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 6447,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05249419005929037,
  "num_matches": 3653
},{
  "distance": 8.65,
  "heading": 1.874,
  "instructions": [
    "Walk to the hallway and take a right. At the end of the hall take another right into the bedroom and stop beside the nightstand. ",
    "Walk through the double doors to the hallway and turn right. Walk to the end of the hall and wait in the bedroom on the right. ",
    "Walk forward in the hallway towards the French doors. Walk through the French doors and take a right down the hallway. In the hallway walk forwards and take a right. Walk down the hallway and take a right into the bedroom. In the bedroom stop just inside the doorway. "
  ],
  "path": [
    "be3d7ae0352d481191e4c9e351e71b08",
    "88f5ba9d06ac4413b1a3908af6544308",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "62994d72dab246fbb839f3699b9cacd6",
    "413903c083d64f2696539cf9f181894e"
  ],
  "path_id": 712,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09719410962381544,
  "num_matches": 3155
},{
  "distance": 6.75,
  "heading": 3.759,
  "instructions": [
    "Go past the fireplace, make a left and go through the doors. Make a right turn under the deer head and go straight to the open door. Stand in the doorway to women's bathroom. ",
    "Walk past the fireplace then turn left. Turn right and then go straight into the room ahead. WAit there. ",
    "Go to the bottom of the staircase. Go into the dining hall. Enter the room with the buck head above the doorway. Go straight into the women's restroom. "
  ],
  "path": [
    "8d27cd9bb3884465a9c48ad38fde69fd",
    "592a33a207ee425ebaa1c86f9a31e1a3",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "761e41fbabfd4f1c80c3ab77df6732ce",
    "635e26ebc0594a23b1159bb0c6d15cc8"
  ],
  "path_id": 5987,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.14452717666641193,
  "num_matches": 6646
},{
  "distance": 10.55,
  "heading": 0.034,
  "instructions": [
    "Walk straight past the chairs. Turn right after you pass the chairs. Turn left and wait near the steps. ",
    "Go towards the altar. Turn right  before entering the alter area. Pass between the two columns. Turn left and jump over the low rail. Stop in front of the low wooden seat. ",
    "Walk straight forward to the front of the room. Once you pass the chairs, turn right. Once you pass the column, turn left. Stop on the other side of the gold metal wall. "
  ],
  "path": [
    "6847b3528b67416ead2f7771a5264be8",
    "9b838098731b452ba242bdc550557425",
    "6d300c6b06e944349dd9ab9ffed93aeb",
    "4abfb56310db468e838cfde6416ca233",
    "0cfb39f99a5649fe9d49e5669779c43d"
  ],
  "path_id": 5043,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.046387153475164575,
  "num_matches": 2666
},{
  "distance": 10.29,
  "heading": 1.597,
  "instructions": [
    "Exit the theater and continue forward taking a slight jog to the right, pass the kitchen on the right, pass the bathroom on the left, then enter the room on the left just past the bathroom. ",
    "Exit the room and go down the hallway. After you pass the five pink paintings on the wall turn left and wait by the dining room table and chairs. ",
    "Turn to the right and walk through the doorway. Continue to walk straight down the hall and when you reach the couch take a left. Wait by the table. "
  ],
  "path": [
    "bf249d0d4e364c85bcd322f564abc705",
    "b3cb0280416742fc9dcba0d2d9e5d2f7",
    "34d76d6db3484d04a47482685c9ab420",
    "74a12d0675b54d6193ba63104a6a8e2e",
    "5848b29e18924f5594fbec08340fb7a9",
    "32c24c4472f346bc9b292f8997b9f82e",
    "04f548967cfc4e98a79d1e2494b74606"
  ],
  "path_id": 2860,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.07623533489343269,
  "num_matches": 2238
},{
  "distance": 17.01,
  "heading": 4.896,
  "instructions": [
    "Turn to the right and walk down the hallway.  Walk till you can turn to the right and walk past the fireplace.  Walk towards the chairs.  Then turn to the right and go stand by the first open door.  Wait there. ",
    "Walk out of the bedroom and turn left. Walk down the hallway and turn right. Walk past the fireplace and walk to the right of the glass case. Turn left and stop in the doorway. ",
    "Turn around and take a left. Walk straight. Take a right and walk past the stairs and the fireplace. Keep walking straight and wait in the doorway of the room to the right of the hutch. "
  ],
  "path": [
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "0e8e2c9d09974dab977c1d3868286f12",
    "9766d89c21094c5b872be3a378d4cbad",
    "ae97478ce1c84d5588244906fe089558"
  ],
  "path_id": 1238,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0512177658414397,
  "num_matches": 2837
},{
  "distance": 9.63,
  "heading": 2.708,
  "instructions": [
    "Walk through the entryway and left up the stairs that curve left. Stop at the top of the stairs. ",
    "Stand with the door behind you and go up the staircase on your left.  Stop where the other staircase meets up, just before the single staircase going up. ",
    "Walk forward towards the staircases and go up the staircase on the left. Once you have finished climbing up the first set of stairs there will be a short landing area. Wait there do not continue upstairs or go back downstairs on the set of stairs in front of you. "
  ],
  "path": [
    "0e59dc94728348e7a3e5e3746f2742ea",
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "e49192047ff241b5933dfef7b832b8fe",
    "f490656d21134ff79be372d985ad965c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 5724,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.047855660686549194,
  "num_matches": 2231
},{
  "distance": 14.43,
  "heading": 6.059,
  "instructions": [
    "Walk straight into the cathedral. Walk through the footpath of the single pew on your right, moving towards the center of the room.  Walk up the center of the cathedral and stop when you get to the front of the altar. ",
    "turn slight right and walk over chair, at next row of pews turn slight left into center of main room, turn right  and walk up 2 stairs, stop facing main alter and cross. ",
    "Go and stand in the center of the main alter. "
  ],
  "path": [
    "b44972ac14a04dc1a18556e918b0c0c7",
    "dad0e2b0427b40ec8e23f21760179e22",
    "57675495582049a08d338804d36e72e6",
    "2094de1e2c934d9ca603a405739df547",
    "ec1f835335ec483d81238a3729e7d34a",
    "1ecbf04528c0464e9e2fa4aa55ecb69f"
  ],
  "path_id": 2641,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.061410368768476026,
  "num_matches": 5193
},{
  "distance": 8.55,
  "heading": 2.725,
  "instructions": [
    "Head in and through the office, then use the left doorway to enter the seating area. Stop and wait by the nearest chair. ",
    "Walk left pas the table and chairs and into the next room and stop. ",
    "Turn left and enter the formal study. Walk past the table, turn left and enter the room.  Wait near t he chair. "
  ],
  "path": [
    "005bcfda078e4a79892f5477b347a7fe",
    "b2c2abdd75de4ea6b203f890bf89cfb0",
    "7a45313ee05048f2bfa610ac81986e1c",
    "52131a7696fc47f4bffd1c0cfd57a454",
    "93848517830e4376a3d3576c16e3685f"
  ],
  "path_id": 5681,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06359278296402225,
  "num_matches": 2491
},{
  "distance": 10.03,
  "heading": 2.05,
  "instructions": [
    "Head towards the two ivory tusks at the opposite side of the room, then exit the room through the narrow corridor to the left. Stop once you've exited the corridor and have entered the next room. ",
    "With your back faced towards the art easel, walk straight forward past the wooden box towards the two large white tusks. Directly to the left of those tusks is an open door to which you turn towards and your destination is just a few feet beyond that. ",
    "Go to the statue on a pedestal. Go through the corner passageway. "
  ],
  "path": [
    "31866025bbc74d7fbf99524d81d35bd1",
    "8e0a04db99fd4c61a9f669d2e6e421a8",
    "9f6684e165434894a5185bb5c3e2c275",
    "764cb58a8d31461892ca6bdc675c14df",
    "be255b95116f48599c036544957334ec"
  ],
  "path_id": 7263,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10915416016020732,
  "num_matches": 3078
},{
  "distance": 6.33,
  "heading": 3.359,
  "instructions": [
    "Walk up the stairwell with the red carpet up to the next level. Continue forward at the top of the stairs and walk into the roped area with the armchairs and table. ",
    "Ascend the stairs and cross the rope. Stop under the chandelier. ",
    "Go up the stairs. Go straight until you get to a large table with a chandelier. "
  ],
  "path": [
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a",
    "293a1e64b85e4e84a3a44fe8ee9d9bd4"
  ],
  "path_id": 4287,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.054451012790635286,
  "num_matches": 2696
},{
  "distance": 7.47,
  "heading": 2.156,
  "instructions": [
    "Walk through double doors and take a right at the tapestry.  Walk to the end of the hallway and wait by the bathroom door on the left. ",
    "Go through the double french doors and then turn right. Follow the runner through the hallway and turn left. Stand in front of the bathroom doorway and wait there. ",
    "Turn left and exit the room. Turn right and walk across the hallway. Exit the hallway by the farthest leftmost doorway. Wait by the mirror just outside the bedroom. "
  ],
  "path": [
    "88f5ba9d06ac4413b1a3908af6544308",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 5131,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09614982048628362,
  "num_matches": 2385
},{
  "distance": 11.87,
  "heading": 4.886,
  "instructions": [
    "Exit the room and make a left. Walk to the other end of the carpeted walkway, and make a left once you counted the 3rd tall, wooden post. Wait at the wooden door entrance of a bedroom where there is a sink to the left once you enter the bedroom. ",
    "Leaving the room facing the wall in the hallway take a left and go down the hallway straight ahead down the hall and taking a left into the last bedroom in the second door on the left on the at the end of this hall before entering the next hallway. ",
    "TURN TO THE RIGHT UNTIL YOU ARE FACING A HALLWAY WITH ANIMAL PELTS ON THE WALL, WALK DOWN THE HALLWAY UNTIL YOU REACH THE LAST DOOR ON THE LEFT, TURN LEFT TO FACE THE DOOR, WALK THOUGH THE DOOR AND INTO THE BEDROOM. "
  ],
  "path": [
    "1e013670f0ba4c9494734cedf464e11a",
    "4e900e156c83453495bfdc9348369b9c",
    "5afc855988064b999acb5b3b180e8348",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 652,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11009823420625094,
  "num_matches": 4994
},{
  "distance": 14.78,
  "heading": 1.487,
  "instructions": [
    "Go between the red chairs in the center of the chamber, make a right before the stage, go straight passed the marble pillar and then go into the right far corner of the room and stop. ",
    "Walk toward the alter and then to the right. Walk past the wooden pews and the column. Walk toward the left corner of the room by the table and stop. ",
    "Turn left and go past all the pink chairs on the right then turn right and go straight and then turn slightly left and wait in that left corner by the last pink chair. "
  ],
  "path": [
    "3c88cda1e8444d1e8687e05a16856c16",
    "2094de1e2c934d9ca603a405739df547",
    "91b89c02a03d48c891bee19a49350f8c",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "3e18ef6d21744a9f884a6b148c0d63ac",
    "97e40a397edf4dfbae3894c998508284"
  ],
  "path_id": 3770,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.09150249332144954,
  "num_matches": 7597
},{
  "distance": 14.73,
  "heading": 3.841,
  "instructions": [
    "turn left and walk towards opening on the right. Enter large hall. turn left towards short stairs. Go up short staircase and stop at the top between another set of stairs. ",
    "Walk through the living room area passed the chairs. Walk through the open double doors and into the entry room with red carpet. Walk up to the stairwells. ",
    "Follow the couch round the table and out the door on the right side of the room. Walk up the stairs to the left and hold on the landing between the winding staircases. "
  ],
  "path": [
    "acd8315e6a434feabd3937499bd53dbb",
    "259fd84d195d4d9bac4e14bdf953521d",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "154cbcc9b744473780da78d787e1ad34",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 45,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05620947246921239,
  "num_matches": 2918
},{
  "distance": 12.39,
  "heading": 1.199,
  "instructions": [
    "leave the room with the barber chain in it and walk 5 feet into room with long table.\r\nturn right and walk 20 feet to the end point of the long table which should be on your left.\r\nat the end of the long table turn left to face an open door with glass windows on the top half and with a ventilation grate directly in front of door jam.\r\nwalk approximately 8 feet to the entrance of the open door and stop just outside the entrance to peer into a hallway which opens to another open door with a bed facing you. ",
    "Turn around and walk into the dining room. Take a right. Take a left after the table and wait in the doorway. ",
    "Walk into the dining room and turn right.  Walk past the long table and turn left before you reach the smaller round table.  Walk to the open door that has the four glass panes, and stand in the doorway. "
  ],
  "path": [
    "5eedd74c2a86462dafb8031559666b15",
    "60296c63d7814cd09749634f671708ad",
    "21dd8e71dae64f378401cb0eba702b7d",
    "ce5df3235866447d95c4667d72528984",
    "a5f4055ab7134ffcbbe8b33150552301",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "59163d8ecd3a41038c79bad8d0b51d7e"
  ],
  "path_id": 90,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.08665131323820378,
  "num_matches": 2218
},{
  "distance": 13.71,
  "heading": 1.59,
  "instructions": [
    "Move forward between the two tables to the left and right. Turn left and move forward through all of the remaining tables. Continue going forward and stop in front of the set of seven chairs. ",
    "walk forward between one pair of tables and chairs. Turn left and walk between three sets of tables and chairs. Turn left  and move to the center of the room with the patterned carpet and wait next to the upholstered chairs. ",
    "two step forward then left go straight exit room and wait at the opposite to chairs. "
  ],
  "path": [
    "5e54afb639e8489282ebf3ac01821cc7",
    "434eafc01e8e4a32beeeddba478776bf",
    "dcb7e1f526b646819aa4a485171958a7",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "03d493822ac64466ba416f084a9d3bb9",
    "6b06f294636f4fcd9bddeb75cda61c6d"
  ],
  "path_id": 353,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.09623786528980566,
  "num_matches": 4799
},{
  "distance": 8.57,
  "heading": 2.198,
  "instructions": [
    "Walk up the stairs and stop at the top of the stairs. ",
    "Go up the stairs and stop at the top of the stairs. ",
    "Walk up the stairs and wait on the landing by the banister. "
  ],
  "path": [
    "267a7e2459054db7952fc1e3e45e98fa",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 6089,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04983738227170232,
  "num_matches": 2634
},{
  "distance": 9.09,
  "heading": 0.133,
  "instructions": [
    "Walk down the first flight of stairs and turn right. Go down 2 steps and stop. ",
    "Go down the stairs, at the first landing go to the right and stop. ",
    "Go down the stairs to the first landing. Turn right and go down three more steps. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "e87f560e1b5a497487526e64db42f8c8"
  ],
  "path_id": 6090,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04996544053768653,
  "num_matches": 2897
},{
  "distance": 7.12,
  "heading": 3.322,
  "instructions": [
    "With the green painted wall to your immediate left, walk forward into the hallway all the way to the end. At the end of the hallway, turn right and enter the bedroom. ",
    "Walk down the long hallway towards the square tapestry on the wall.  Turn right and walk through the open door that says \"Sunset Room.\"  Take a few steps into the room and stop on the carpet that is next to the bed and the white nightstand with a clock radio on it. ",
    "Walk down the hallway, heading away from the door labelled \"Master Suite.\"  Go through the second doorway on your right.  The door will be labelled \"Sunset Room.\"  Stop next to the bed in the Sunset Room. "
  ],
  "path": [
    "de655166da274d40841f1e5e488ab641",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "62994d72dab246fbb839f3699b9cacd6",
    "413903c083d64f2696539cf9f181894e"
  ],
  "path_id": 7134,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.12084008265674269,
  "num_matches": 3125
},{
  "distance": 10.95,
  "heading": 1.557,
  "instructions": [
    "walk down stairs, turn right, walk down stairs, turn right and walk down rest of stairs go straight past tree through doorway, slight right between two red chairs, slight left through doorway stop at the edge of carpet. ",
    "Walk down the stairs and enter the sitting area with the two pink chairs. Exit the sitting area and enter the dining area and wait next to the table and chairs. ",
    "Go down the stairs. Go into the dining room with the long wooden table and stand next to the small table in the corner of the room with a silver kettle on it. "
  ],
  "path": [
    "80befc44c6d14348a3f9bda8ba719d70",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "124c7635126f4fefaf3c57742dbe1193",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 3935,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.041954286440989676,
  "num_matches": 2792
},{
  "distance": 13.91,
  "heading": 2.804,
  "instructions": [
    "Exit the room, make a right and go straight through the room to the next archway, then take a few steps into the big room and stop. ",
    "Walk through the doorway in front of you. Once out turn right. Go across the large open room with the rug and enter the door straight in front of you. Once you enter the next room. Stop right before you get to the carpet. ",
    "Take a right and wait in the entrance to the large open room. "
  ],
  "path": [
    "377785e3a8ec4ce7bff6de3035f6fcd5",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "f12b7ffe7f9e4ece9bd927edf6b52b71",
    "1ad73ac43096496f9b6084071d1d944f",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 2530,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.09638871714854036,
  "num_matches": 4352
},{
  "distance": 5.5,
  "heading": 6.028,
  "instructions": [
    "Go forward so that you line up with the pool. Towards the middle of the pool turn right to be between two chairs. Continue forward until you reach the stairs. ",
    "With the pool on your left walk straight and go through the tan and green patio chairs towards the stairs out of the patio stopping before you hit the mosaic at the bottom of the stairs. ",
    "Walk straight past the first two lounge chairs, then turn right. Wait by the steps. "
  ],
  "path": [
    "e775ea81e83c45719de5a1577f8f7e39",
    "9b2b12257e9a4c5d9f99f141769e9301",
    "7e094a308dec4987a5185a0426f4ec3c",
    "ff2dd63ad83245c3b4831b4f8a6911ac",
    "2596868500734b1496d479e6936cceb3"
  ],
  "path_id": 575,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.0980307414382566,
  "num_matches": 3753
},{
  "distance": 9.45,
  "heading": 4.887,
  "instructions": [
    "Walk down hall to exit sign. Turn right and stop at sink. ",
    "Turn left to walk down the hall toward the exit. Wait in the last doorway on the right. ",
    "With the handrail to your left, move down the hallway towards the exit sign at the end. Stop at the entrance to the room just prior to the exit sign. "
  ],
  "path": [
    "9bbc936210084a00ad05856e0f5a3364",
    "ba692fd9ec524282935a608d975374e3",
    "5afc855988064b999acb5b3b180e8348",
    "4e900e156c83453495bfdc9348369b9c",
    "1e013670f0ba4c9494734cedf464e11a"
  ],
  "path_id": 2869,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09609409886964221,
  "num_matches": 3309
},{
  "distance": 14.14,
  "heading": 6.135,
  "instructions": [
    "Walk up the curved staircase on the right.  Next turn left to walk up the next set of stairs.  Walk towards two white pillars at top of steps.  Wait here. ",
    "Go up the stairs on the right.  On the landing, turn left and go up of the rest of the stairs.  Stop on the last step before reaching the top. ",
    "Walk up the staircase to the right. Walk all the way to the top of the staircase. Stop on the second step from the top. "
  ],
  "path": [
    "3f75b2d4af4d4afd85666d4c1302008c",
    "3c9615b3193a4e71ae932ea45fef8dde",
    "e87f560e1b5a497487526e64db42f8c8",
    "fd263d778b534f798d0e1ae48886e5f3",
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 5989,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03654315310339091,
  "num_matches": 2402
},{
  "distance": 16.94,
  "heading": 1.448,
  "instructions": [
    "Turn to the right.  Walk straight ahead until you get to a big fan.  Go a little to the left and walk down that aisle.  Stop there and wait by the big wooden chair. ",
    "Walk across church to railing. Go over railing. Continute across church to pews. Walk straight between pews and desks to pillars. Turn slight left and enter next set of pews to left of fan and stop between pews and desks. ",
    "Turn right and walk between the pews and stop beside the pews that sit in front of the organ. "
  ],
  "path": [
    "934734efa498455bbbabb9e0cc8e342d",
    "0cfb39f99a5649fe9d49e5669779c43d",
    "23b6674835004403ab9356fdc7e2a7d5",
    "d57e0c1e647a4c03a9616384045926e0",
    "dae1c005bfed4efb8b08dd35c18190c2",
    "28e29ebaf1694e0f870cad8268220287"
  ],
  "path_id": 1364,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.05879234411343953,
  "num_matches": 4004
},{
  "distance": 9.55,
  "heading": 1.543,
  "instructions": [
    "Walk up two sets of stairs.  Continue straight towards colorful painting of a boat.   Enter room to the left of the painting.   Wait by sink. ",
    "Walk all the way up the stairs to the top of the stairs. Once at the top, walk forward passing a bedroom on the left. Walk towards the last room on the left. Enter inside the room, and stop there. ",
    "Turn and walk up the stairs all the way to the top. At the top walk straight forward and enter the last door on the left and stop in the doorway. "
  ],
  "path": [
    "d0b75539f2484b0bb8e1612e549c06d3",
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "cefe85eb9d1e4592a020547df6107246",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "087bf4ad4a0b4a17afc2d6c173eceff3",
    "3851376d4f84494ebdc080b34ddc0f5e"
  ],
  "path_id": 4047,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09726238545950475,
  "num_matches": 2082
},{
  "distance": 7.05,
  "heading": 0.972,
  "instructions": [
    "With the sinks to your left, move forward towards the stairs and climb them. Stop once you reach the top of the stairs. ",
    "Walk by the kitchen to the stairs. Walk up the stairs. Wait at the top of the stairs. Wait there. ",
    "Turn around and proceed through the kitchen then walk up the stairs.  Wait next to the mirror. "
  ],
  "path": [
    "c5c6bc7725e44fbf9cdb474aef50a74b",
    "acf55e0267824aef8e8b9ad200e36091",
    "2fd10d37b87f46d6b4e0501aac549c6f",
    "3e79242dcaa44114abe4ecb4d9ac5ba5",
    "42913b04e9ae46119b6463db48e36c02",
    "9a0c4ca175e74e0aa31c73c3c82519dd",
    "cd504d23d03944a8bef4e4d8c4975cdc"
  ],
  "path_id": 3572,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.11132563029513962,
  "num_matches": 2250
},{
  "distance": 6.92,
  "heading": 4.887,
  "instructions": [
    "Walk straight and past the bar. When you pass the table and chairs and get near the fireplace turn left into the hallway. Wait there. ",
    "Turn right. Turn left after the television that is on the wall on the left. Stop and wait there. ",
    "Head toward staircase passing by dinning area, make a left, and wait at entrance. "
  ],
  "path": [
    "8fa748001d8d47c8aa0c116d9fd14866",
    "e2230fa2c84b43cfb8d414048a8241a1",
    "0328d42616e244aeaa60f339795c9ad8",
    "f0d137bab5454f96857166a48536cb59",
    "105998261dc9418da248f0190c8b1568",
    "54f83ce9bf4543ff8219bd1c450ada78"
  ],
  "path_id": 5347,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08007454183049836,
  "num_matches": 6402
},{
  "distance": 7.16,
  "heading": 4.285,
  "instructions": [
    "Exit the bathroom to the room then exit the room using the door on the left then turn left and head down the hallway then turn left on the next room and wait by the bed. ",
    "Exit the bathroom. Enter the bedroom. Exit the bedroom to the door on the left. Take a sharp left. Walk toward door on the left. Enter the bedroom. Wait there. ",
    "Exit the bathroom and turn left. Go through the door, exiting the bedroom and turn left again. Walk passed the lamp on the small table and go in the first room on the left.  Wait in the doorway next to the night stand. "
  ],
  "path": [
    "57604d4a6801436f9875134330834eb0",
    "c3f0a365dde24eb1a98807c5f02f8125",
    "7f39d79ddfec4b6e9c98e51576d59ab1",
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 3238,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12440205492731435,
  "num_matches": 5727
},{
  "distance": 6.36,
  "heading": 1.745,
  "instructions": [
    "Go left along the balcony, make a right staying on the balcony, and make a right and stop. ",
    "Go straight and then turn right. Continue going straight until you get to a box with a cross on it. Then stop. ",
    "walk straight then turn right then walk again then turn right. "
  ],
  "path": [
    "0f69425af2544c6f981c0ae9a7f9b829",
    "1cf9bfa7442841e9b5edc64590d0e879",
    "1818ffc4d0eb47cfa726a12d3cfefee3",
    "7b19d99c586f456c8095502d78d0f6f8",
    "43f8894f1a9446599a6c89732aa3f2dc",
    "dc3170aacd3f40f2ac2f5b726bd75b88",
    "6c47cd8bd2664281bec3740c473946f8"
  ],
  "path_id": 6506,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.041116589657490564,
  "num_matches": 2087
},{
  "distance": 7.85,
  "heading": 1.265,
  "instructions": [
    "take stairs to your right and go up them. follow stairs to the top. At top of stairs turn to bedroom on your right and stop. ",
    "Walk past the Christmas tree and climb the stairs. Wait at the top of the stairs in the first doorway on the right. ",
    "Go past the Christmas tree and up the stairs.  Stop at the top at the door reading 'City Room'. "
  ],
  "path": [
    "41873d3929e64a9a938a5fac3b6bbd79",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "80befc44c6d14348a3f9bda8ba719d70",
    "bec7a60657d6483996aa2f0d03b9d691",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 1872,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04507067809254902,
  "num_matches": 2452
},{
  "distance": 11.7,
  "heading": 4.942,
  "instructions": [
    "Walk past pews. Wait at floral arrangement. ",
    "Turn around and walk to the beginning of the aisle. Stand ahead of the pews in the canter. ",
    "Go into the church and walk straight down the aisle. Stop once you pass the first set of pews. "
  ],
  "path": [
    "20fd759be0b64fc9aa96d290f0a704ec",
    "8e38fdd81c7949db9646968bafbbdcfc",
    "006933a75f764c5485cf284bea0ded0b",
    "d841f7b710f9470796d55561f8f524db",
    "01c80b5f8fbd4c969ee0bc03f1ec7a6c",
    "82ea5baa30f945fe98f6cad3064af847",
    "d471e89e00be49f49a7ecace814d60bf"
  ],
  "path_id": 1157,
  "scan": "YmJkqBEsHnH",
  "source": "R2R",
  "similarity": 0.07943842901553726,
  "num_matches": 2951
},{
  "distance": 8.75,
  "heading": 4.289,
  "instructions": [
    "Go straight down the hallway and stop in front of the second door to the left. ",
    "Walk down the hall away from the balcony door. Stop in the last doorway on the left before the wall turns to the right slightly. ",
    "Go down the hall and wait by the first door on the left. "
  ],
  "path": [
    "dd4abb5f6ded471baea5b6db19998fae",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "cc7f149e59eb47fd8bde336f2bf3391d"
  ],
  "path_id": 7146,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0907312449791465,
  "num_matches": 2351
},{
  "distance": 5.87,
  "heading": 2.639,
  "instructions": [
    "Go to the dresser and turn right. Go through the open door at the end of the hall on the left. Enter the room. ",
    "After you leave the sitting room turn right and walk straight to the last door on the left. Now walk through the door and wait just inside the bedroom. ",
    "Go straight and turn right and go through door on the right and stop in the next room by the bed. "
  ],
  "path": [
    "3fd2f1d849de4e9f8c07863c845db6b5",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "138252ad9fab4ae1a86997fc363e6ac7",
    "87e7b6f2006541a9abe57fba18294a0c"
  ],
  "path_id": 7132,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.06911661573070485,
  "num_matches": 3457
},{
  "distance": 14.45,
  "heading": 2.267,
  "instructions": [
    "Walk straight through the 2 sets of doors. Walk Across the large room through another set of doors. Walk a couple of steps in this room and stop. ",
    "Go through the triple set of doors in front of you and travel on through the room with the flowered floor into the next room with the large ottoman in the center. ",
    "Turn to the right, go through the wooden door.  Keep walking straight across the massive carpet.  Go through the double wooden doors.  You'll be in a massive room with big windows.  Wait there in the entry way to the room. "
  ],
  "path": [
    "cfd9511c06b34cd1b89ba36919a4e6b6",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "f12b7ffe7f9e4ece9bd927edf6b52b71",
    "1ad73ac43096496f9b6084071d1d944f",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 156,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.09799748648740965,
  "num_matches": 4461
},{
  "distance": 6.54,
  "heading": 4.482,
  "instructions": [
    "Go down the stairs and take a right. Enter the safari room straight ahead. Stop in the doorway to the room. ",
    "Go downstairs, make a right, go into the doorway marked \"Safair\" and stop. ",
    "Head downstairs and turn right.  Enter the room with a fire extinguisher outside. "
  ],
  "path": [
    "778b27da719d47b494cce8c6896a9bdf",
    "94446ee1941346fa9d9ed2e8251dd5c0",
    "abdb1b4d143e491f8a9350b2fd869122",
    "c69af2f0e57b485886e0f4667b2209a5",
    "70d67ed19aa34e34845d32ca74a1d711",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 2427,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09471432547737504,
  "num_matches": 3544
},{
  "distance": 8.24,
  "heading": 0.115,
  "instructions": [
    "Go towards the doors which face outdoors. Go to the doors on the left. Step onto the patio, and stop. ",
    "Walk across dining room to outdoor patio dining room. Wait at entrance. ",
    "Go past the tables. Stop at the open door. "
  ],
  "path": [
    "96331f871893432f8bf3206ad2205cdd",
    "de49de6069de407195ab646f74a4d796",
    "305629bf76c04f19b7d099d0dabc2574",
    "a67abce0a4444fbf93c0203954e1da6d",
    "1723396e89154f649171f0def3b8cccc"
  ],
  "path_id": 5174,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08121946189147149,
  "num_matches": 5037
},{
  "distance": 6.09,
  "heading": 1.669,
  "instructions": [
    "Go straight down the hallway and into the room ahead. Wait near the two small Christmas trees. ",
    "Walk down the hall past the fire extinguisher and stop just inside the door. ",
    "Walk down the hallway past the fire extinguisher.  Keep going until you get to a door that says \"Master Suite\" and enter the room behind it.  Stop just after stepping into this room. "
  ],
  "path": [
    "61c5f348dc854631b9754d81d414d7e9",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792"
  ],
  "path_id": 5446,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.11985089872709825,
  "num_matches": 3184
},{
  "distance": 9.05,
  "heading": 3.256,
  "instructions": [
    "Facing the front of the church, walk past the next column.  Continue walking and stop in front of the entrance to the second row of pews from the left column. ",
    "Walk down the isle of the church stop after the big pillar and the third row of church pews. ",
    "walk straight with pews on left, stop before family area sign. "
  ],
  "path": [
    "546e9c647e9349f7a0056f0bb69d6478",
    "e9d22e3502f443d5a21fa8c5bc7fcd1d",
    "13350d0001004a9cb366910df03c2532",
    "436d550a1a684451a4b0119fc2c16a2c",
    "1e12cc2b46594b9a85d587b3fb830fcf"
  ],
  "path_id": 948,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.1158403581614679,
  "num_matches": 6816
},{
  "distance": 6.74,
  "heading": 0.496,
  "instructions": [
    "Turn around and walk behind the back of the couch outside. Once you go past the chair on the end, stop in front of the next large window on your right past the door. ",
    "Go straight behind the blue couch. Turn left when in front of brick wall. Turn left and wait. ",
    "Walk all the way forward and turn slightly left towards the column near the big pool, and stop in front of the column. "
  ],
  "path": [
    "37c2223d40cb4aedb1563e5e0c3a53e1",
    "ea67416e45b14671a358cf54260bdefa",
    "06cce75e286e46a59d44615b4936d9df",
    "91335d5f98b6406e95416adc396c26df",
    "ddf4309aa8014d47b566d5221beac723",
    "e640ea06e612471d9dc0782d42ca6f52",
    "0f57b286bcc44b888113d6d4f6c05d15"
  ],
  "path_id": 4370,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.08013161277186488,
  "num_matches": 5742
},{
  "distance": 12.68,
  "heading": 1.564,
  "instructions": [
    "Walk towards piano. Go through doorway to the right of piano. Wait by bench outside of doorway. ",
    "Exit the room via the arched opening with the double doors at the opposite wall. Continue straight until you step on the carpet ahead and see an open staircase to your left. ",
    "Walk through the doorway directly left of the blue couch. Then walk through the second doorway, and stop directly in front of where the carpet and the wood floors meet. "
  ],
  "path": [
    "e10169b3980a429fa3fc72713215d1b4",
    "f024f440e6c44f7d9771e95b4cdfd370",
    "cfd9511c06b34cd1b89ba36919a4e6b6",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49"
  ],
  "path_id": 6524,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07106914891468433,
  "num_matches": 3235
},{
  "distance": 11.04,
  "heading": 3.103,
  "instructions": [
    "Turn around and walk towards the stairs near the Christmas tree. Next, walk up the entire stairwell. Turn right at the first door at the top of the stairs and wait in the doorway. ",
    "Go up the stairs, at the top of the stairs make a right into the doorway on the right and stop. ",
    "With the fireplace behind you, move forward and right to the base of the stairs leading upwards. Climb the stairs all the way to the top, then stop at the first door to your right with the label \"City Room\". "
  ],
  "path": [
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "41873d3929e64a9a938a5fac3b6bbd79",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "80befc44c6d14348a3f9bda8ba719d70",
    "bec7a60657d6483996aa2f0d03b9d691",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 6127,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04141193257353622,
  "num_matches": 2632
},{
  "distance": 6.79,
  "heading": 0.133,
  "instructions": [
    "Walk down the stairs to the first land and wait there, near the baluster. ",
    "Walk down the stairs and stop on the landing at the bottom of the stairs. ",
    "Head downstairs and wait where the stair splits two ways. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 4393,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05215651522240504,
  "num_matches": 2525
},{
  "distance": 7.23,
  "heading": 3.352,
  "instructions": [
    "Walk to the top of the two flights of stairs, stop at the very top of the stairs. ",
    "Walk up the stairs. Stop at the top of the stairs. ",
    "Walk up steps to landing, turn right and continue up steps. Stop at top of stairs by large fake bear. "
  ],
  "path": [
    "b99113566bdc4b3e8937225e42421488",
    "e0d208d8f64d48d59aa8a971c3892e29",
    "abfdc492f81e4b8e87837b26cde983a8",
    "ea33c2a8e88742e19afe11c54680c7e2",
    "accd06798cf84596ada8f0cbc36af696",
    "7f83a9b5299744cc8bc32be5d94108c0",
    "a09817a4c04d49d1b8f2badabb7692ae"
  ],
  "path_id": 1533,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05871859749136828,
  "num_matches": 2419
},{
  "distance": 11.75,
  "heading": 2.94,
  "instructions": [
    "Walk around the piano and out the room.  Turn left and go down the stairs leading down.  Stop at the bottom of the stairs, in front of the mirror. ",
    "Pass the piano and go up the steps. Turn left and go down the steps. Wait near the round mirror on the left wall. ",
    "Walk out of the room, into the room with the stairs. Walk to the left of the staircase. Walk down the set of steps and stop on the carpet at the bottom of the steps. "
  ],
  "path": [
    "16a3ffd3d2ee4ce0921004f9872428cd",
    "237606bed97740599e39b32ac6316fe8",
    "c0086b5e4e0b41649f73b5c04bb7dbb7",
    "254f98bd6daa4313b04715ed29a61f88",
    "85599a90376043339b55e424eeb9aeab",
    "c1a3dc19c1154eb79d45f72d4885016d"
  ],
  "path_id": 4223,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.06003155247738829,
  "num_matches": 2355
},{
  "distance": 9.88,
  "heading": 3.795,
  "instructions": [
    "Walk towards the fireplace then turn right and proceed to the next room.  Turn right and the dining room and enter the hallway.  Wait near the phone. ",
    "Walk toward the fireplace and to the right of it. Walk into the doorway on the right and stop. ",
    "Walk toward the fireplace and through the doorway to the right of it. Enter the bathroom area and stop outside the women's bathroom. "
  ],
  "path": [
    "b07554ffc3164d45bfe9410a40632261",
    "46e170296a7f4b88b50ebeb7e2a27894",
    "d807887a425a41249a31c69a41adb313",
    "28170cad00aa4938a612db2e82628000",
    "21da82bc068c4d19a1c9168e86c417c2",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6944,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11707420596325482,
  "num_matches": 8413
},{
  "distance": 10.75,
  "heading": 0.133,
  "instructions": [
    "Turn right and walk all the way down the hall. Wait beside the white wardrobe. ",
    "Go through the hallway to the left, and walk to the left corner of the rope and stop. ",
    "From the top of the stairs, walk to the left of the large room with the table and chairs. Walk through the room at the end of the hallway. Stop by the table and chairs. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "5be145994f974347850a48cecd04cdcd",
    "c55fa077761c4154af4b26da88eee80d",
    "744eba592017466eab0da528e0cfdf7c",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "cd680b57443748fcae2de7c8e39970ad",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 6643,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.041302215897434276,
  "num_matches": 2258
},{
  "distance": 6.48,
  "heading": 6.154,
  "instructions": [
    "Go into the house and walk straight into the foyer. Stop once you are at the banister between the sets of stairs. ",
    "Walk through the doors in front of you until you get to the next set of double doors and continue walking straight. When you get to the spot where the two staircases meet, stop. ",
    "Go inside the house and stop between the staircases. "
  ],
  "path": [
    "9081c38ea6364c1e91132285a5cee2f9",
    "a58cfc143a484947b0a2c9395e7f11de",
    "067ad57950864b6482eee91a5bd6f5f5",
    "aabe1ec42c7f426a85b709e03c4711e9",
    "0e59dc94728348e7a3e5e3746f2742ea",
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036"
  ],
  "path_id": 1081,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.08039426238743459,
  "num_matches": 2738
},{
  "distance": 6.48,
  "heading": 1.511,
  "instructions": [
    "Go to the end of the counter, turn left, beside the double chest of drawers turn left, go straight, stop beside the large snail on the floor. ",
    "Take a right and then take a left. Take another left and wait in the huge shower. ",
    "Walk forward and take a left. take the next left and enter the tile with the mosaic. Stop in front of the snail on the ground. "
  ],
  "path": [
    "c32282e053ad450e9187d9d95361b124",
    "f6872e6001054c67a12371a542c7defe",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "3fd2f1d849de4e9f8c07863c845db6b5"
  ],
  "path_id": 1849,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.046403728371921055,
  "num_matches": 2623
},{
  "distance": 14.67,
  "heading": 2.914,
  "instructions": [
    "Walk through the large dining room down the middle of the room past the tables and fireplace. Walk through the open framed entryway on the other end of the room without doors. Walk past the old rotary phone on the wall and through the next open door beside it. ",
    "Walk past all the table and chairs and toward the fireplace on the right. When you get to the fireplace continue straight into the hallway. Turn right and then turn left into the room that is near the elevator.. Wait there. ",
    "Walk past the fireplace and through the entryway to the right of the television. Walk right down the hallway and turn left at the elevator and stop in the doorway of the bathroom. "
  ],
  "path": [
    "a67abce0a4444fbf93c0203954e1da6d",
    "6c1a4c906ad84fa4b0fd60e1223fb836",
    "f0d137bab5454f96857166a48536cb59",
    "105998261dc9418da248f0190c8b1568",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "acc96ef459564d42b60eac9dad07708a",
    "717b0a0713c44e0ea5b5a557c96076a1"
  ],
  "path_id": 5825,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0916901545313504,
  "num_matches": 5802
},{
  "distance": 5.21,
  "heading": 0.031,
  "instructions": [
    "Walk inside towards the red circle on marble floor.  Continue straight.  Wait at the bottom of staircase. ",
    "Go indoors. Walk straight until you get between the two columns. ",
    "Turn around, walk up the two steps and head through the entryway. Continue forward and stop in between the bottom of the two staircases. "
  ],
  "path": [
    "a58cfc143a484947b0a2c9395e7f11de",
    "067ad57950864b6482eee91a5bd6f5f5",
    "aabe1ec42c7f426a85b709e03c4711e9",
    "0e59dc94728348e7a3e5e3746f2742ea",
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 6569,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.08018403325379529,
  "num_matches": 3012
},{
  "distance": 6.06,
  "heading": 4.573,
  "instructions": [
    "Exit the bathroom area and turn left and stop in the doorway, near the bottom of the stairs. ",
    "Turn around and exit the bathroom. Once out walk straight into the dining room and then turn left at the double doors facing the stairs and sitting area. ",
    "Leave the bathroom and take the first left once you are in the main room. Stop in the doorway to the stair area. "
  ],
  "path": [
    "5932ea805ae44802a1d412d5d4ab61af",
    "0c2d645fd3b64fee95d8f447e8efdeaf",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "592a33a207ee425ebaa1c86f9a31e1a3"
  ],
  "path_id": 3597,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06901118543858745,
  "num_matches": 2609
},{
  "distance": 8.67,
  "heading": 4.955,
  "instructions": [
    "Turn around and walk up the stairs and take a right. Take another right at the fireplace and wait on the third step on the stairs. ",
    "Walk up the stairs and make a sharp turn right past the bear. Walk forward past the fireplace. Walk up to the third step and stop. ",
    "Go up the stairs. Turn right and continue past the chairs to the fireplace. Turn right to go up three stairs. "
  ],
  "path": [
    "fb1d28b8329e4951b803c84c34d187fa",
    "accd06798cf84596ada8f0cbc36af696",
    "7f83a9b5299744cc8bc32be5d94108c0",
    "4c477b124d744b75b561bab5d612bfd8",
    "7f03669f1daf499491770eb857dbe25d",
    "0e8e2c9d09974dab977c1d3868286f12",
    "abdb1b4d143e491f8a9350b2fd869122"
  ],
  "path_id": 1838,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11362711089079217,
  "num_matches": 3993
},{
  "distance": 8.26,
  "heading": 1.021,
  "instructions": [
    "Walk out of the bedroom under the wine bottle decoration. Go past the bathroom and take a left into the first room which has two fish handing on the wall above the bed. ",
    "Walk through the bedroom past the bed and out the doorway into the hall. Walk along the banister rail passing the native american art on the walls. Walk into the bedroom that has fish mounted on plaques above the bed. ",
    "Walk out of bedroom door into hallway and turn left. Go into first door on left. Wait there. "
  ],
  "path": [
    "cb8dc528a2dd4c78a5c6bd6617119672",
    "6cd88fc6ffae479694b5d2442a6998d4",
    "1e013670f0ba4c9494734cedf464e11a",
    "4e900e156c83453495bfdc9348369b9c",
    "f0501ef281ab486eac400af37a580e19",
    "f6ac6ccfda544d34aa5c89ab1915e5d0"
  ],
  "path_id": 273,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08513746589135567,
  "num_matches": 2882
},{
  "distance": 11.44,
  "heading": 4.4,
  "instructions": [
    "Go towards the Christmas tree and walk all the way up the stairs, and wait. ",
    "Walk through the archway and up the stairs. Stop at the top of the stairs. ",
    "Exit the den and walk up the stairs to the top. Wait at the top of the stairs. "
  ],
  "path": [
    "77a6b37bf22f49afae1a9d30d736a00b",
    "091c189689a74ae3908ba76361e0cae0",
    "41873d3929e64a9a938a5fac3b6bbd79",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 3333,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.045715443078169306,
  "num_matches": 2754
},{
  "distance": 5.13,
  "heading": 2.049,
  "instructions": [
    "leave closet enter bedroom, turn right and go around the bed to the slider. go through slider to balcony and stop. ",
    "Leave the closet and walk past the bed towards the patio on the other side of the bed. Stop on the patio next to the first patio table chair. ",
    "Veer to the right, go past the foot of the bed.  Then veer to the left.  Go on to the balcony.  Stop and wait by the table and chairs. "
  ],
  "path": [
    "11ec36e3d78c43a389366c5159069b0c",
    "8b41e8798d78402f9f36b242972d729b",
    "efe359ee05ea46c587196354c2d1cc96",
    "0a709d588fcd4ae5badd921366074d7a",
    "156af10f63d84956ba5dc4b9fe3b2140",
    "5cd96a7c879547eda2a90077c79bc7f0"
  ],
  "path_id": 1495,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.059290940339808675,
  "num_matches": 2043
},{
  "distance": 5.2,
  "heading": 1.235,
  "instructions": [
    "Turn around and walk past the easel with the sign on it. Walk up to the second step. ",
    "Walk past the dining room table and up the set of stairs on the left. Stop on the second from the bottom stair. ",
    "Walk passed the table and display board. Walk up the small set of stair passed the displace board that enter a large open room with office desks. "
  ],
  "path": [
    "44e14ff2fcd34fa9a93265e53dc53b52",
    "3d409564a59c44ea84fd79ddc8aa4fc9",
    "7b99836e3e0045f2b5cc212e8181914b",
    "8ae0426af8824849ba75a6147325c30c",
    "d179f4cb2d2d40b0b4fdf3d37da78f48"
  ],
  "path_id": 203,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.1068647808193696,
  "num_matches": 2002
},{
  "distance": 9.45,
  "heading": 3.145,
  "instructions": [
    "Walk down the three flights of stairs, stop at the third step from the bottom. ",
    "Go downstairs, go left and left again to go down more stairs, at the level take four more steps down and then stop. ",
    "Walk down the steps and make a sharp turn left. Walk down the steps and stop on the third step from the bottom. "
  ],
  "path": [
    "090a8663beeb4ce6aeadfe720ea0c8e9",
    "cb6b9124a9594b4788966d28129cf531",
    "558c07ff6d6d4d268f6c8de7abd76d1d",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "cefe85eb9d1e4592a020547df6107246",
    "cc0682e6d88a44f3bfaeb81e91a79124"
  ],
  "path_id": 6634,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.11019110041790495,
  "num_matches": 2093
},{
  "distance": 8.29,
  "heading": 1.574,
  "instructions": [
    "Walk out of the bathroom door into the hallway with red wall art. Walk through the entry into the kitchen area. Walk passed the counter tops and refrigerator and continue up to the rustic dining table ahead. ",
    "With the toilet on your left leave the bathroom and hang a slight right in the hallway and a left into the kitchen walking between the counter and the island counter go forward and stop just in front of the bench at the table. ",
    "Leave the bathroom and go into the kitchen. Go forward towards the table.  Stop in front of the wooden table with a bench on one side and three chairs on the other. "
  ],
  "path": [
    "9871b1fb068b495fa3e2ddac2f54cc16",
    "f553a3287fb2438b979f09b09448c7c0",
    "e0d2a4e22abe44d7810d7e448fff6704",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "1b48df86b7a149fa8e90161265def866"
  ],
  "path_id": 400,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.06281709276223887,
  "num_matches": 2013
},{
  "distance": 11.77,
  "heading": 3.128,
  "instructions": [
    "Turn to the right, and walk down the sidewalk.  Go around the center of it and walk on the grass.  When you're just past the planter, you should stop and wait. ",
    "Walk down the patio stones and passed the circular planter bed. Walk towards potted plants and through the gate towards the next lawn area with a fountain. ",
    "Move towards and around the left side of flowerbed, continuing to move forward until you reach the railing on the right. "
  ],
  "path": [
    "202c0c5fee334297926cca560dfdd9ef",
    "90ca0b4ba53348688017ab8ba661e2c7",
    "59d35dd85e8f4b33954dc51f4d8f0db2",
    "ca9293fce518481282c3bc9bd6230f4c",
    "deade6958e8845448d4594169d435b5c"
  ],
  "path_id": 163,
  "scan": "EDJbREhghzL",
  "source": "R2R",
  "similarity": 0.07136441508919467,
  "num_matches": 2418
},{
  "distance": 8.08,
  "heading": 3.518,
  "instructions": [
    "Walk the opposite direction of the brown double doors, and take a left so you are able to walk through the glass set of double doors. Once you walk in, stop once you reach the middle of the aisle and passed the first set of chairs. ",
    "Turn left and walk to the glass case.  Turn left again and enter the next room.  Stop near the second set of chairs. ",
    "Walk past the art into the room. Go into the room beside the table. Stop on the red carpet. "
  ],
  "path": [
    "3a1ff205807c4648847f90c36e6ce520",
    "8726e75a4db8485abcc36d1d53072458",
    "86f8f01b0e3d46cc8df986bfe693b12e",
    "6847b3528b67416ead2f7771a5264be8",
    "9b838098731b452ba242bdc550557425"
  ],
  "path_id": 7108,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.048960094324074846,
  "num_matches": 2433
},{
  "distance": 12.75,
  "heading": 2.896,
  "instructions": [
    "Enter the building and continue straight through the second door. Then veer to the right, passing by the fireplace to your left. Enter the dining room ahead through pocket door opening. ",
    "Walk into the house through the front door and the door just after that until you enter the main part of the house.  Walk to the fireplace with the blue chairs in the 1 o'clock position and onto the carpet to the right in front of the Christmas tree.  Leave the room through the doorway in between the red chair and the yellow chair into the dining room.  Stop behind the first chair at the dining table that you encounter. ",
    "Walk through the front door.  Walk through the door with oval glass.  Walk towards the red sofa.  Go straight across red carpet and into next room.  Wait by table and chairs. "
  ],
  "path": [
    "c2341726267a4f31bff80ac3843462d3",
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 6728,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.045315300610360425,
  "num_matches": 2215
},{
  "distance": 16.13,
  "heading": 3.297,
  "instructions": [
    "Walk through the open door into the next hallway and turn the corner to the left. Walk into the large room with aqua colored floor rugs. Walk around the front of the staircase and walk towards the open door way with a statue of a man on the shelf next to it. ",
    "Walk forward, through the open wooden door. Pivot left and then move forward until you are standing on the white rug. Change direction and move to your right staying on the white rug. Take a left turn and go straight until you reach a doorway. Enter the second doorway from the right and enter the room with pink oriental rug. One step past the doorway, stop here. ",
    "Walk towards the bathroom, turn left before reaching it. Go towards the big rug and walk to the left side of the room. Stand in the doorway of the room on the left side of the two chairs next to the big rug. "
  ],
  "path": [
    "ba3207f81c55467fa7e6760f6232fb07",
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "f5bef118db5b41849ce63cbfcefed938",
    "fadac209cfc04129998323d048a5c908"
  ],
  "path_id": 4068,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.056506662225879266,
  "num_matches": 2309
},{
  "distance": 13.35,
  "heading": 4.759,
  "instructions": [
    "Walk around the desk to your left and into the foyer near the organ pipes.  Then turn left walk into the room. Stand near the table with the white cloth on it. ",
    "Go stand next to the small framed text on the wall titled Missa Cantata by John Coburn. ",
    "Go to the pews and turn left and go to the red chair. Go through the passage way to the left of the organ pipes. Go to the white table. "
  ],
  "path": [
    "73a3e5a2884d4a4aa77b31fff5708005",
    "57675495582049a08d338804d36e72e6",
    "dad0e2b0427b40ec8e23f21760179e22",
    "b44972ac14a04dc1a18556e918b0c0c7",
    "16cbae81701541f6a55597d6dc746163",
    "d34877b97e1545188e177b2715e434c5",
    "15d5b6a9851746e79e53e7451e1b2528"
  ],
  "path_id": 5117,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.06904547327605215,
  "num_matches": 5494
},{
  "distance": 9.67,
  "heading": 0.882,
  "instructions": [
    "Exit the bedroom and turn right after leaving. Continue past the room that has the \"Christmas\" sign above it and continue to the door with the \"Office\" sign hanging to the left. Turn ninety degrees to the left and step onto the wooden floor stopping about midway between the carpet behind you and the fireplace in front of you and to the left. ",
    "Exit the bathroom and then the bedroom, walk along the balcony, at the armoire turn left and stop near the blue chair. ",
    "Leave the room and take a right. At the end of the hall take a left. Stop on the left of the first plaid recliner. "
  ],
  "path": [
    "319ddb17492a4fcead1debf39bbafd95",
    "5c10e79b2673419ebf8d0f84582961ab",
    "4650dea829764ab7bb1557f4fcb603f0",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "d101fc142df64f9f8bae9894eb86fb41",
    "12e9fa5962de43698cf9cec57105d287",
    "9766d89c21094c5b872be3a378d4cbad"
  ],
  "path_id": 3779,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09929320211772487,
  "num_matches": 4647
},{
  "distance": 5.61,
  "heading": 2.452,
  "instructions": [
    "Put the railing and windows on your right and walk to the end of the railing. Go half way down the stairs. ",
    "Walk past the bookshelves and wait halfway down the stairs. ",
    "Walk to the end of the walkway and wait near the top of the stairs. "
  ],
  "path": [
    "4dbad4e837894372bf2dcefe5fa85cde",
    "be686c9f317c40469fa7d4b638023726",
    "f8f15aaf58354ce1b990df2ab33381bb",
    "0e6e6b0332d745178dd37fc1d4a710a2",
    "bfd3e9defa8742118917a4a5cc9190a3",
    "9b253c8eec6c40528ee7fbfc011316a1",
    "5ca7bfc500ec4d928285e61efee2dde5"
  ],
  "path_id": 4688,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.046755803423385714,
  "num_matches": 2185
},{
  "distance": 7.68,
  "heading": 2.156,
  "instructions": [
    "Go down the stairs and wait at the bottom. ",
    "Walk all the way down to the bottom of the stairs, stop when you are at the bottom and at the foot of the christmas tree. ",
    "Walk down the stairs and stop at the bottom of the stairs. "
  ],
  "path": [
    "88f5ba9d06ac4413b1a3908af6544308",
    "be3d7ae0352d481191e4c9e351e71b08",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "41873d3929e64a9a938a5fac3b6bbd79"
  ],
  "path_id": 6115,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05080309902510711,
  "num_matches": 2693
},{
  "distance": 5.89,
  "heading": 1.732,
  "instructions": [
    "Walk down the stairs.  Turn right at the bottom of stairs and exit through the door on the right.  Wait by the statue of a man by the window. ",
    "You need to go down the stairs and make a left then make a right so you are in front of the stairs going downstairs. Now go down to the second step and wait. ",
    "Walk down the stairs.  At the bottom of the stairs, make a right.  Then, walk though the first doorway on your right to leave the library.  There will be a statue bust on your left just past the doorway.  Stop next to that bust. "
  ],
  "path": [
    "24f4450a5eb14381b8ed20ee31ac44ac",
    "3a256f31181143e9844d11ca49211aa4",
    "cd9fd57e2de04c39b87e7fbe92e80a6c",
    "7fde4f88b5cf4cda9a2f31331fd7ca22",
    "87e385b82c704a29855826d3cf4f79a0",
    "082f6f6ac7c241669643586b39ce562b",
    "f324c5a2e85c4957ae6b9073581f3452"
  ],
  "path_id": 6008,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.061145094352682436,
  "num_matches": 2205
},{
  "distance": 5.34,
  "heading": 4.573,
  "instructions": [
    "Turn towards bathroom door. Exit. Go through doorway. ",
    "Walk forward and go to your left towards the wood door.Go out of the door and into the hallway. In the hallway walk straight into the main reception hall. In the main room stop between the first table and the doorway behind you. ",
    "Walk passed the sink through the entrance of the women's bathroom. Walk down the hall and towards the dining room area. Stop near the open double doors on the left. "
  ],
  "path": [
    "5932ea805ae44802a1d412d5d4ab61af",
    "0c2d645fd3b64fee95d8f447e8efdeaf",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "f72782f4282e476ca82a8d09ad226e01"
  ],
  "path_id": 134,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.07691750551167108,
  "num_matches": 3085
},{
  "distance": 12.38,
  "heading": 1.787,
  "instructions": [
    "Turn around and exit the bathroom into the sitting area. Once in the sitting area, turn left and enter the dining room. Once in the dining room turn left and walk alongside the table. At the end, walk straight into the doorway to the kitchen and stop. ",
    "walk out of bathroom towards red chairs, walk in between two red chairs and turn left to walk through doorway, turn left before you reach dining room table and walk straight through doorway, stop before you reach kitchen island. ",
    "Exit the room and walk towards the armchairs.Turn left, and leave the room through the archway towards the dining room. Exit that room and go into the kitchen. Stop in front of the granite counter top. "
  ],
  "path": [
    "69cbdf9fd3b64552b57887b813845cfa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 4656,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04723369996957991,
  "num_matches": 2279
},{
  "distance": 16.6,
  "heading": 0.873,
  "instructions": [
    "Go down the stairs to the level, make a right and go down more stairs, at the bottom level stop. ",
    "Walk towards the stairs and go down the first flight of steps. Turn right and go down the second flight of steps. Stop at the bottom of the stairs. ",
    "Go down the stairs between the two pillars, and go right down the second stair set. Stop at the bottom of the staircases. "
  ],
  "path": [
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 7096,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.033274875524284896,
  "num_matches": 2190
},{
  "distance": 11.33,
  "heading": 4.921,
  "instructions": [
    "Walk with the guardrail on your right. Turn left in the doorway next to the elevator. Stop in the doorway. ",
    "Turn right and go down to the end of the hallway. Go through the door to the left of the elevator and stop. ",
    "Walk along balcony with railing on the right, walk towards the elevator.  Turn left beside the fire extinguisher, and stop in the doorway of the bedroom. "
  ],
  "path": [
    "4e900e156c83453495bfdc9348369b9c",
    "5afc855988064b999acb5b3b180e8348",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 6432,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.1106552293618113,
  "num_matches": 5088
},{
  "distance": 5.29,
  "heading": 1.533,
  "instructions": [
    "Go up to the top of the stairs. Turn into the first door on the right. ",
    "Go up all the stairs and turn right at the first doorway on the right.  Step in the doorway of this bedroom. ",
    "Go up the stairs. Wait at the top. "
  ],
  "path": [
    "58a3dfc91650493d833577f818fccd37",
    "024edcc6db70425aaa54f5596b0ebda8",
    "80befc44c6d14348a3f9bda8ba719d70",
    "bec7a60657d6483996aa2f0d03b9d691",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 5313,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05426658199541713,
  "num_matches": 2522
},{
  "distance": 5.36,
  "heading": 4.986,
  "instructions": [
    "Go down the asleep of the chruch towards the front.  Stop and wait after passing all of the pews. ",
    "Turn of  around and walk straight down the aisle until you reach the first set of pews. Stand ahead of them in the center. ",
    "Walk past pews and wait in front of potted flowers. "
  ],
  "path": [
    "d841f7b710f9470796d55561f8f524db",
    "01c80b5f8fbd4c969ee0bc03f1ec7a6c",
    "82ea5baa30f945fe98f6cad3064af847",
    "d471e89e00be49f49a7ecace814d60bf"
  ],
  "path_id": 884,
  "scan": "YmJkqBEsHnH",
  "source": "R2R",
  "similarity": 0.09264513616512282,
  "num_matches": 2176
},{
  "distance": 8.31,
  "heading": 3.812,
  "instructions": [
    "Walk to the chairs by the pool and wait behind them. ",
    "Walk out of the bedroom and onto the patio. Stop at the bottom of the stairs leading into the patio. ",
    "Walk to the other side of the room and stop behind the chairs. "
  ],
  "path": [
    "87e7b6f2006541a9abe57fba18294a0c",
    "8078fc4f547a4a9cb1a6bb036cc18dc9",
    "cb070d66db084a79b553310df69ed31d",
    "b8f49ffb1486488bbb72693578c17865",
    "094836afff5e4fbfbb6659a96ec665b8",
    "981311e64aec4d3f8e403f349363e065"
  ],
  "path_id": 1939,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.05604279302071629,
  "num_matches": 2687
},{
  "distance": 12.72,
  "heading": 0.103,
  "instructions": [
    "Turn 180 degrees and walk down the steps. Turn right at the bench and take two steps. Turn sharp left and walk straight alongside the railings. Turn right into the doorway after the painting on the right side wall. Once in the room, walk into the bathroom doorway to the right of the bed. Wait by the sink. ",
    "Head down the stairs and go to the carpeted hall on the right.  Go down the hall and turn right into the bedroom that is right before the railing on the left ends.  Turn left into the bedroom bathroom and stop in front of the shower. ",
    "After you go down the stairs turn slightly right go past the elevator and go into the third door on the right. Turn right and go into the bathroom and wait by the toilet. "
  ],
  "path": [
    "abdb1b4d143e491f8a9350b2fd869122",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "9bbc936210084a00ad05856e0f5a3364",
    "ba692fd9ec524282935a608d975374e3",
    "f0501ef281ab486eac400af37a580e19",
    "e968c229f17d4600a704d6197473c5a4",
    "aaaee36fbfc94d26be1a858fceaa91dd"
  ],
  "path_id": 3168,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.07799169475466568,
  "num_matches": 4615
},{
  "distance": 7.77,
  "heading": 2.614,
  "instructions": [
    "Turn around and exit the room. Turn right and enter the hallway. Walk to the end of the hallway and turn left. Stop beside the large cabinet when you walk in. ",
    "Walk out of the bedroom and turn right. Walk into the hallway and turn right. Walk down the hall and turn left. Stop in front of the bathroom. ",
    "exit the bedroom area toward the wooden staircase. Make a right and enter through the white doors. While standing in front of the wall tapestry make a right toward the decorated tree. Continue down the hallway to your right and enter into the first room on the left hand side. "
  ],
  "path": [
    "4531a8cd59c7423e8f938bcd905f7b62",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 5175,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09882852596852883,
  "num_matches": 2458
},{
  "distance": 12.58,
  "heading": 0.006,
  "instructions": [
    "Move forward, turn left, walk forward through the doorway, turn left and wait near the table. ",
    "Turn around and go to the left of the entry. Follow the hallway and turn left, stopping in front of the table. ",
    "Walk to the base of the two staircases and through the columns.  Turn left on the red carpet and keep walking until you get to the red ropes.  Go past the ropes and stop just before getting to the table with the big chandelier over it and then stop. "
  ],
  "path": [
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "a68b5ae6571e4a66a4727573b88227e4",
    "79878e3ae5364a658d3f7a0a683c3505",
    "ba47cad0e7e748c390f8e7d1e94ccbb4"
  ],
  "path_id": 6937,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05136586080743578,
  "num_matches": 2472
},{
  "distance": 9.49,
  "heading": 1.448,
  "instructions": [
    "Turn left and walk toward the three chairs. Wait there. ",
    "Walk past the altar and stop by the three seats. ",
    "Cross the room with the table to the left, go near the three chairs across the room and stop. "
  ],
  "path": [
    "934734efa498455bbbabb9e0cc8e342d",
    "a061bf8e69e74a92b02d4ad45e0d7ab0",
    "084ee8230aac42918476f2b67585fe01",
    "6c6bf7ed2811477cac4123a4be1ac981",
    "7edacf63b7f74af3a3a52bbbbd0732f8"
  ],
  "path_id": 6233,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07217878682836137,
  "num_matches": 5822
},{
  "distance": 8.33,
  "heading": 3.19,
  "instructions": [
    "Exit the room and turn left then go down the hallway until you get to a room with Christmas trees and wait near the trees. ",
    "Exit bedroom and turn left. Walk straight and stop when you come to two small lit Christmas trees. ",
    "Exit the room, go down the hall through the door at the end. Wait in the doorway. "
  ],
  "path": [
    "413903c083d64f2696539cf9f181894e",
    "62994d72dab246fbb839f3699b9cacd6",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792"
  ],
  "path_id": 2280,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.1015267063904165,
  "num_matches": 3323
},{
  "distance": 6.08,
  "heading": 3.35,
  "instructions": [
    "Walk into the bedroom and around the bed. Walk past the bathroom and stop in the doorway. ",
    "Walk inside the bedroom passing the fireplace, the restroom, and exit out of the room. Stop outside the door. ",
    "Turn around and enter the bedroom. Walk to the other side of the room and turn left. Walk into the doorway leading out and stop. "
  ],
  "path": [
    "417f177a50b046b7869044070c9dae28",
    "7a7d3f3cbf65489d9c5336878f268ffa",
    "70e556fba331422596d4473a452ba62f",
    "5f6136a8e25b44a680ed348545b2c752",
    "5c10e79b2673419ebf8d0f84582961ab",
    "4650dea829764ab7bb1557f4fcb603f0"
  ],
  "path_id": 2406,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08173938326648836,
  "num_matches": 2554
},{
  "distance": 5.82,
  "heading": 2.804,
  "instructions": [
    "Walk down the walkway and enter the second door on the right. Wait inside the bedroom by the chair. ",
    "Walk along the banister rail down the hallway passing the small side table with a lamp on top. Walk into the next open door on the right with a written plaque avove the door. Walk into the room with a patchwork blanket on the bed. ",
    "go down the hallway to the room with the teddy bear on the bed. "
  ],
  "path": [
    "d7fe7622c7fd4d87820e180e6a095e33",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "ae97478ce1c84d5588244906fe089558",
    "7f39d79ddfec4b6e9c98e51576d59ab1"
  ],
  "path_id": 1248,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10728571883295199,
  "num_matches": 3901
},{
  "distance": 13.07,
  "heading": 3.099,
  "instructions": [
    "Turn to your left and go past the rope to exit the room to the right of the fireplace. Once in the next room turn left. Walk to the end of the rope and turn right. Walk and stop at the top of the stairs facing down them. ",
    "Turn right and pass the fireplace go out of the room then go left and wait at the top of the stairs on the first step. ",
    "Walk past the chairs and turn right. Walk through the double doors and turn left. Walk to the top of the stairs. Stop on the second stair from the top. "
  ],
  "path": [
    "c03d15601e3d49d2875de7dd3776e237",
    "4f505ab96ae5409782db6ae4fe9fc724",
    "8113cb01c8d944a1af5f2dfc7f008b0c",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 3563,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04504854881037237,
  "num_matches": 3451
},{
  "distance": 11.55,
  "heading": 2.46,
  "instructions": [
    "Exit the bathroom and make a slight left.  Walk through the lobby and stop at the display case next to the bathroom. ",
    "Leave the room, walk past the fireplace and wait in the hall by the curio cabinet. ",
    "Leave the bedroom and walk straight. Pass the fireplace on your right and keep walking. Stop in front of the cabinet at the end of the hallway. "
  ],
  "path": [
    "55e4975d424c416691d6035030cc09be",
    "9224c582bc934d6ab146f7e624b0bab7",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "0e8e2c9d09974dab977c1d3868286f12",
    "9766d89c21094c5b872be3a378d4cbad",
    "12e9fa5962de43698cf9cec57105d287"
  ],
  "path_id": 2596,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05711730360583427,
  "num_matches": 2363
},{
  "distance": 13.95,
  "heading": 1.654,
  "instructions": [
    "Exit the bathroom.  Turn right and walk down to the end of the hall.  Then turn left and enter the dining room. Turn right, walk through the dining room and exit out the patio doors. Wait there. ",
    "Walk out of the bathroom and to the right. Walk to the end of the hall and turn left. Walk into the large room and turn right. Walk straight out of the double doors and stop. ",
    "Exit the bathroom. Turn right. Turn left on the second door. turn right and go out the double glass doors to the patio. Wait near the black bench. "
  ],
  "path": [
    "4cd489ac0eb3416883212e16c15e659e",
    "717b0a0713c44e0ea5b5a557c96076a1",
    "acc96ef459564d42b60eac9dad07708a",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "be0eda30886b4aa882f8ba0b213da958",
    "3c476cfa737347bda82af89dd8127ae3",
    "0e83345cd3d942f09ddc91b80911535a"
  ],
  "path_id": 6392,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09167331493041188,
  "num_matches": 4808
},{
  "distance": 7.86,
  "heading": 0.089,
  "instructions": [
    "Walk through the entryway, and go into the hallway straight ahead. Enter the bedroom through the door on the left. Stop in the doorway. ",
    "Walk past the fireplace and past the stairs.  Go into the second room to the left of the fire extinguisher and stop after stepping in the room. ",
    "Turn left and walk past the stairs. Once you pass the stairs enter the door on the left in front of you and stop. The door should say frontier above it. "
  ],
  "path": [
    "9766d89c21094c5b872be3a378d4cbad",
    "0e8e2c9d09974dab977c1d3868286f12",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 5549,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10661077772835278,
  "num_matches": 3270
},{
  "distance": 7.16,
  "heading": 1.916,
  "instructions": [
    "Go straight until you get to an exit sign then turn right and go into the room. Turn left and go out the balcony. Wait there. ",
    "Go down the hallway away from the wooden posts, turn right into the wooden doorway archway, step into the bedroom, then turn left and step into the glass doorway to the outside and stop. ",
    "Walk down the hall towards the door with the \"exit\" sign over it.  Turn right into the bedroom.  At the foot of the bed turn left and go to the deck.  Stop in the doorway of the deck and the bedroom. "
  ],
  "path": [
    "d3038501401941f8afe4e9e2df5eda73",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "eeb46aee1c014c8b99009457a45838e6",
    "7c10509acee1485ebbaf50f1effb907e",
    "c94a99a685884c29b5f4857fb70298e0",
    "2effe4b38a0e4a6f87aeecd1a10f12c6"
  ],
  "path_id": 3970,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08455181283999823,
  "num_matches": 2165
},{
  "distance": 7.8,
  "heading": 6.017,
  "instructions": [
    "Walk to the left of the bed into the bathroom. Stop in the doorway. ",
    "Walk into the bathroom to the left of the bed. Stop just inside. ",
    "Head indoors, stop in the bathroom and wait near the vanity. "
  ],
  "path": [
    "094836afff5e4fbfbb6659a96ec665b8",
    "b8f49ffb1486488bbb72693578c17865",
    "cb070d66db084a79b553310df69ed31d",
    "8078fc4f547a4a9cb1a6bb036cc18dc9",
    "87e7b6f2006541a9abe57fba18294a0c",
    "138252ad9fab4ae1a86997fc363e6ac7",
    "0c5658ec8f51460fbf29d6aedcfb4bca"
  ],
  "path_id": 5948,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.06855431711905344,
  "num_matches": 3392
},{
  "distance": 8.74,
  "heading": 1.341,
  "instructions": [
    "Walk forward, between the two office desks until you reach the white sofa. Wait at the top of the stairs. ",
    "Walk straight past the office space.  Wait by the stairs next to the couch. ",
    "Go straight and pass the desk on the left that has an iMac then wait at the top of the steps by the sign. "
  ],
  "path": [
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562"
  ],
  "path_id": 3672,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.08423449937346943,
  "num_matches": 2196
},{
  "distance": 9.06,
  "heading": 2.575,
  "instructions": [
    "Walk through the door on your left, past the big table and through the double doors. ",
    "Walk out of the bedroom and into the hallway and straight without turning and straight into the dining room pass the large dining table and through the double doors into the pantry stopping inside the pantry doorway. ",
    "Walk across the hallway to the door on the other side. Walk through the room passed the large table in the middle. Walk through the doors near the wall with the wooden plaques holding brass art. Walk into the storage closet area through the door. "
  ],
  "path": [
    "c1a600332bb245b19d8174c0790d6fd6",
    "9c36a2928f3d436181736d628dd0a694",
    "59163d8ecd3a41038c79bad8d0b51d7e",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "a5f4055ab7134ffcbbe8b33150552301",
    "5fe381d0097f4d0e8124dfbbee82e54f",
    "add134cc07e64d9d8524d0d9f96c4180"
  ],
  "path_id": 649,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.10347437106566645,
  "num_matches": 2157
},{
  "distance": 6.44,
  "heading": 2.765,
  "instructions": [
    "Turn slightly right and enter the doorway. Turn right and exit the room via the farthest doorway to you left. Stay there. ",
    "Go up the steps to the chest of drawers. Turn right and go to the doorway to the left of the sink. ",
    "Turn to face the doorway to the right.\r\nWalk straight.\r\nGo up one step and pass throught the doorway.\r\nTurn to the right.\r\nWalk to the door.\r\nStop in the doorway. "
  ],
  "path": [
    "97db9c9bd9824a3ca623db620331ea66",
    "3fd2f1d849de4e9f8c07863c845db6b5",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "138252ad9fab4ae1a86997fc363e6ac7"
  ],
  "path_id": 1937,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.08764049945484106,
  "num_matches": 6539
},{
  "distance": 8.03,
  "heading": 1.383,
  "instructions": [
    "Go straight into the kitchen and then turn left. Go straight until you get to the round table with chairs that has a horse statue on it and wait there. ",
    "Walk into the kitchen. Make a left in front of the island. Walk past the area rug on the floor. Wait at the dining table. ",
    "Turn left and enter the kitchen. When you reach the island, turn left. Walk towards the kitchen table. Stop to the right of the table just before you reach the wood door. "
  ],
  "path": [
    "7025038ba12d4a63a40c866489226fbe",
    "f4032225a0c6462ba02f728d031c2638",
    "e3eeb7b8deed4a2fa0000daec3538b75",
    "a885c9f037fe45cfbf053e98e4e3d205",
    "e58daa54fe36484984da0fc3e209ee39",
    "ac32217f29704340bf467f51b7f15786"
  ],
  "path_id": 2598,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.08192663137468503,
  "num_matches": 2108
},{
  "distance": 5.86,
  "heading": 0.233,
  "instructions": [
    "Go straight and stop before the staircase. ",
    "Head straight past the books and table until you get to the stairs. Wait there. ",
    "Walk all the way straight passing the entire long table towards the stairs. Walk up one step on the stairs, and stop there. "
  ],
  "path": [
    "c4e9e99398d84df5bf0150c484ebcd01",
    "84291807bc3a4c9ea9f5d7f7ef53704c",
    "cf726b6c0144425282245b34fc4efdca",
    "89f70e0571d64dbf99c48e56287b997f",
    "c6cb369b552f4d3384095bc19eb46e40",
    "7fde4f88b5cf4cda9a2f31331fd7ca22"
  ],
  "path_id": 2310,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.06103502849323219,
  "num_matches": 2891
},{
  "distance": 9.66,
  "heading": 5.887,
  "instructions": [
    "Turn around to where there is a handicapped bathroom to your left. Head down the floral carpet. Continue down the carpet until you get to a door with an exit sign about it. Go through that door in front of you. Once you go through the doorway you will be outside and you are at your destination. ",
    "Go down hallway towards EXIT sign. Exit room through doorway and wait. ",
    "Make a left down at the narrow hall beside the office and walk straight to the exit door. Go out the door and wait. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "a5f4a041a13145a09a4c6603e966b83e"
  ],
  "path_id": 1135,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0707231703063629,
  "num_matches": 3179
},{
  "distance": 10.28,
  "heading": 4.486,
  "instructions": [
    "Walk down the balcony and enter the house through the green door. walk down the hall and enter the bedroom through the second door on the right. Stop next to the door in the bedroom. ",
    "Walk to the end of the patio and enter the door on your right. Walk to the second room on the right. Walk into the bedroom. ",
    "Go through the green door to the left of the bedroom. Go past the door on the right and the picture on the wall. Enter the bedroom with the quilted blanket. "
  ],
  "path": [
    "c9e0bc6b556b440284042049c1f7a3e7",
    "a5f4a041a13145a09a4c6603e966b83e",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "ae97478ce1c84d5588244906fe089558",
    "7f39d79ddfec4b6e9c98e51576d59ab1"
  ],
  "path_id": 1673,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.087214666891262,
  "num_matches": 4187
},{
  "distance": 7.88,
  "heading": 4.373,
  "instructions": [
    "Walk past the two chairs on the left and down the hall to the left of the fireplace. Turn left at the first doorway where a handicap sign will be on your left. enter the bedroom and stop before you make it to the bed. ",
    "Turn and face the fireplace. Head out of the room to the hallway on your left. Enter the first room on your left with the handicap sign. Stop once you have entered the room. ",
    "Pass the bear and when you get to the fireplace turn left. Turn right in the hallway and stop after you turn left in first door. "
  ],
  "path": [
    "93ed5a7cfa504750bee1c7266e67d147",
    "a1b101eeb3804e828253cc562cec8615",
    "12e9fa5962de43698cf9cec57105d287",
    "ae97478ce1c84d5588244906fe089558",
    "7f39d79ddfec4b6e9c98e51576d59ab1"
  ],
  "path_id": 2020,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.07552398066789176,
  "num_matches": 2544
},{
  "distance": 13.06,
  "heading": 0.583,
  "instructions": [
    "Walk to the right through the columns that look like trees and enter the building. Once inside turn left and head across the room towards the fireplace. Turn to the right side of the fireplace and enter the double wood and glass doors. Stop once in the doorway looking at the sitting area. ",
    "With the swing behind you, walk forward and to the left to enter the dining room. Turn further left and start walking towards the fireplace. Before reaching the fireplace, veer right and go through the double doors to the right of the fireplace. ",
    "Walk across porch and enter building. Walk towards fireplace and stop at double doors below deer head. "
  ],
  "path": [
    "525ff4aff6a8413c8e49f667dd007b18",
    "218bbf19f35641d2b7928da523fe44e2",
    "a67abce0a4444fbf93c0203954e1da6d",
    "305629bf76c04f19b7d099d0dabc2574",
    "de49de6069de407195ab646f74a4d796",
    "2e061585204b4ba686fd66f746243127"
  ],
  "path_id": 2351,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05263249749967475,
  "num_matches": 3777
},{
  "distance": 11.38,
  "heading": 4.918,
  "instructions": [
    "Walk straight down the carpeted hallway.  Stay right, until you reach a hardwood floor. Walk next to the green leather chair.  Wait here. ",
    "Walk down the hall and to the right and stop in front of the chair. ",
    "Turn right and go down the long hallway. Go right at the end of the hallway and stop by the first black chair. "
  ],
  "path": [
    "a3c3ba2217b84f62ac4d891d0d029bdb",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "a0aeade23ab74a5f93544047c19718e8",
    "61fbdce455e0426db9e95c4d86e8e028"
  ],
  "path_id": 6747,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08222610140010106,
  "num_matches": 2617
},{
  "distance": 5.96,
  "heading": 2.596,
  "instructions": [
    "Walk past the bookshelves and turn left. Turn left and stop in front of the chair. ",
    "Walk towards the bookshelft to your right, and walk all the way around it...Taking two lefts. Stop in front of the chair thats next to the window. ",
    "Go straight around this path of bookshelves, making two hard lefts and stopping at the large shelf in between two windows. "
  ],
  "path": [
    "128f2cd37ef241cea64bc179a8be82ae",
    "6c47cd8bd2664281bec3740c473946f8",
    "dc3170aacd3f40f2ac2f5b726bd75b88",
    "43f8894f1a9446599a6c89732aa3f2dc",
    "7b19d99c586f456c8095502d78d0f6f8",
    "1818ffc4d0eb47cfa726a12d3cfefee3",
    "1cf9bfa7442841e9b5edc64590d0e879"
  ],
  "path_id": 7093,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04171422085060699,
  "num_matches": 2194
},{
  "distance": 15.32,
  "heading": 4.419,
  "instructions": [
    "With the fireplace towards your right side, enter the room ahead and exit the next room via the rightmost opening on the opposite wall. Continue forward until the carpet ends, then go past the rope barrier to your right and wait on the carpet to the right of the fireplace. ",
    "Walk down the right side of the hallway. Enter through the doorway on the right. Continue walking straight. Turn right and stop at the entrance of the room next to the rope partition. ",
    "Turn left and then wait next to the fire place on the right. "
  ],
  "path": [
    "b4e027328a1b492e85e269df23fef364",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "ba5080db55e84e4f9a9c02a4549e7448",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "807009de2d6c43bf857a9250dc76f8be",
    "057976101e4f4f04b99391f81aa9c1b8",
    "50a6d809b39f4f19b02c4db72111046b"
  ],
  "path_id": 2432,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04665032534537866,
  "num_matches": 2628
},{
  "distance": 17.18,
  "heading": 6.155,
  "instructions": [
    "Turn around and walk to the right past the piano. Walk to the right side of the large column and stop when you reach the first set of benches along the wall. ",
    "Moving away from the alter area, bear left and go between the alter and the pulpit. Jump over the rail and go around the column down the right wall. SIt in the first pew you come to on the left hand side of it. ",
    "Turn around 180 degrees. Go forward. Turn towards pillar on the right. Go forward and stop at bench. "
  ],
  "path": [
    "7fe2b3bb1aab48328a4fcab561f0dd9a",
    "9f7652b8f59f4eac8c2814819ee5c800",
    "77765bc787774a07806ee129edbb9891",
    "3e059da6355345068ddcc214b14b0bdb",
    "b4b83e0d008c488ea48b6795050c52e4",
    "17b98736c06342759c7c5079cb2c78ed",
    "feeada1022ce4fdc990741601b139f0a"
  ],
  "path_id": 4910,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.0637471195096677,
  "num_matches": 5068
},{
  "distance": 7.25,
  "heading": 6.031,
  "instructions": [
    "Walk out of bedroom, cross hall and enter bedroom, stop on couch. ",
    "Turn right and exit in to the hall. Cross the way and stop near the couch. ",
    "exit the bedroom and walk forward to the next bedroom, stop near the bed. "
  ],
  "path": [
    "aec041555da74f3783f941d4e2e24244",
    "413903c083d64f2696539cf9f181894e",
    "62994d72dab246fbb839f3699b9cacd6",
    "aaa8773c86214e9990d4c3ede3223499",
    "223b4ced68cd4688b6612a2795409490",
    "1c7bbe372fcf48beb113ee844b3ae43f",
    "3772d953cd264ebb9ff730bde0bf842c"
  ],
  "path_id": 4902,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.06256436718431639,
  "num_matches": 2106
},{
  "distance": 11.46,
  "heading": 1.757,
  "instructions": [
    "Walk down the hallway toward the office, go to the front door, wait at the top of the stairs to the left of the front door. ",
    "Leave the bedroom and go down the hallway to the right. take a right and go towards teh bear and go down the first two stairs and stop. ",
    "Go down the hall along the railing, to the left of the door and past the back door and stand at the top of the stairs. "
  ],
  "path": [
    "4693d9db2430418ab6e73e48a1969140",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "d101fc142df64f9f8bae9894eb86fb41",
    "12e9fa5962de43698cf9cec57105d287",
    "a1b101eeb3804e828253cc562cec8615",
    "4c477b124d744b75b561bab5d612bfd8",
    "7f83a9b5299744cc8bc32be5d94108c0"
  ],
  "path_id": 958,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05650839125367362,
  "num_matches": 2869
},{
  "distance": 11.19,
  "heading": 0.024,
  "instructions": [
    "Exit the sitting area through the second set of doors on the right. Walk down the hall and wait in the room to the left, next to the wardrobe. ",
    "Walk around the two chairs to the right and step over the rope barrier. Walk down the hallway to the right and wait in the sitting room near the round table. ",
    "Enter the right room next to the fire extinguisher and stop at the stanchions. "
  ],
  "path": [
    "adcc15e35b9441139036aeefda56e0a4",
    "248492258fd5435c8276f59f63ddf0ef",
    "c55fa077761c4154af4b26da88eee80d",
    "744eba592017466eab0da528e0cfdf7c",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "cd680b57443748fcae2de7c8e39970ad",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 1756,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038480728603187915,
  "num_matches": 2126
},{
  "distance": 9.44,
  "heading": 4.845,
  "instructions": [
    "Exit the bedroom and turn left Follow the corridor and stop before reaching the fireplace. Wait there. ",
    "Turn approximately 90 degrees to the right. Move forward. Turn slightly to the right. Wait at the edge of the carpeted walk way. ",
    "Turn around and walk down the hallway to the left. Stop at the end of the hallway when you reach the wood floor. "
  ],
  "path": [
    "eeb46aee1c014c8b99009457a45838e6",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "a0aeade23ab74a5f93544047c19718e8"
  ],
  "path_id": 4232,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08973444317291641,
  "num_matches": 2374
},{
  "distance": 17.09,
  "heading": 3.854,
  "instructions": [
    "Walk through the two columns. Walked forward towards the roped off area. Stop in front of the table with the two large candlesticks. ",
    "Walk between the two columns. Walk past the altar on the right. Wait at the wall mural of Daniel on the right. ",
    "Walk down the aisle and wait near the altar. "
  ],
  "path": [
    "97e40a397edf4dfbae3894c998508284",
    "3e18ef6d21744a9f884a6b148c0d63ac",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "91b89c02a03d48c891bee19a49350f8c",
    "67e8a588a25d4a808d523bc54bec8483",
    "4f54063fb8464b8ca7e08147f2a4ec3e",
    "9ef6399314c94a93abeec2d6054f4658"
  ],
  "path_id": 5344,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07968460844166189,
  "num_matches": 7884
},{
  "distance": 9.48,
  "heading": 2.971,
  "instructions": [
    "Walk forward through the main door with the big oval. In the entry way walk straight past the Christmas tree on your right, and the blue chairs on your left. Once you are past the blue chairs take a left and go into the bathroom and stop in front of the mirror. ",
    "Walk through the door with the glass turn left.  Stop in front of the fireplace. ",
    "Walk straight and go through the door and make a left. Walk past the fireplace and make your first left into the bathroom. "
  ],
  "path": [
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "35aade4482c04c1385cbb19c25bd1d7e",
    "091c189689a74ae3908ba76361e0cae0",
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "b6169d6b759547769509b4d781a8bff6",
    "69cbdf9fd3b64552b57887b813845cfa"
  ],
  "path_id": 468,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05251020410368222,
  "num_matches": 2091
},{
  "distance": 8.09,
  "heading": 1.193,
  "instructions": [
    "Turn right. Walk past couch through doorway. Walk down stairs into kitchen and stop. ",
    "Walk away from the table tennis table. Go down the stairs through the doorway on the right and  stop at the bottom of the stairs. ",
    "Walk across main office to doorway on the right. Walk down the stairs and stop at bottom. "
  ],
  "path": [
    "60e9c84ab617491594f5c2950cc6f3ee",
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562",
    "8ae0426af8824849ba75a6147325c30c"
  ],
  "path_id": 1898,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.08654349877082222,
  "num_matches": 2117
},{
  "distance": 13.67,
  "heading": 3.59,
  "instructions": [
    "Go straight to the first table and chairs.  You'll want to get in the middle of the table and chairs.  Go to the very last set of tables and chairs and then stop and wait. ",
    "Enter the dining room and go between the rows of tables until you are at the back center table. ",
    "Walk towards dining tables. Walk to left around closest table. Turn left before far row of tables. Walk to table lengths. Stop before last tables at end of room. "
  ],
  "path": [
    "122154d283494710ae5e592fc99bf8e1",
    "5fb68178835247328ebd444ea4207d64",
    "5f2a3396b86045d5bc7f283d1e48d8fd",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "dcb7e1f526b646819aa4a485171958a7",
    "434eafc01e8e4a32beeeddba478776bf"
  ],
  "path_id": 1983,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.10854725323258559,
  "num_matches": 5558
},{
  "distance": 12.78,
  "heading": 3.272,
  "instructions": [
    "Facing the fireplace, exit the room via the opening on the wall to your left and ahead of you.Continue down the hallway to your right and exit the building through the door straight ahead of you. ",
    "Go to the left onto the carpeted area.  Continue down the carpeting, with the railing on your right, all the way to the end where there is a door.  Go through the door, stopping just after you exit the building. ",
    "Turn left and then turn right and go down the hallway. Exit the house using the door with the Exit sign on top of the door. Wait there in the porch. "
  ],
  "path": [
    "a1b101eeb3804e828253cc562cec8615",
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "a5f4a041a13145a09a4c6603e966b83e"
  ],
  "path_id": 4758,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06220623414587305,
  "num_matches": 3255
},{
  "distance": 13.13,
  "heading": 5.828,
  "instructions": [
    "Turn 180 degrees and walk up and away from the staircase. Turn toward the fireplace on the right and walk through the doorway to the left of the fireplace. Walk down the hallway. Turn left into the first doorway on the left side of the hallway. Walk into the doorway. Wait by the lamp. ",
    "Go up the stairs turn right and go into the hallway on the left of the fireplace. Turn left into the room and wait near the bed. ",
    "Continue up the stairs, take the left hallway into the bedroom. Stop and wait near the nightstand. "
  ],
  "path": [
    "d4b19206bd8b4771b11a4dbda6cb9bff",
    "28e6276f6b1a44aab5c15e875a4c3a5e",
    "9af627d79c5a44539e3e58a58ab6f534",
    "7deb7519052e480a933602dc9e37bd2d",
    "1b6ad918388b4528bf0b511db7fd6279",
    "d5693cccdffa464d92381eff5fdb96a7",
    "ffcdf5557c684ebf81f6ab3dcef17325"
  ],
  "path_id": 5222,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06377042934875211,
  "num_matches": 2928
},{
  "distance": 12.13,
  "heading": 3.099,
  "instructions": [
    "Turn right in front of the fireplace. Walk around the roped off chairs. Stop in front of the stairway. ",
    "Turn around and walk towards the fireplace. Once you reach the fireplace, turn right and exit the room. Once out turn left and walk to the top of the stairs and stop. ",
    "Walk through the doorway next to the black wardrobe. Follow the path when it turns left. Then turn right where the path does. Then stop at the top of the stairs on the left. "
  ],
  "path": [
    "c03d15601e3d49d2875de7dd3776e237",
    "4f505ab96ae5409782db6ae4fe9fc724",
    "8113cb01c8d944a1af5f2dfc7f008b0c",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a"
  ],
  "path_id": 5760,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.036943540507252154,
  "num_matches": 2590
},{
  "distance": 15.48,
  "heading": 2.239,
  "instructions": [
    "Walk toward the staircase and turn right. Walk through the room and right past the chairs. Stop in the hallway. ",
    "Exit the intersection towards the staircase, make a right and go straight passed the two chairs on the right, make another right into the intersection and stop in the middle of the intersection. ",
    "Go to your right and then enter the door. Turn right again and follow the wall all the way to the doorway on the far right. Then turn right and stop in the hallway. "
  ],
  "path": [
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "6d88b250b28f4f28afbcf356f6a33909",
    "f59c4b4ff65e4a539bbba69e67de001e",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656"
  ],
  "path_id": 6055,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07907589970461681,
  "num_matches": 3552
},{
  "distance": 11.64,
  "heading": 5.178,
  "instructions": [
    "Walk down to the far end of the dining room and turn left into the double doors. Stop and wait near the barber's chair. ",
    "Walk across dinning room table and turn left into room with barber chair. Wait at chair. ",
    "Walk around the table on the left side. Leave the dining room and enter the salon through the double doors on the left of the table. Stop once you enter the room. "
  ],
  "path": [
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "a5f4055ab7134ffcbbe8b33150552301",
    "ce5df3235866447d95c4667d72528984",
    "21dd8e71dae64f378401cb0eba702b7d",
    "60296c63d7814cd09749634f671708ad",
    "5eedd74c2a86462dafb8031559666b15",
    "4cc28f0811834f66a8b759b463fa7f9c"
  ],
  "path_id": 5405,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.09183823601148533,
  "num_matches": 2319
},{
  "distance": 14.24,
  "heading": 2.239,
  "instructions": [
    "Walk towards the stair case, and continue walking till you reach the doorway directly left the vase with the flowers on it. Stop right under the doorway. ",
    "Go straight toward the stairs then turn right. After you pass the stairs turn sharp left. Turn right and go into the double doors. Wait at the entrance. ",
    "Head towards the staircase and turn right. Go past the stairs.  Stop at the archway by the vase. "
  ],
  "path": [
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 6142,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.061828949443838106,
  "num_matches": 2250
},{
  "distance": 10.31,
  "heading": 4.308,
  "instructions": [
    "Go left and wait beside the pianos. ",
    "Go across the room to the left of the big hallway with the grey division to the right, go passed the red stairs on the left, and stop between the stage on the right and the red chair on the right. ",
    "Walk forward, stop at the table covered with a white cloth. "
  ],
  "path": [
    "718fd0815e6d475589ded3064273ed83",
    "1cd4f0434b674da68cd767be462c3e0a",
    "89559bf340b349139dc344bf2df9738e",
    "fefc6d6091ec4a3cb4000d35af5aad9c",
    "6a854b67fc22440eb123d9e712ddd4e9"
  ],
  "path_id": 7055,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07603714925613278,
  "num_matches": 4104
},{
  "distance": 13.06,
  "heading": 4.862,
  "instructions": [
    "Turn around and turn left. Wait at the bottom of the stairs. ",
    "Go down the hall and wait at the base of the stairs. ",
    "Leave the bedroom, and go left. Walk down the hallway to the elevator. Take a right at the elevator. Stop at the bottom of the stairs. "
  ],
  "path": [
    "172c2604a9054ee784ac24f7af45250a",
    "4e900e156c83453495bfdc9348369b9c",
    "5afc855988064b999acb5b3b180e8348",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "c69af2f0e57b485886e0f4667b2209a5"
  ],
  "path_id": 2580,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0861310193256434,
  "num_matches": 4453
},{
  "distance": 9.51,
  "heading": 0.006,
  "instructions": [
    "Turn around and exit the foyer. Enter the room on the left and wait in front of the fireplace. ",
    "Go between the two stairs and down three steps. Go past the grandfather clock and pass through the open doorway on your left. Stop and wait just inside the room. ",
    "Walk forward, turn left, enter the room to the right side, and wait near the fireplace. "
  ],
  "path": [
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 4053,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.0668365815283669,
  "num_matches": 3108
},{
  "distance": 9.67,
  "heading": 5.668,
  "instructions": [
    "Walk past the wooden seats and across the room. Stop by the large column. ",
    "Turn around and go to the end of the row and stop near the pillars. ",
    "Walk along the red sofa seat area through the main room of the church. Continue past the pews ahead and stop near the arched column structure leading to a small enclosed area. "
  ],
  "path": [
    "23b6674835004403ab9356fdc7e2a7d5",
    "e0eedf6b9fb74a548a2d52ab5717dce6",
    "e68704357c84455b85daa74e98a892ec",
    "ec1f835335ec483d81238a3729e7d34a",
    "91b89c02a03d48c891bee19a49350f8c",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "3e18ef6d21744a9f884a6b148c0d63ac"
  ],
  "path_id": 5785,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.13356426486122777,
  "num_matches": 13972
},{
  "distance": 9.49,
  "heading": 6.066,
  "instructions": [
    "Go indoors. Go straight toward the fireplace. When you get to the fireplace turn left. Wait in that hallway. ",
    "Enter the building and walk through the dining room. Walk past the flat screen on the left and enter the hallway. Wait near the phone. ",
    "Enter the building.  Walk next to the bar and the wall with the television hanging on it.  The bar and the television will be on your left as you walk.  Take the first door on your left and stop in front of the bathroom door. "
  ],
  "path": [
    "0e83345cd3d942f09ddc91b80911535a",
    "3c476cfa737347bda82af89dd8127ae3",
    "be0eda30886b4aa882f8ba0b213da958",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6199,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09271777628525721,
  "num_matches": 3953
},{
  "distance": 8.69,
  "heading": 3.059,
  "instructions": [
    "Walk forward past red setting area, and wait at door entrance. ",
    "Walk straight until you pass all the pink chairs. Go past the two metal decorations and wait there. ",
    "Go through the middle of the two sets of chairs. Stop just oustide the entryway. "
  ],
  "path": [
    "9ef6399314c94a93abeec2d6054f4658",
    "6d300c6b06e944349dd9ab9ffed93aeb",
    "9b838098731b452ba242bdc550557425",
    "6847b3528b67416ead2f7771a5264be8",
    "86f8f01b0e3d46cc8df986bfe693b12e"
  ],
  "path_id": 5584,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.04437690583671418,
  "num_matches": 2426
},{
  "distance": 8.22,
  "heading": 5.004,
  "instructions": [
    "Exit the bedroom through the hallway door. Proceed through the hallway to its end, then turn left. Enter the room and wait by the bathroom door. ",
    "Turn left and exit the room. Go straight until you get to a large door with a wreath on the left. Turn left and wait there. ",
    "Go through the door directly in front of you, take a right and go down the hallway. Stop in front of the garden room. "
  ],
  "path": [
    "e57db85f00a9481787bd9c3c98453f27",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 6837,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09209503547508613,
  "num_matches": 2141
},{
  "distance": 11.96,
  "heading": 5.82,
  "instructions": [
    "Walk forward through the banquet hall. Stop in front of the middle chair at the end of the room. ",
    "Walk straight ahead and wait by the chairs lines up against the back wall. ",
    "Walk straight across the dining room. Wait by the large wooden double doors. "
  ],
  "path": [
    "434eafc01e8e4a32beeeddba478776bf",
    "dcb7e1f526b646819aa4a485171958a7",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "03d493822ac64466ba416f084a9d3bb9",
    "6b06f294636f4fcd9bddeb75cda61c6d"
  ],
  "path_id": 3662,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.10061057767292639,
  "num_matches": 4065
},{
  "distance": 11.52,
  "heading": 3.103,
  "instructions": [
    "Walk through the sitting area and turn left. Then walk through the dinning room. Then walk into the kitchen. Stand near the counter top. ",
    "walk away from the green chairs towards the red chairs, turn left once you walk past the red chairs, turn left before you pass the dining table, walk through another doorway, sop when you reach the kitchen counter. ",
    "Walk between the red chairs toward chritmas tree. Turn left and walk though the opening toward the dinning room. Walk along the left hand wall of the dinning room and into the kitchen.  Walk the end of the counter with a bunch of bananas on the right. "
  ],
  "path": [
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 2309,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.047698176377610604,
  "num_matches": 2369
},{
  "distance": 10.38,
  "heading": 1.689,
  "instructions": [
    "Exit the bedroom. Turn right. Continue and turn left onto the wooden floor. Stop next to the wooden table with a lamp on it. ",
    "Turn around and exit the door to the right side of the bed. Once out, turn right an walk all the way down the hallway. Turn left at the end and stop once you enter the room and the blue couch is to your right. ",
    "Exit the bedroom, and turn right. Keep walking forward, and turn left when you can no longer go forward. Enter inside, and stop next to the checkered cushioned sofa. "
  ],
  "path": [
    "5f6136a8e25b44a680ed348545b2c752",
    "5c10e79b2673419ebf8d0f84582961ab",
    "4650dea829764ab7bb1557f4fcb603f0",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "d101fc142df64f9f8bae9894eb86fb41",
    "12e9fa5962de43698cf9cec57105d287",
    "9766d89c21094c5b872be3a378d4cbad"
  ],
  "path_id": 4876,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09496893119456935,
  "num_matches": 4552
},{
  "distance": 5.26,
  "heading": 2.17,
  "instructions": [
    "Walk along the balcony and down some stairs, and wait at the first landing. ",
    "Walk forward and go down the stairs. Stop on the second stair past the landing. ",
    "With the nearest bookshelves to your left, go forward until you reach the stairs leading downwards to your right. Go down those stairs to the first landing, then go one more step on the second flight of stairs to your right. "
  ],
  "path": [
    "f8f15aaf58354ce1b990df2ab33381bb",
    "0e6e6b0332d745178dd37fc1d4a710a2",
    "bfd3e9defa8742118917a4a5cc9190a3",
    "9b253c8eec6c40528ee7fbfc011316a1",
    "5ca7bfc500ec4d928285e61efee2dde5",
    "3beab818935e4ed8aefd2d4d080130fa",
    "3a256f31181143e9844d11ca49211aa4"
  ],
  "path_id": 2533,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04624057883657335,
  "num_matches": 2328
},{
  "distance": 9.37,
  "heading": 6.267,
  "instructions": [
    "Turn around and walk out of the room. Turn left and follow the wood railing to the end and then turn right. Stop at the bottom of the stairs. ",
    "Walk out the doors and turn left. Walk down the hall and turn right. Stop at the bottom of the stairs. ",
    "Leave the room, and go left. Walk down the hall, and take a right at the elevator. Stop in front of the stairs. "
  ],
  "path": [
    "f6ac6ccfda544d34aa5c89ab1915e5d0",
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "c69af2f0e57b485886e0f4667b2209a5"
  ],
  "path_id": 5900,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10161903789416143,
  "num_matches": 4307
},{
  "distance": 16.63,
  "heading": 6.257,
  "instructions": [
    "Go past the ropes and go straight down the red carpet and past the stairs on your left. Go into the sitting room through the door on your right straight ahead and stop once you pass the doors. ",
    "Walk into the hallway with the red rug. Once out of the walkway turn right and go through the door closest to the two main doors. Wait at the entrance to that room. ",
    "Make a right from the door facing the gold couch and go down the long narrow hallway. Go down the hall until you see a room with steps then make a right so you in front of the door on the right side of the room. Go through that door and wait by the big mirror and fireplace. "
  ],
  "path": [
    "e25b3ee74de846c18029e06899faf471",
    "057976101e4f4f04b99391f81aa9c1b8",
    "807009de2d6c43bf857a9250dc76f8be",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "ba5080db55e84e4f9a9c02a4549e7448",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 877,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04278416231073619,
  "num_matches": 2446
},{
  "distance": 13.27,
  "heading": 5.82,
  "instructions": [
    "Go into the front door, and walk along the left side of the room until you reach a doorway on the right side of the wall. Go into the hallway and walk straight ahead. Stop at the bathroom door. ",
    "Enter the house, walk past the front counter, turn left, and enter the bathroom. ",
    "Walk into the house through the french doors.Walk past the bar and television. Turn left into the first doorway. This is the women's bathroom. Wait by the door. "
  ],
  "path": [
    "c63c6df5237e4943af24e74af8bec007",
    "3c476cfa737347bda82af89dd8127ae3",
    "be0eda30886b4aa882f8ba0b213da958",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "761e41fbabfd4f1c80c3ab77df6732ce",
    "635e26ebc0594a23b1159bb0c6d15cc8"
  ],
  "path_id": 3167,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12767521777487165,
  "num_matches": 6760
},{
  "distance": 5.91,
  "heading": 2.674,
  "instructions": [
    "Leave the room and wait in the hall, outside the door. ",
    "Go out of the room and wait just outside the doorway. ",
    "Exit the room through the doorway to the right, step into the doorway and stop. "
  ],
  "path": [
    "b0f72ba7e21947e780e3301e364e97da",
    "48398dee77ab44adbe2486df3d18bfe6",
    "767bb19c79af4193937ebe7c911a1d9e",
    "9e94e381ffbf44eabc4b3fb0f8bff78a",
    "cc7f149e59eb47fd8bde336f2bf3391d"
  ],
  "path_id": 2595,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08159058193563398,
  "num_matches": 2081
},{
  "distance": 5.61,
  "heading": 2.235,
  "instructions": [
    "Face the fireplace and walk through the door to the left of the fireplace to enter the \"Great Room.\"  Stop when you get through the doors before you get to the first circular dining table. ",
    "Walk through the living room passed the fire place. Go through the open glass double doors into the room with great room plaque above the door. Walk into the dining room and stop near the closest table ahead. ",
    "Move forward to stand in front of the book case. Move to stand facing the arch way of the great room and then move through it. Then move forward to face the nearest dining table. "
  ],
  "path": [
    "e9784db75b934f59aa5ba67102b2b872",
    "8d1f61d5e90e43deb38eb12af08ebf1b",
    "777f43a3702841698d8da94900ba8a2d",
    "2e061585204b4ba686fd66f746243127",
    "de49de6069de407195ab646f74a4d796"
  ],
  "path_id": 181,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08817048976540114,
  "num_matches": 5719
},{
  "distance": 7.98,
  "heading": 6.171,
  "instructions": [
    "walk left around table to and go straight passed the chairs to the wall of doors. Stand in front of the middle door and stop. ",
    "Walk around the desk and towards the the door at the far end of the room. Stop off the rug before you leave the room. ",
    "Turn around and make a left. Walk through the door straight ahead that has the arched transom. "
  ],
  "path": [
    "846adaa1177c459892edfe6f5eadafbc",
    "e8d145225316479db17c06bd77df5054",
    "5038f4f54ed14bef980e59f9e76ce0de",
    "6ce4614650fd4294852d7fbeb89ef6be",
    "b2c2abdd75de4ea6b203f890bf89cfb0"
  ],
  "path_id": 1512,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.1088811750703174,
  "num_matches": 4590
},{
  "distance": 8.23,
  "heading": 2.418,
  "instructions": [
    "With the glass windows and doors showing the outside to your left, move forward on the wooden flooring until the kitchen island is to your left. Turn right and go to the top of the stairs that lead downwards. ",
    "Go straight and pass the glass table with chairs on the left. Then as you are passing the bar with the chair/stools on the left turn right and go down three steps of the stairs then stop. ",
    "Facing the glass table, go right through the way, turn right after the oven. Go down the stairs a few steps and stop. "
  ],
  "path": [
    "b543b745552746b9bab6146057a23f8e",
    "2063eaa6e4b64fb5bca5cf30886f30cd",
    "b8ec757801244836bf17dcb1622c3022",
    "a39174aaa3fc4dff9b37f30cc03ab21b",
    "a56b95f00285452db9a95545aed7b5b7",
    "c5f25b19987f458c958bd4965936313f",
    "ec360e7b39e1449287ee29a80a55345c"
  ],
  "path_id": 3685,
  "scan": "sKLMLpTHeUy",
  "source": "R2R",
  "similarity": 0.12765659940262447,
  "num_matches": 2099
},{
  "distance": 11.49,
  "heading": 3.748,
  "instructions": [
    "Walk towards the red arm chair. Walk between the red arms chairs and head to the dining room with the chandelier. Make a left and walk to the kitchen island. ",
    "Walk past the fireplace, between the pink chairs. Walk through the dinning room and stop in the kitchen next to the barstools. ",
    "With the Christmas tree to your right, walk towards the red chair and into the dining room.  Walk down the length of the dining room and into the kitchen at the other end of the table.  Stop just after stepping into the kitchen. "
  ],
  "path": [
    "124c7635126f4fefaf3c57742dbe1193",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 4295,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04878500164026005,
  "num_matches": 2432
},{
  "distance": 13.32,
  "heading": 3.166,
  "instructions": [
    "Go up the right staircase.  Turn left on the landing and continue up the stairs, stopping at the second stair from the top. ",
    "Turn left and walk up the stairs. Wait at the top of the stairs. ",
    "Walk up stairs to landing, turn left and continue to top of steps, wait at top of stairs. "
  ],
  "path": [
    "f4810f2f18cb497389628bd8738ba036",
    "e49192047ff241b5933dfef7b832b8fe",
    "f490656d21134ff79be372d985ad965c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 3346,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04170088466950609,
  "num_matches": 2666
},{
  "distance": 7.28,
  "heading": 6.028,
  "instructions": [
    "Walk next to the pool with the pool on your left hand side.  When you get to the bar with the sink in it, turn right and stop by the L-shaped table with the single wooden chair. ",
    "Turn towards your left and walk along the edge of the pool. Once you reach the other side of the room turn right. Head towards the desk and then stop behind the desk facing the 3 steps. ",
    "Cross the patio and wait at the far end of the steps. "
  ],
  "path": [
    "e775ea81e83c45719de5a1577f8f7e39",
    "9b2b12257e9a4c5d9f99f141769e9301",
    "4739d48c61a04deab15db1eb2c906a96",
    "c460d0f6ea8a4458a576efb07d043b39",
    "e37d923ec8284523b5c9ebdb35800a3a"
  ],
  "path_id": 2915,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.049888754119827385,
  "num_matches": 2022
},{
  "distance": 5.48,
  "heading": 4.907,
  "instructions": [
    "Go up the stairs into the bedroom. Stop on the top stair. ",
    "Turn left. Go up the steps and wait there. ",
    "Walk away from the pool and towards the stairs leading inside.  Walk up steps.  Wait at the top. "
  ],
  "path": [
    "4739d48c61a04deab15db1eb2c906a96",
    "ff2dd63ad83245c3b4831b4f8a6911ac",
    "2596868500734b1496d479e6936cceb3",
    "981311e64aec4d3f8e403f349363e065",
    "094836afff5e4fbfbb6659a96ec665b8"
  ],
  "path_id": 7265,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.0750671801172011,
  "num_matches": 3098
},{
  "distance": 12.34,
  "heading": 1.642,
  "instructions": [
    "Walk past vanity. Make left at wood railing. Walk past antler chandelier. Walk past stone fireplace. Make left at elevator. Wait at threshold of bedroom door. ",
    "Turn slightly right and exit the room. Turn left and walk along the hallway. Enter the farthest door on the left. Wait by the doorway of the bedroom. ",
    "Walk through the bathroom past the fishing decorations and sink through the open door to the hallway. Turn into the hallway and follow the banister railing towards the chimney stone wall. Continue towards the elevator at the end of the hallway. Walk through the open door near the elevator and fire extinguisher. "
  ],
  "path": [
    "7d397b5319364783b60956966785ae9f",
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 1268,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09464303698194344,
  "num_matches": 4220
},{
  "distance": 14.76,
  "heading": 3.088,
  "instructions": [
    "Exit the office and then exit the sitting area. Wait in the hallway between the two doorways. ",
    "Go the the left of the table and through the doorway on the left, once in the room turn left and go through the middle doorway on the left side of the room, take a few steps through the doorway and stop. ",
    "Go out the door on the left then go out the second door on the left and wait there in the hallway. "
  ],
  "path": [
    "b2c2abdd75de4ea6b203f890bf89cfb0",
    "7a45313ee05048f2bfa610ac81986e1c",
    "52131a7696fc47f4bffd1c0cfd57a454",
    "93848517830e4376a3d3576c16e3685f",
    "8906c7b18ea149a786d9f2cb83bd2f16",
    "994e59a2e5cb469eb29c7ff68c6d49c2",
    "bde29f48ab814943baf4a7193d143d6e"
  ],
  "path_id": 2588,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0866044268105829,
  "num_matches": 4552
},{
  "distance": 8.23,
  "heading": 0.238,
  "instructions": [
    "Walk around the table down the length of the room.  Stop behind the first chair that faces the window with the bookcase behind you. ",
    "Walk through the study area past the many bookshelves against the walls along the large table. Walk towards the stair well and turn around the end of the table towards the bookshelf on the opposite side of the room. ",
    "walk across the library with the table on your left.  Then turn to the left and walk to the other side of the table. Wait at the corner of the table. "
  ],
  "path": [
    "7515999894aa42ffa9ce63c8cabe246c",
    "c4e9e99398d84df5bf0150c484ebcd01",
    "84291807bc3a4c9ea9f5d7f7ef53704c",
    "cf726b6c0144425282245b34fc4efdca",
    "87e385b82c704a29855826d3cf4f79a0",
    "4610dfb32d044ad793cf8640a7ede0f4"
  ],
  "path_id": 1731,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.043406084863834925,
  "num_matches": 2285
},{
  "distance": 6.87,
  "heading": 1.862,
  "instructions": [
    "Walk to the left of the pillar. Walk past the table and chairs. Stop in the doorway. ",
    "Turn right and exit the building, going into the small outdoor area. Stop in the doorway. ",
    "Turn right and walk across the room through the tables and exit the room via the doors and wait there. "
  ],
  "path": [
    "a6734c6148c94913afe0ab92b7a48175",
    "aa24fa06dc084de4bc97ed54cb1dc2ae",
    "e0093bd0b2b34317801a57d0bf0e0308",
    "ac7774052c8648c596c3b77776426479",
    "1723396e89154f649171f0def3b8cccc",
    "218bbf19f35641d2b7928da523fe44e2"
  ],
  "path_id": 1897,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12131865424497688,
  "num_matches": 7106
},{
  "distance": 9.06,
  "heading": 4.051,
  "instructions": [
    "Enter and the large room, walking to the right of the long wooden table with several lamps on it. Walk directly straight ahead through the door in front of you. Then continue and stop in the doorway of the bedroom. ",
    "Go straight across the dining room into the beige doorway and then straight again into a second doorway and a bedroom and then stop. ",
    "Walk straight across the room and stop in the door way. "
  ],
  "path": [
    "add134cc07e64d9d8524d0d9f96c4180",
    "5fe381d0097f4d0e8124dfbbee82e54f",
    "a5f4055ab7134ffcbbe8b33150552301",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "59163d8ecd3a41038c79bad8d0b51d7e",
    "9c36a2928f3d436181736d628dd0a694",
    "c1a600332bb245b19d8174c0790d6fd6"
  ],
  "path_id": 3716,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.10375766078226759,
  "num_matches": 2148
},{
  "distance": 5.28,
  "heading": 5.237,
  "instructions": [
    "Leave the porch and go inside and make a right towards the bed. Go to the left corner of the bed then make a left. Stop at the clothes rack. ",
    "Turn and walk through the doorway. Walk towards the bed. Turn left and walk towards the bathroom. Stop in front of the robes hanging in the closet. ",
    "Enter the bedroom and walk around the bed into the closet. Stop in the closet. "
  ],
  "path": [
    "96478d4e66104792b0481887c85255a8",
    "1dc09ae6cd914f67b9234869e5e11104",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "efe359ee05ea46c587196354c2d1cc96",
    "8b41e8798d78402f9f36b242972d729b",
    "11ec36e3d78c43a389366c5159069b0c"
  ],
  "path_id": 1951,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.0756167799990222,
  "num_matches": 3299
},{
  "distance": 12.24,
  "heading": 5.718,
  "instructions": [
    "Walk past the Christmas tree out of the room and go left at the base of the stairs.  Stand under the ceiling fan and go into the doorway to the dining room between the red and yellow chairs.  Stop in front of the first chair you reach in the dining room. ",
    "Exit the room though the opening to the right of the fireplace. Continue forward an to the left to pass through the pocket door opening in the opposite corner ahead of you. Stop next to the dining table with twelve chairs around it. ",
    "Walk past the red couch and out the door. Walk through the living room and past the two red chairs. Stop after you walk into the dining room. "
  ],
  "path": [
    "8bc03fde666a466893e069325db4a807",
    "77a6b37bf22f49afae1a9d30d736a00b",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 6914,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04156976041959553,
  "num_matches": 2268
},{
  "distance": 6.15,
  "heading": 3.409,
  "instructions": [
    "With the double doors directly to your right and the window directly behind you, move forward past the fireplace on your right until you pass the rope barrier and are standing on the carpeted pathway. ",
    "Walk forward past the fireplace. Step onto the red rug ahead, and stop. ",
    "Go to the fireplace. Stand on the red carpet. "
  ],
  "path": [
    "21e7a431303c4b4e9e41e90bdafc3bec",
    "1bcdf4d037c249bf80d837856ed65779",
    "fddd2a92c75a4e4baedcdf0659e9dad1",
    "ba47cad0e7e748c390f8e7d1e94ccbb4",
    "79ee9be0827a4de19da5b3e475e3ae0a"
  ],
  "path_id": 3624,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.07214572065339431,
  "num_matches": 3063
},{
  "distance": 6.1,
  "heading": 2.682,
  "instructions": [
    "Walk out the door in front of you. Then walk out the door to your right and exit the bathroom. Walk into the bedroom and walk to the other side of the bed. Stop while looking out the window over the table and chairs and the ocean. ",
    "Go straight through the door and turn right through the door. Then go straight towards the window and passed the bed. ",
    "Go through the brown door to the white door. Then go through the white door past the foot of the bed.The stand between the side of the bed and the window. "
  ],
  "path": [
    "40c3d461ced54be485f5d6144952f2de",
    "5c3fa398480741ff9d996b26596e647c",
    "45ee2d428b7c42a98afe21f68a8fa298",
    "8b41e8798d78402f9f36b242972d729b",
    "efe359ee05ea46c587196354c2d1cc96",
    "0a709d588fcd4ae5badd921366074d7a",
    "156af10f63d84956ba5dc4b9fe3b2140"
  ],
  "path_id": 3001,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.06469666050928642,
  "num_matches": 2161
},{
  "distance": 16.78,
  "heading": 2.693,
  "instructions": [
    "Turn around and walk to the bottom of the stairs. At the bottom, turn left and then enter the door to your left, right before the white chairs. ",
    "Walk down stairs and turn left and walk toward closet door and stop. ",
    "Go down the stairs. U turn left and go into the room on the right. Wait at the entrance. "
  ],
  "path": [
    "bb2ed22637c342ba8acb80a377f234f9",
    "ea8c31ffae82450f87d19ca1ac4d01b7",
    "10b11d5c0cb7449baca31324b6a371bb",
    "ed46f2e3d89d4f2ea2ec7b14affef69d",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 5807,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.045652035327025775,
  "num_matches": 2381
},{
  "distance": 18.79,
  "heading": 5.723,
  "instructions": [
    "Walk through the hall into the next room and left around the chairs. Walk through the doorway and right around the desk. Walk through the doorway to the left of the chairs and stop. ",
    "Walk through the open door. Walk past the animal tusks on the table to the left. Walk through the open door to the left of the ship in the glass case. Walk past the curtained windows on the left. Walk through the open door between the burgundy chairs. Wait at the threshold of the door. ",
    "Head out through the main seating area and use the doorway to the far left to pass straight into the bedroom. Wait near the clothed tabled. "
  ],
  "path": [
    "be255b95116f48599c036544957334ec",
    "764cb58a8d31461892ca6bdc675c14df",
    "6e1e3e8662774c8b9906d3c0a3b1ed3f",
    "93848517830e4376a3d3576c16e3685f",
    "52131a7696fc47f4bffd1c0cfd57a454",
    "bcf71cd8fa804d5abff84ad22a552450",
    "dafcbb94981f4b719d2cbb741737830b"
  ],
  "path_id": 5892,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.051515238846187826,
  "num_matches": 2491
},{
  "distance": 9.5,
  "heading": 4.386,
  "instructions": [
    "Go through the dining area and wait to the right of the wooden end table and love seat. ",
    "Walk across the room and stand next to the patio set. ",
    "Walk straight head and cross the room going past the long table and bar area. Stop once you reach the pink, green and brown couch. "
  ],
  "path": [
    "0891f9ad46d741a4844ff53e8623aec3",
    "61ff336a2ec442268785b388864ea348",
    "7025038ba12d4a63a40c866489226fbe",
    "c3a25551d0e74186ab736e502f621f9e",
    "da041807b0184761af4e74df5006b95e",
    "9f7f95239ff04f7581f1cf9a4b5a9eaf",
    "4a3c031b6787433fb02da9d40a359c68"
  ],
  "path_id": 3249,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06436922146398319,
  "num_matches": 2272
},{
  "distance": 12.66,
  "heading": 6.058,
  "instructions": [
    "Enter the building and walk through the dining area. Wait in the doorway under the mounted deer head. ",
    "Walk straight into the house. Turn left and go past the table and chairs until you get to a fireplace. Go into the room that is to the right of the fireplace. ",
    "Walk inside past the two pillars.  In the room with the tables, walk left until you see the fireplace.  Go through the door to the right of the fireplace and stop when you are standing under the mounted deer head. "
  ],
  "path": [
    "2936d8831e8a41ca98980ff2fd83e00a",
    "74c229ab7552402fbd3d6a6bcc35e569",
    "218bbf19f35641d2b7928da523fe44e2",
    "a67abce0a4444fbf93c0203954e1da6d",
    "305629bf76c04f19b7d099d0dabc2574",
    "de49de6069de407195ab646f74a4d796",
    "2e061585204b4ba686fd66f746243127"
  ],
  "path_id": 4269,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06320632474283679,
  "num_matches": 4689
},{
  "distance": 14.61,
  "heading": 0.993,
  "instructions": [
    "Enter the house and angle right, walking close to the chairs on the right side. Continue past the staircase and turn right. Wait in the doorway with the double doors. ",
    "Facing the large open staircase, go into the room and veer to the right of the staircase, going through the third arched double door opening on the right. ",
    "Go inside, turn slight right and start going forward along the left wall, go into the second to last archway then stop. "
  ],
  "path": [
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "9cc6191a6e1642f984e54b1a79b83761",
    "d35b945333f5413a9f5586b794cd2680",
    "3d8ad75bfd9148c29e199b69d68d30d4",
    "f5bef118db5b41849ce63cbfcefed938",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 3838,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10095394340648965,
  "num_matches": 5434
},{
  "distance": 7.38,
  "heading": 4.427,
  "instructions": [
    "Walk down to the bottom of the stairs. ",
    "Go down the stairs. Stop upon reaching the bottom. ",
    "Go down the stairs and wait beside the chairs at the base of the stairs. "
  ],
  "path": [
    "2bd537f50326424fbd7f77b371319eca",
    "585c34af2340439e9fa507888421bb9b",
    "30c97481412946f292272d28af5d00dd",
    "b72bbf5f815e43bca6bf4509fd7c9258",
    "5c1275543c164a4f9bc60b08d8cb5c43",
    "c92b9bd8b885423b8d6d1a7a58d2ca2c",
    "1349a908694c4494999f72c36e52e1bf"
  ],
  "path_id": 6083,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.1354171756967481,
  "num_matches": 3137
},{
  "distance": 12.91,
  "heading": 3.347,
  "instructions": [
    "Walk into great room. Walk past dining table and chairs. Walk past bar. Walk through open french doors. Wait outside doors. ",
    "Enter the dining area, and then move forward to the backyard, and wait by the door. ",
    "Walk out of the sitting room and go forward into the dining hall. In the dining hall go around the table to the right and walk straight out of the doors. Once you walk out of the doors onto the patio stop parallel to the wooden bench on your left. "
  ],
  "path": [
    "8d1f61d5e90e43deb38eb12af08ebf1b",
    "777f43a3702841698d8da94900ba8a2d",
    "96331f871893432f8bf3206ad2205cdd",
    "576196703bb14f4f99fe187d8bebafec",
    "3c476cfa737347bda82af89dd8127ae3",
    "0e83345cd3d942f09ddc91b80911535a"
  ],
  "path_id": 509,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08898753868299951,
  "num_matches": 5766
},{
  "distance": 5.48,
  "heading": 0.72,
  "instructions": [
    "Walk in between the two leather benches and go outside.  Stop when you have passed the second door and are outside. ",
    "Turn right and walk down the small hallway and out the door. Stop once you walk outside. ",
    "Walk through the two benches and head outside. Stop once you are outside, before you reach the pillars. "
  ],
  "path": [
    "3335ef42f9b04940830e43c65ca2d971",
    "7f71bf54a3884deabc7cb90728c7e77d",
    "cb7d4a315dc446459a9bb060475ea9a1",
    "def212eb7c6644d19129693d7301cc0d",
    "577bcd8b4957430ea30e90bc6dc5dca6",
    "c7828415afe64434b4ae153750568149"
  ],
  "path_id": 3879,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.07590605059219596,
  "num_matches": 2162
},{
  "distance": 9.79,
  "heading": 5.887,
  "instructions": [
    "Head toward the stairs, pass the fireplace then the stairs then continue straight until you get to a door that leads into the room. Wait at the entrance. ",
    "Walk straight all the way passing the staircase on the right to enter the very first room next to the fire extinguisher on the wall. Enter the bedroom door and stop there. ",
    "Turn left and walk past the staircase. Keep heading straight and enter the doorway straight ahead beside the elevator. Stop at the door looking in at the bed and zebra chair. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "9766d89c21094c5b872be3a378d4cbad",
    "0e8e2c9d09974dab977c1d3868286f12",
    "c69af2f0e57b485886e0f4667b2209a5",
    "70d67ed19aa34e34845d32ca74a1d711",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 2922,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09710061002294774,
  "num_matches": 3974
},{
  "distance": 13.64,
  "heading": 2.958,
  "instructions": [
    "Turn and around and take a right turn to go between the benches. Turn left passed the pillar and stop at the end of the first bench on the right. ",
    "Walk a bit forward, and turn right at the very first empty space between the benches. Keep walking forward passing the pole, and stop in front of the bench that have maroon cushions on them. ",
    "Turn around and walk forward. Turn right to go down the aisle between the seats. Once you reach the other end, turn left and stop at the end of the seat against the wall. "
  ],
  "path": [
    "308f9ac247e047f8acfaa347bf292cf7",
    "32b26022662440e4a2bd82f59e53d34a",
    "32e8651e5eb940c7bff34e65a4f4cbbd",
    "13350d0001004a9cb366910df03c2532",
    "522196670f2e4e5783391c7b1255cb8b"
  ],
  "path_id": 4467,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07535473870437248,
  "num_matches": 4432
},{
  "distance": 5.59,
  "heading": 0.261,
  "instructions": [
    "Go to the other side of the library and stand on the red dot. Follow the blue dots. ",
    "Turn so the windows of the room are on your left.  Walk to the end of the long table, next to the lamp. ",
    "Turn around and walk towards the leftmost and farthest red chair in the room and wait there. ",
    "Walk to the left along the table. At the end of the table stop in front of the chair on your left. "
  ],
  "path": [
    "cf726b6c0144425282245b34fc4efdca",
    "84291807bc3a4c9ea9f5d7f7ef53704c",
    "c4e9e99398d84df5bf0150c484ebcd01",
    "7515999894aa42ffa9ce63c8cabe246c",
    "4c793e5198034f3eb52a199745373fb8"
  ],
  "path_id": 219,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04727631415887188,
  "num_matches": 2168
},{
  "distance": 16.88,
  "heading": 3.245,
  "instructions": [
    "Exit room through the middle double doors.  Walk across room and take the first door on the left. Continue straight through hallway stop on rug inside door. ",
    "Exit the room through the double doors, pass through the corridor and enter the hallway to the far left. Proceed through the hallway. Wait by the doorway. ",
    "Turn left and exit the room out the wood doors. Go across the next room and enter the door to the far left. Walk forward and stop when you reach the large rug. "
  ],
  "path": [
    "0026d80fc3c84d91bd088b831d230738",
    "fadac209cfc04129998323d048a5c908",
    "f5bef118db5b41849ce63cbfcefed938",
    "0cb7f98845aa4939a1125d430acb7183",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "cfd9511c06b34cd1b89ba36919a4e6b6"
  ],
  "path_id": 6205,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06785311997751105,
  "num_matches": 3118
},{
  "distance": 6.11,
  "heading": 2.765,
  "instructions": [
    "Leave tile room to hallway, turn right and stop at bathroom sink. ",
    "Exit the Mosaic room through the archway. Turn right. Head toward the far door and sink area. Stop there. ",
    "Exit the room and go right.  Wait by the open door. "
  ],
  "path": [
    "97db9c9bd9824a3ca623db620331ea66",
    "3fd2f1d849de4e9f8c07863c845db6b5",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "0c5658ec8f51460fbf29d6aedcfb4bca"
  ],
  "path_id": 4842,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.08952245965609935,
  "num_matches": 6581
},{
  "distance": 11.74,
  "heading": 4.176,
  "instructions": [
    "Walk out the double doors into the large open room. Go straight across the room and enter the doorway straight across. Once you enter the next room, stop when you reach the rug. ",
    "Walk straight across the open room with the staircase and through the door straight ahead of you. Stop just inside the next room, just before you step on the red rug. ",
    "Go straight until you get to the room with the large light blue carpet. Continue straight and go into the room next to it with the large pink carpet. Wait there. "
  ],
  "path": [
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "f12b7ffe7f9e4ece9bd927edf6b52b71",
    "1ad73ac43096496f9b6084071d1d944f",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 4022,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10587717811078878,
  "num_matches": 4253
},{
  "distance": 9.47,
  "heading": 1.146,
  "instructions": [
    "Exit the room, walk past the stairway and the fireplace, then turn left. Proceed through the doorway and wait by the door. ",
    "Leave the bathroom and walk straight out and past the staircase.  Turn left at the fireplace and start to walk outside, passing the bear.  Step in the first doorway near the blue stuffed chair and stop. ",
    "Exit the bedroom and go straight towards the blue chair, turn left after and around the black bear, step into the near front doorway and stop. "
  ],
  "path": [
    "5ca14589a7c4407b9333c3dc02d9c9a5",
    "c69af2f0e57b485886e0f4667b2209a5",
    "7f03669f1daf499491770eb857dbe25d",
    "4c477b124d744b75b561bab5d612bfd8",
    "93ed5a7cfa504750bee1c7266e67d147",
    "fc9b08fa1b5b486380466b40b1d633f6"
  ],
  "path_id": 6492,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05705507079128438,
  "num_matches": 2044
},{
  "distance": 12.05,
  "heading": 5.734,
  "instructions": [
    "Turn left and go past the light blue chairs. Turn left and go up the stairs. Wait at the top. ",
    "Turn around and walk past the chairs. Turn left and go up the stairs. Wait at the top of the stairs. ",
    "Leave the sitting area, and go to the left. Go up the stairs, and stop at the top of the stairs. "
  ],
  "path": [
    "8d6772b59ad247debb77bf51b0ae00cb",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 4522,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.047045764699332485,
  "num_matches": 2795
},{
  "distance": 11.54,
  "heading": 1.556,
  "instructions": [
    "Go up the stairs on your left and then go into the second room on your left. Wait there in the laundry room. ",
    "Walk all the way up to the top of the stairs. Head straight, and turn left at the second room that is a laundry room. Enter inside the laundry room, and stop there. ",
    "Go up all of the stairs, and then go towards a framed picture of a ship, but turn left when you see a laundry room. "
  ],
  "path": [
    "7234d14e0a884f35a6a02e21985b8273",
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "cefe85eb9d1e4592a020547df6107246",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "087bf4ad4a0b4a17afc2d6c173eceff3",
    "3851376d4f84494ebdc080b34ddc0f5e"
  ],
  "path_id": 2383,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09094199002963681,
  "num_matches": 2004
},{
  "distance": 9.34,
  "heading": 3.058,
  "instructions": [
    "Make a right at the hallway at the top of the stairs and go straight down the hallway. At the end of the hall make a left and go down that small hall. Go into the bedroom straight ahead and wait on the couch by the bed. ",
    "Go to the left and head down the hall past the Christmas tree.  Turn left and go into the Garden room.  You'll go till you get to the setee.  Then you need to wait. ",
    "Walk out of the glass door nearest to you. . Walk through the hall past the hanging tapestry. Walk along the hall over the floor rug. Turn the corner and walk into the bedroom. "
  ],
  "path": [
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490",
    "1c7bbe372fcf48beb113ee844b3ae43f",
    "3772d953cd264ebb9ff730bde0bf842c"
  ],
  "path_id": 598,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09267694443396406,
  "num_matches": 2545
},{
  "distance": 12.38,
  "heading": 2.804,
  "instructions": [
    "Go through the door and turn right and then walk out the double door to your right. Wait right before the stairs between the two pillars. ",
    "Walk through the doorway, turn right into the foyer. Walk through the foyer to the door. Walk out of the door and onto the porch. ",
    "Go through the doorway and turn right.  Head through the double doors and stop on the porch. "
  ],
  "path": [
    "377785e3a8ec4ce7bff6de3035f6fcd5",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 3156,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06719307611552601,
  "num_matches": 2594
},{
  "distance": 14.14,
  "heading": 0.133,
  "instructions": [
    "Go down the stairs and then wait in the middle. ",
    "walk down the stairs, turn right and walk down those stairs, stop in the middle of the red tile at the bottom. ",
    "Go down the stairs, and at the landing go right. Continue down the stairs to the next landing. Stop on the landing. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 3366,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04372004537242404,
  "num_matches": 2866
},{
  "distance": 5.42,
  "heading": 2.693,
  "instructions": [
    "Continue climbing the stairs all the way, then turn ninety degrees to the right at the top. Stop even with the gap between the first and second sheets of glass acting as a safety barrier. This will be just a step or two. ",
    "Walk right up the stairs and turn right. Stop to the right of the top of the stairs. ",
    "Walk all the way up the stairs, and turn right at the top of the stairs, and stop there. "
  ],
  "path": [
    "5c1275543c164a4f9bc60b08d8cb5c43",
    "b72bbf5f815e43bca6bf4509fd7c9258",
    "30c97481412946f292272d28af5d00dd",
    "585c34af2340439e9fa507888421bb9b",
    "4224e105e67346bf9a22f8d74e137a4f"
  ],
  "path_id": 5071,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.13389019840274097,
  "num_matches": 2484
},{
  "distance": 11.24,
  "heading": 4.57,
  "instructions": [
    "Walk straight past the lounge chairs then walk straight past the table with chairs. go down the stairs on the left. go down four steps then stop. ",
    "Go forward toward the white table and chairs. Turn left and enter the stairs. Go down 2 steps. Wait there. ",
    "Walk across balcony to other side. Walk down the steps and stop on the 2nd step from the top. "
  ],
  "path": [
    "ec480cf25f5d4f869ff93e455aa707e5",
    "4bfaa80c580e44199e4be62c205857b3",
    "7158079b64374ecab3e24a2b7e1b4e5f",
    "7cdc8d66cb0b408d8c82c16e6f08bf8f",
    "4224e105e67346bf9a22f8d74e137a4f",
    "585c34af2340439e9fa507888421bb9b"
  ],
  "path_id": 4622,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.13186723431080666,
  "num_matches": 3364
},{
  "distance": 5.67,
  "heading": 5.887,
  "instructions": [
    "Leave the room where the office is and make a right. Go down the hall and go to the doorway to the bedroom at the end of the hall. Wait in the doorway of the bedroom. ",
    "Start in the hallway. Walk forward. Turn left into the bedroom. Stop in the bedroom. ",
    "Walk down the narrow hallway with the handicapped bathroom on the left. Take a left into the bedroom.  Stop in the bedroom in the doorway. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 919,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.1177004746313282,
  "num_matches": 4044
},{
  "distance": 6.38,
  "heading": 1.862,
  "instructions": [
    "Turn until you're facing the wall with several doors marked with an \"exit\" sign above them. Exit the room through the rightmost set of doors on the opposite wall from you. ",
    "Turn right and walk across the dining room and out the single door to straight ahead. Stop once you walk outside. ",
    "Head forward towards doorway. Stop at doorway to outside. "
  ],
  "path": [
    "a6734c6148c94913afe0ab92b7a48175",
    "aa24fa06dc084de4bc97ed54cb1dc2ae",
    "e0093bd0b2b34317801a57d0bf0e0308",
    "ac7774052c8648c596c3b77776426479",
    "1723396e89154f649171f0def3b8cccc"
  ],
  "path_id": 5911,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11604606775277686,
  "num_matches": 6004
},{
  "distance": 7.73,
  "heading": 3.866,
  "instructions": [
    "Leave the bedroom, and take a left. Enter the bedroom on the left. Stop in the doorway to the bedroom. ",
    "Exit the bedroom and go into the carpeted hallway.  Turn hard left and walk straight.  Make a left into the room in front of treasure chest.  Wait here. ",
    "Exit the bedroom and turn left. Then enter the doorway on the left and wait near the nightstand. "
  ],
  "path": [
    "223e143862134f51b3e794c840d495c4",
    "7f39d79ddfec4b6e9c98e51576d59ab1",
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 7021,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12351376292863687,
  "num_matches": 5018
},{
  "distance": 6.86,
  "heading": 1.693,
  "instructions": [
    "Walk past the bathroom, approach the stairs and stop at the bottom of them. ",
    "Exit the bedroom and head towards the stairs going up that are just to the right of the elevator. ",
    "Leave the bedroom. Go towards the elevator. When you see the staircase, go to the bottom of the staircase. Go up three stairs and stop. "
  ],
  "path": [
    "e02fb3abf4094f259a283baba2b507b4",
    "55e4975d424c416691d6035030cc09be",
    "9224c582bc934d6ab146f7e624b0bab7",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "abdb1b4d143e491f8a9350b2fd869122"
  ],
  "path_id": 3153,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0705356986313805,
  "num_matches": 2167
},{
  "distance": 10.07,
  "heading": 3.227,
  "instructions": [
    "Walk to the door. Take a left outside the room. Walk straight down the hallway. Make a hard right into the next room. Stop inside the doorway. ",
    "Exit out of the room through the door to your left. Turn left and walk down the hallway. Stop inside the first door to your left and turn to facing in the room. ",
    "Leave the bedroom. Take a left in the hallway and walk down the hall. Enter the bedroom that is the first door on your left. Stop in the doorway. "
  ],
  "path": [
    "e968c229f17d4600a704d6197473c5a4",
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 2243,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09457184700416936,
  "num_matches": 3721
},{
  "distance": 13.93,
  "heading": 3.297,
  "instructions": [
    "Turn around and walk out the door and into the hallway. In the hallway turn right and enter the large dining room. Turn left and exit the room through the middle of the big doors and stop when you reach the blue rug. ",
    "Walk down hall, turn right at intersection into dining room. Turn left and walk into huge sitting room. Wait in center of room. ",
    "face two doors walk through doorway on the left towards old bathroom, turn right before bathroom walk towards carpet, turn left at table and walk through giant doorway and stop when you reach the carpet. "
  ],
  "path": [
    "ba3207f81c55467fa7e6760f6232fb07",
    "60399cb6fd9d42a7a364f155fd152361",
    "babbef7305e34152950788aa9cb363cc",
    "faddc614417b4861b4cd05176a35b947",
    "8b22751d94034268b26b9960c1d28e4e",
    "c645fc0e7e2a488fbed3580e98bd041e"
  ],
  "path_id": 4636,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0623432693225821,
  "num_matches": 3080
},{
  "distance": 7.72,
  "heading": 3.192,
  "instructions": [
    "Walk left between the building and the pool chairs and stop between the pillar and the large windows on the curved part of the building. ",
    "Walk along the side of the building to the left of the pool. Stop at the first pillar past the pair of pool chairs. ",
    "Turn around, go pass the open glass doors and around the corner to the right there are three glass windows, stop at the second window of the three windows. "
  ],
  "path": [
    "66b44573b30f4fa399a17fdb42c6ac56",
    "b4f2a9c0410e493eb66b0e122036b5d3",
    "e53e60f82e70459db4fd37f4923f1731",
    "22c3cd83edaa4600b770a340a7ffc7d0",
    "69927c24eb2c4e6985023be5a0f5ddda",
    "9c9e6b39325f419c993b20f197873ab2",
    "2ceda1b045884d2ab366b65d31b9dfff"
  ],
  "path_id": 7110,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.08115921474138459,
  "num_matches": 4985
},{
  "distance": 7.28,
  "heading": 3.062,
  "instructions": [
    "Exit the room and stop in the bedroom doorway, near the exit. ",
    "Exit the bathroom to the room. Turn left and exit the room using the door on the left. Turn right and go into the room next door on the right. Wait at the entrance. ",
    "Exit the bathroom and bedroom. Go right, and down the hall. Take the last right into the bedroom. Stop in the doorway to the bedroom. "
  ],
  "path": [
    "aaaee36fbfc94d26be1a858fceaa91dd",
    "e968c229f17d4600a704d6197473c5a4",
    "f0501ef281ab486eac400af37a580e19",
    "4e900e156c83453495bfdc9348369b9c",
    "1e013670f0ba4c9494734cedf464e11a"
  ],
  "path_id": 5100,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09455873380950122,
  "num_matches": 3453
},{
  "distance": 5.24,
  "heading": 0.261,
  "instructions": [
    "Walk up the first flight of stairs, and stop at the top. ",
    "Walk straight past the long table towards the stairs.  Go up one set of stairs.  Wait by window. ",
    "Head forward and up the stairs. Stop on the landing. "
  ],
  "path": [
    "cf726b6c0144425282245b34fc4efdca",
    "89f70e0571d64dbf99c48e56287b997f",
    "c6cb369b552f4d3384095bc19eb46e40",
    "7fde4f88b5cf4cda9a2f31331fd7ca22",
    "cd9fd57e2de04c39b87e7fbe92e80a6c",
    "3a256f31181143e9844d11ca49211aa4",
    "24f4450a5eb14381b8ed20ee31ac44ac"
  ],
  "path_id": 6758,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.07096682747270579,
  "num_matches": 3276
},{
  "distance": 6.61,
  "heading": 5.914,
  "instructions": [
    "Walk out of bedroom and turn left. Walk down to end of hall. Turn left into bedroom. Walk to bathroom and wait there. ",
    "Exit the bedroom and go to your left. Go into the next bedroom on your left. Stand in the entrance to the bathroom. ",
    "Turn around approximately 90 degrees, then move toward the wooden support pillar in front of you. Hang a slight left and move into the open wooden door frame. Turn slightly left and move into the bathroom. After you've entered, turn right and wait in front of the open shower curtain, facing it. "
  ],
  "path": [
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab",
    "319ddb17492a4fcead1debf39bbafd95"
  ],
  "path_id": 1066,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11138997336991274,
  "num_matches": 3572
},{
  "distance": 11.81,
  "heading": 1.45,
  "instructions": [
    "Walk down corridor and turn right at second desk. Walk over and stand beside white dresser. ",
    "Walk through the office past the work tables. Go to the right and stop next to the white bookshelf outside the conference room. ",
    "Walk past desks. Walk past green floor vase. Wait at white bookshelf. "
  ],
  "path": [
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "caada625c5b4460da34bd695539db791",
    "77b24e884d9f47599994c1ade95f0b89",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "334f156071b34579ae4772f623b03429",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "6855b783e2f34c7981b90ddb5de81bd7"
  ],
  "path_id": 313,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.06832003119154646,
  "num_matches": 2307
},{
  "distance": 15.22,
  "heading": 6.19,
  "instructions": [
    "Turn around and walk through the hallway between the windows. Walk down the steps and turn slightly right. Walk across the room and enter the middle doorway. Wait there. ",
    "Exit the room. Go straight into the room and turn right. Go into the door in the center and wait in the hallway. ",
    "Walk through the narrow doorway between the two glass pane windows. Continue into the next room with a large floor rug and arm chairs around the room. Walk past the couch in the middle and past the music box. Walk through the arched window door in the middle of the wall ahead and stop in the hallway. "
  ],
  "path": [
    "5e65c1a2439f4594b4a433c805221c05",
    "be255b95116f48599c036544957334ec",
    "764cb58a8d31461892ca6bdc675c14df",
    "9f6684e165434894a5185bb5c3e2c275",
    "8e0a04db99fd4c61a9f669d2e6e421a8",
    "994e59a2e5cb469eb29c7ff68c6d49c2",
    "bde29f48ab814943baf4a7193d143d6e"
  ],
  "path_id": 5380,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06988964765390189,
  "num_matches": 2752
},{
  "distance": 9.62,
  "heading": 4.75,
  "instructions": [
    "Go through the entryway to the right and continue passed the couch to the other entryway. Then turn right again and go into the next room stopping in front of the chair. ",
    "Go right into the doorway. keep going into the next doorway by the pink chair. Keep going towards the right until you come to a room with a blue carpet. ",
    "enter room with christmas tree, walk across room between two chairs turn right at stairs and enter sitting room, stop on circle rug. "
  ],
  "path": [
    "b411496c1f7b403981f0c2f24995309c",
    "150763c717894adc8ccbbbe640fa67ef",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "267a7e2459054db7952fc1e3e45e98fa",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "50e0cf4daca44c7a9e2a6f6475650ca3"
  ],
  "path_id": 2073,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04548573947010625,
  "num_matches": 2143
},{
  "distance": 14.84,
  "heading": 2.667,
  "instructions": [
    "Cross the pink carpet and go through the first door on the left. Exit the building through the middle set of doors on the left and stop on the veranda halfway to the steps. ",
    "Walk into the room on the left. Walk out the door on the left and wait on the porch. ",
    "Turn slightly left and enter the doorway closest to you on the right. Walk towards the blue carpet and turn slightly left again. Enter the middle doorway going outside. Wait there. "
  ],
  "path": [
    "266e6bf3657149d8a116533e34e6ebf8",
    "0b4d4c11e012429e8dd6013502094ef3",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "1ad73ac43096496f9b6084071d1d944f",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 1645,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07591869680263537,
  "num_matches": 3572
},{
  "distance": 6.4,
  "heading": 2.518,
  "instructions": [
    "Go up the steps then turn left and go up the stairs. Go up five steps then wait near the windows on the right. ",
    "At the top of the stairwell, enter the white double doors. Upon entering the doors, veer to your left towards the staircase in the room. Proceed up the steps to the first landing on the stairwell. ",
    "Continue up the stairs into the room. Go up some of the stairs on the left and stop infront of the open window. "
  ],
  "path": [
    "ad6096a762cd43788ca5c5c37fa06c36",
    "082f6f6ac7c241669643586b39ce562b",
    "87e385b82c704a29855826d3cf4f79a0",
    "7fde4f88b5cf4cda9a2f31331fd7ca22",
    "cd9fd57e2de04c39b87e7fbe92e80a6c",
    "3a256f31181143e9844d11ca49211aa4",
    "24f4450a5eb14381b8ed20ee31ac44ac"
  ],
  "path_id": 4857,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.05177963125881134,
  "num_matches": 2012
},{
  "distance": 5.37,
  "heading": 2.972,
  "instructions": [
    "Enter the bedroom, enter the balcony through the door by the bed, wait right outside. ",
    "Exit the bathroom. Walk through the bedroom room towards the closest glass doors to the bed. Wait there. ",
    "Walk past the bed and go to the left to the outside doors.  Go outside just a step and then wait. "
  ],
  "path": [
    "45ee2d428b7c42a98afe21f68a8fa298",
    "8b41e8798d78402f9f36b242972d729b",
    "efe359ee05ea46c587196354c2d1cc96",
    "0a709d588fcd4ae5badd921366074d7a",
    "156af10f63d84956ba5dc4b9fe3b2140",
    "5cd96a7c879547eda2a90077c79bc7f0"
  ],
  "path_id": 815,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.06116210080711881,
  "num_matches": 2033
},{
  "distance": 6.15,
  "heading": 2.258,
  "instructions": [
    "Go down the stairs, past the Christmas tree on your right, and wiat facing the room with the fireplaplace. ",
    "Walk down the stairs, when you reach the bottom stop at the christmas tree. ",
    "Turn around and go down the stairs. Walk forward and stop in front of the CHristmas Tree. "
  ],
  "path": [
    "bec7a60657d6483996aa2f0d03b9d691",
    "80befc44c6d14348a3f9bda8ba719d70",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "41873d3929e64a9a938a5fac3b6bbd79"
  ],
  "path_id": 286,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04184867207819885,
  "num_matches": 2097
},{
  "distance": 12.39,
  "heading": 1.27,
  "instructions": [
    "Exit the building, turn left, go up the stairs, turn left, wait at the bottom of the brick porch stairs. ",
    "Walk outside and head left to the stairs. Go all the way up and stop at the top after stepping into the gravel. ",
    "Walk out onto the patio and go up the stairs on your left. At the top of the stairs stop next to the bush before the stairs on your left. "
  ],
  "path": [
    "2fe8aba87e074b98affe61cbdb5513ce",
    "136ca89bcb5d441c877de80ebbeb6490",
    "5c2ab2b08f2d40b3aa4dd5f25013d924",
    "e6d04c82a21d48a99b341364be89ac9b",
    "585143782fc64b66b2dae68d231cb5ac",
    "c13f32e90f194abb8299c146a7f45152",
    "5cc8851fe8e74cf6b8dd3114df833c2a"
  ],
  "path_id": 1120,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.029990622613564524,
  "num_matches": 2239
},{
  "distance": 8.28,
  "heading": 3.341,
  "instructions": [
    "Go down the stairs and take a left. In the sitting room take another left and go into the changing room. Stop in the doorway of the changing room. ",
    "Walk down the stairs and make a left then make a left in the sitting room. Go straight back to the doorway of a small room and wait. ",
    "Go down the stairs and turn left. Turn left again to go through the doorway to the room with the white covered chairs. "
  ],
  "path": [
    "e0d208d8f64d48d59aa8a971c3892e29",
    "b99113566bdc4b3e8937225e42421488",
    "8d27cd9bb3884465a9c48ad38fde69fd",
    "28170cad00aa4938a612db2e82628000",
    "d807887a425a41249a31c69a41adb313",
    "46e170296a7f4b88b50ebeb7e2a27894"
  ],
  "path_id": 1527,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09287224859730192,
  "num_matches": 5826
},{
  "distance": 5.53,
  "heading": 4.75,
  "instructions": [
    "Walk past table, into kitchen and wait by counter. ",
    "Walk past the dining room table on the right. Go through the doorway and wait next to the kitchen counter. ",
    "Stay left of the table and walk through the door into the kitchen and go to the marble kitchen counter. "
  ],
  "path": [
    "b411496c1f7b403981f0c2f24995309c",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 2671,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05967994612503229,
  "num_matches": 2098
},{
  "distance": 11.65,
  "heading": 4.887,
  "instructions": [
    "Go into the dining room. Go to the China cabinet. ",
    "Walk straight across dinning room hall and stop before artwork on wall. ",
    "Facing the fireplace, turn right and go past the timber pillars. Continue until you're next to the wall in front of an abstract sculpture of wooden furniture pieces and hardware. "
  ],
  "path": [
    "8fa748001d8d47c8aa0c116d9fd14866",
    "3c476cfa737347bda82af89dd8127ae3",
    "28820411ff1e480fbf07e06854400b66",
    "564602b369f64e398b859ec38dee1dc2",
    "a5afa591a36d4fcd91439ad2b8c5213f"
  ],
  "path_id": 3034,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09380988605104323,
  "num_matches": 5142
},{
  "distance": 13.47,
  "heading": 6.143,
  "instructions": [
    "Go straight and pass the chairs and the large mirror on the right then turn right and head toward the stairs. Wait on the second step to the top. ",
    "Walk forward, past the sitting area and follow the red carpet into the next room. Following the red carpet, turn right and then left. Wait at the top of the stairs on the right. ",
    "Go into the next room with the lit chandelier. Go to the top of the staircase in that room. "
  ],
  "path": [
    "8f2fdc0067f64a15b2efec9cc0b773e5",
    "f0244e1e73e34c6997e25f07e9b42328",
    "e2f7333559be465d94798c1940b2e582",
    "248492258fd5435c8276f59f63ddf0ef",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 3678,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.034195467978156625,
  "num_matches": 2087
},{
  "distance": 9.72,
  "heading": 0.164,
  "instructions": [
    "Exit bedroom, make a left, walk toward next bedroom and stop at door. ",
    "Turn right and exit the room. Once out, turn left and walk down the hallway. Once you pass the 2 brown chairs on your left, turn left and enter the door and stop. ",
    "Stepping between the couch and the bed heading toward the open door. At doorway make a left and your next immediate left across from the bathroom stopping just inside of doorway. "
  ],
  "path": [
    "ca38c3e0cbcf4a4992d79889e5793cb7",
    "2754c89e3b2645d598ace5d7878f5d13",
    "980150b99a2946a0894c33df8fb616d2",
    "e5c5d8fa1ad94d97bcdb74e69e938ea0",
    "de68d1221d1749b392aff06c48512cf0",
    "99fa48d974fa43988f369b0e5766b36e"
  ],
  "path_id": 5501,
  "scan": "1LXtFkjw3qL",
  "source": "R2R",
  "similarity": 0.1018638204255104,
  "num_matches": 3722
},{
  "distance": 11.48,
  "heading": 4.524,
  "instructions": [
    "Turn left ninety degrees.  There is a large table in front of you.  Walk towards the table.  Stop before you get to the rug.  Turn thirty degrees to your right.  Walk towards the doorway.  Stop in front of the food warming station.  Turn twenty degrees to your left.  Walk straight until the doorway is on your right.  Turn ninety degrees so that you are facing the open doorway.  Walk through the doorway.  Stop when you are halfway down the hall.  There is a large staircase in front of you. ",
    "Walk across room to exit at double doors. Wait at door to bathroom. ",
    "Turn left and walk through the dining room. Go through the double doors and wait in the hallway. "
  ],
  "path": [
    "c645fc0e7e2a488fbed3580e98bd041e",
    "8b22751d94034268b26b9960c1d28e4e",
    "faddc614417b4861b4cd05176a35b947",
    "babbef7305e34152950788aa9cb363cc",
    "60399cb6fd9d42a7a364f155fd152361"
  ],
  "path_id": 4608,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.053637108499062655,
  "num_matches": 2322
},{
  "distance": 14.58,
  "heading": 3.819,
  "instructions": [
    "Turn around and go by the pillars. Keep going straight and then turn left and go by the fan. ",
    "Walk between the tall marble pillars. Follow the walkway to the left then head towards the metal floor fan towards the right. Stop before the floor fan. ",
    "Go through the pillars to your right  Turn left to  walk through the room to the left of the four chairs. Stop once you are left of the chairs. "
  ],
  "path": [
    "15d5b6a9851746e79e53e7451e1b2528",
    "3e18ef6d21744a9f884a6b148c0d63ac",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "91b89c02a03d48c891bee19a49350f8c",
    "2094de1e2c934d9ca603a405739df547",
    "3c88cda1e8444d1e8687e05a16856c16"
  ],
  "path_id": 6660,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.09333387672378747,
  "num_matches": 7538
},{
  "distance": 17.77,
  "heading": 3.349,
  "instructions": [
    "Go down the stairs turn right and continue going down the stairs. Turn left on the second door. Wait near the fireplace. ",
    "Turn around and go all the way down the stairs to the right. At the bottom, turn left and enter the door to the right of the stand up clock. Stop once you enter the room. ",
    "Go down to the bottom of the right side of the staircase. Go through the door on the right side of the grandfather clock. "
  ],
  "path": [
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 4379,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038519517030471344,
  "num_matches": 2248
},{
  "distance": 6.05,
  "heading": 3.7,
  "instructions": [
    "Turn slightly to your right. Walk straight across the dining area, passing one set of tables. When you come to another set of tables, which are against the wall, stand between them and wait. ",
    "In this room there is one doorway. On the same wall as the doorway there is a line of round tables. Go stand between the two tables nearest to the doorway. ",
    "Walk between the tables to the wall on the other side of the room. "
  ],
  "path": [
    "ce74442bd2174d5b9c306bd0867182c5",
    "dbfc751a205b487382c667588623d464",
    "5f2a3396b86045d5bc7f283d1e48d8fd",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "4122ef1b23ca44b78c7cb26fa1c6a645"
  ],
  "path_id": 3457,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.09447317870105346,
  "num_matches": 2906
},{
  "distance": 8.98,
  "heading": 3.782,
  "instructions": [
    "Turn around and exit the room out of the curtains on your left. Once out turn left and enter the white door. Once through, turn right and go down the steps. Stop when you reach the first turn in the steps. ",
    "Walk through the doorway with black curtains.  Immediately take a sharp left, and enter through the door left of the mirror.  Make a quick right, and walk forward until you reach stairs.  Walk down the stairs.  Wait by red flowers in the left corner. ",
    "Exit the bedroom, turn right into the double doors, take a few steps down the stairs and stop. "
  ],
  "path": [
    "a85bf887101b49c3aee8b0da72cd4189",
    "e57db85f00a9481787bd9c3c98453f27",
    "de655166da274d40841f1e5e488ab641",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "88f5ba9d06ac4413b1a3908af6544308",
    "be3d7ae0352d481191e4c9e351e71b08",
    "bec7a60657d6483996aa2f0d03b9d691"
  ],
  "path_id": 5352,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05274615182595926,
  "num_matches": 2343
},{
  "distance": 8.91,
  "heading": 5.648,
  "instructions": [
    "Exit the bathroom and turn right, then proceed down the hallway. Turn left and stop near the stairs. Wait near the door of the second bedroom. ",
    "Exit the bathroom. Take a left into the corridor. Take a sharp right. Walk down the corridor. Exit through the double doors on the left. Take a slight left. Stop at the bedroom door. ",
    "Walk out of the bathroom and then turn left. Turn right and walk down the hallway. Turn left at the entrance to the staircase and then wait once in front of the door on the left. "
  ],
  "path": [
    "d6528b757c554836b2dfaa811e5df3ed",
    "69dc547801584e1a9aa129ff36289f52",
    "6249652893364b62b1c30df6c6516a71",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 2396,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.06477940567313403,
  "num_matches": 2069
},{
  "distance": 13.19,
  "heading": 3.008,
  "instructions": [
    "Walk down the stairs and turn into the second door on the left. Stop next to the fireplace. ",
    "Walk down the stairs, turn left, enter the doorway on the right side of the grandfather clock. Wait near the fireplace. ",
    "Walk down the stairs to the bottom, then turn left.  Walk past the  clock and enter the room on the left. Stand next to the fireplace. "
  ],
  "path": [
    "e87f560e1b5a497487526e64db42f8c8",
    "3c9615b3193a4e71ae932ea45fef8dde",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 4017,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.044772086079224865,
  "num_matches": 2183
},{
  "distance": 14.05,
  "heading": 5.158,
  "instructions": [
    "Walk down the stairs. and enter the rightmost doorway to your left. Walk along the red carpet, cross the gated area to the right  and wait there. ",
    "go down the stairs, turn left, go down the steps, turn right, go down hallway, turn right, go over the velvet rope, stop immediately on the corner of the rug. ",
    "Go down the stairs. At bottom landing, turn right to go down the hallway. When you have met the red rope, turn right and stand on corner of large carpet. "
  ],
  "path": [
    "e49192047ff241b5933dfef7b832b8fe",
    "3c9615b3193a4e71ae932ea45fef8dde",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "807009de2d6c43bf857a9250dc76f8be",
    "057976101e4f4f04b99391f81aa9c1b8",
    "50a6d809b39f4f19b02c4db72111046b"
  ],
  "path_id": 1909,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04311283803323263,
  "num_matches": 2291
},{
  "distance": 7.28,
  "heading": 4.886,
  "instructions": [
    "Go left out of the bathroom the go in the first door on the left down the hallway. Go right into the bathroom and stand in the doorway. ",
    "Exit the room and keep walking. Turn left entering another room. Make a slight right turn near the bed and stop in front of the toilet bowl. ",
    "Go into the hallway and then go left, then go into the first room on your left, next turn right and stop in the doorway to the bathroom. "
  ],
  "path": [
    "1e013670f0ba4c9494734cedf464e11a",
    "4e900e156c83453495bfdc9348369b9c",
    "f0501ef281ab486eac400af37a580e19",
    "e968c229f17d4600a704d6197473c5a4",
    "aaaee36fbfc94d26be1a858fceaa91dd"
  ],
  "path_id": 1032,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08065596674237105,
  "num_matches": 3089
},{
  "distance": 11.86,
  "heading": 3.782,
  "instructions": [
    "Turn right and exit the room out the curtains. Once out turn left and go through the white door and down to the end of the hallway. At the end turn right and enter the bedroom. Stop at the door looking in. ",
    "Exit the bedroom and walk down the hall. Wait in the bedroom at the end of the hall on the right. ",
    "Turn around and walk between the end of the bed, on the right, and the small sitting area, on the left.  Walk out the doorway between the brown curtains and go out the door on the left.  Walk straight down the hallway past the small lit Christmas tree on the left. Keep walking straight to the end of the hall and then turn right into the bedroom.  Stop when you just enter the room with the bed in front of you. "
  ],
  "path": [
    "a85bf887101b49c3aee8b0da72cd4189",
    "e57db85f00a9481787bd9c3c98453f27",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "62994d72dab246fbb839f3699b9cacd6",
    "413903c083d64f2696539cf9f181894e"
  ],
  "path_id": 2824,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.07973179829918262,
  "num_matches": 2232
},{
  "distance": 14.67,
  "heading": 5.391,
  "instructions": [
    "Walk forward into, and down the middle of the work space. Walk forward until you reach a white pail on the floor next to a desk with a black chair and two tan chairs and stop. ",
    "Walk all the way down the room until you pass the ping-pong table, and stop at the table nearest the entrance on your left. ",
    "Walk forward and slightly left towards the exit doors and between the desks. Continue towards the exit doors past the \"IMPACT HUB Trieste\" sign on the left and proceed forward underneath the brick arched area. A few feet past the brick arched area walk straight towards the exit doors leading outside. Stop when you are standing between the steps and the desk with the white pail shaped trash can. "
  ],
  "path": [
    "12eaa3a3a39e4c9fa5106812cb7da084",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "334f156071b34579ae4772f623b03429",
    "6944cb3d349a424899b2ed5b4c972763",
    "114842471cc14a44b2f284c943281413",
    "a25a1fe848e044a99a0033878cd108bb",
    "2ed7a969a2d94eeb992c4f49d59cf0d7"
  ],
  "path_id": 1287,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.06708266877176246,
  "num_matches": 2476
},{
  "distance": 6.16,
  "heading": 4.579,
  "instructions": [
    "Walk past the bed and toward the desk and table. Stop just outside the bathroom. ",
    "Go past the curtains in front of the bed and past the minibar. Turn right and stop at the door to the bathroom. ",
    "Go straight passed the bed and turn left passed the desk. turn left again and stop in front of the door. "
  ],
  "path": [
    "1dd50bf3662244b68314b8400ebb66b6",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "7a920bf869fd41099e44a0829f818361",
    "71f79f342cde467ba037a196c4e04f6a",
    "6ca411a8612d4a569362c6231dcf1b68"
  ],
  "path_id": 6028,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.06687798989246373,
  "num_matches": 2083
},{
  "distance": 18.34,
  "heading": 1.814,
  "instructions": [
    "go forward to the end of the first bench. ",
    "Turn left and walk across the back of the building behind the rows of benches. Wait by the marble pool. ",
    "Walk towards the closest doorway around the column near you. Continue past the turnstyle gate and approach the sculpture that looks like a tiny building with a cross opening near the roof. Approach the white sign in the placard. "
  ],
  "path": [
    "6e5b136520954ba8a93403828a35e83b",
    "b3eb5df2a5e54a718d376a10d39ec57a",
    "16c8de72d3ff473aa1f710948a3d2903",
    "f3b74c273ad4459fa631ed46c6f8889a",
    "ec411c4cd1c44d21b37acfa24acc5b86",
    "be3761f1bb7e4a0880af96366017efa8"
  ],
  "path_id": 3111,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.049049340228060644,
  "num_matches": 3641
},{
  "distance": 10.83,
  "heading": 2.156,
  "instructions": [
    "Walk down staircase.  Walk towards blue chair.  Wait on carpet. ",
    "walk down stairs, curve right walk down more stairs, curve right and walk down the rest of the stairs, walk straight towards red chair, stop before you reach it. ",
    "Go down the stairs and enter the lounge. Wait in front of the red chair on the right. "
  ],
  "path": [
    "88f5ba9d06ac4413b1a3908af6544308",
    "be3d7ae0352d481191e4c9e351e71b08",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "124c7635126f4fefaf3c57742dbe1193",
    "59b190857cfe47f691bf0d866f1e5aeb"
  ],
  "path_id": 4717,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04629225825247774,
  "num_matches": 2869
},{
  "distance": 5.71,
  "heading": 0.857,
  "instructions": [
    "Exit the room. Turn right. Turn right again to go into the room next door. Wait at the entrance. ",
    "Exit the bedroom, turn right and then take a sharp right into the brown doorway and stop. ",
    "Exit bathroom, make a right, make a other right and enter bedroom and wait. "
  ],
  "path": [
    "8e649a3c097141978c621893e8b2ed9f",
    "22f85dac33524c6889f80fa7e76a6790",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 5730,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12380999967954946,
  "num_matches": 3632
},{
  "distance": 12.28,
  "heading": 2.615,
  "instructions": [
    "Turn around and walk past the table. Wait in front of the large double doors at the end of the table. ",
    "Turn around and go across the room to the large wooden entry way on the opposite side. ",
    "Turn around 160 degrees. Walk straight across the room past the dining table. When you get just past the end of the table, turn slight right, then a quick slight left and continue straight until you are standing in the center of the doorway. "
  ],
  "path": [
    "76869bdceadf4abf9d834fc7c9bbf2f5",
    "37ff2e51c319423fb5ea58a67b13f388",
    "74e7d3ed76fe40b8a0d2ea19aaf4196c",
    "630f0ee6e8db4d518e31d932d2c5ea4c",
    "8b22751d94034268b26b9960c1d28e4e"
  ],
  "path_id": 4485,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.11665085431647046,
  "num_matches": 5281
},{
  "distance": 8.6,
  "heading": 6.203,
  "instructions": [
    "Walk towards green lounge chairs and swimming pool.  Wait at bottom of steps. ",
    "Walk past the bed and toward the deck.  Stop in the middle of the floor mosaic at the bottom of the stairs. ",
    "From bathroom walk into bedroom and walk across bedroom down steps and stop at pool loungers. "
  ],
  "path": [
    "138252ad9fab4ae1a86997fc363e6ac7",
    "87e7b6f2006541a9abe57fba18294a0c",
    "8078fc4f547a4a9cb1a6bb036cc18dc9",
    "cb070d66db084a79b553310df69ed31d",
    "b8f49ffb1486488bbb72693578c17865",
    "094836afff5e4fbfbb6659a96ec665b8",
    "981311e64aec4d3f8e403f349363e065"
  ],
  "path_id": 4096,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.06745021581473694,
  "num_matches": 3596
},{
  "distance": 5.89,
  "heading": 0.228,
  "instructions": [
    "Walk under the chandelier and up the marble steps.  Stop in between the base of the two red staircases. ",
    "Walk straight ahead past the reg rug. Walk up the marble stairs. Stand between the two sets of red stairs. ",
    "Walk up to the entrance of the staircase in the middle. Go up the stairs 4 steps. Go to the middle of the entrance of the staircase and wait. "
  ],
  "path": [
    "f8a5d4f68a4f49dd83688e863efeddff",
    "ba5080db55e84e4f9a9c02a4549e7448",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 1449,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.09747624814435973,
  "num_matches": 3352
},{
  "distance": 7.66,
  "heading": 3.349,
  "instructions": [
    "Go up the stairs. Move straight ahead and go passed the red rope barricade. Stop directly in front of the table and wait. ",
    "Walk up the stairs into the room with the large chandelier. Walk up to the ropes near the chandelier. ",
    "Continue up the stairs and into the hallway at the top of the stairs going straight and go over the velvet rope into the sitting room and stop before you pass the table. "
  ],
  "path": [
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a",
    "293a1e64b85e4e84a3a44fe8ee9d9bd4"
  ],
  "path_id": 503,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.06064474450223545,
  "num_matches": 3642
},{
  "distance": 15.32,
  "heading": 1.791,
  "instructions": [
    "Turn left and walk toward the opposite wall. Enter the doorway on the far left of the wall. Wait there. ",
    "Walk in front of, and past the stairs. Turn into the last doorway on your right. Stop in the hall with a door on your right and left. ",
    "Facing the side of the open staircase, go through the opening on the opposite wall from you and almost all the way to the left.Stop when you reach the four way intersection halfway between the room you just departed and the room ahead. "
  ],
  "path": [
    "8d01d3df74ea481bb82fd00f4ae6bae7",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "f5bef118db5b41849ce63cbfcefed938",
    "0cb7f98845aa4939a1125d430acb7183",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656"
  ],
  "path_id": 3565,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07631625316510403,
  "num_matches": 3226
},{
  "distance": 5.14,
  "heading": 3.481,
  "instructions": [
    "Walk to the bathroom door and wait just outside the doorway. ",
    "Cross the bedroom and wait outside the bathroom door. ",
    "Walk through the room alongside the bed towards the doorway passing the side table and bench seats. Walk out of the door and into the hallway. "
  ],
  "path": [
    "d81df9c0b8fb4b3e8a2cd12c2007461e",
    "4ac8e1065b0b46db9e459d79a1078e04",
    "b8f49ffb1486488bbb72693578c17865",
    "cb070d66db084a79b553310df69ed31d",
    "8078fc4f547a4a9cb1a6bb036cc18dc9",
    "87e7b6f2006541a9abe57fba18294a0c"
  ],
  "path_id": 719,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.06215585129626136,
  "num_matches": 2844
},{
  "distance": 13.23,
  "heading": 1.787,
  "instructions": [
    "Walk out of the bathroom into the living room area. Walk past the blue and red arm chairs. Walk up to the staircase beside the Christmas tree. Walk up the stairs to the top of the staircase. ",
    "Leave the bathroom and turn right.  Walk past the blue chairs and up the stairs by the Christmas tree.  Stop at the very top of the stairs. ",
    "Exit the bathroom. Turn right and go straight past the light blue chairs and the Christmas three on the left. Go up the stairs and wait at the top. "
  ],
  "path": [
    "69cbdf9fd3b64552b57887b813845cfa",
    "b6169d6b759547769509b4d781a8bff6",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 5553,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.038342927869381885,
  "num_matches": 2267
},{
  "distance": 7.64,
  "heading": 1.146,
  "instructions": [
    "Go straight and go up the stairs. Stop just before getting to the top of the stairs. ",
    "Walk forward through the doorway. Head up the stairs to the left. Turn right at the landing and continue up the stairs but stop at the second step. ",
    "After you leave the bedroom make a slight left and go up the stairs. When you get to the second flight of stairs wait at the third step. "
  ],
  "path": [
    "5ca14589a7c4407b9333c3dc02d9c9a5",
    "9224c582bc934d6ab146f7e624b0bab7",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "abdb1b4d143e491f8a9350b2fd869122",
    "94446ee1941346fa9d9ed2e8251dd5c0",
    "778b27da719d47b494cce8c6896a9bdf",
    "53549a4cd8964df9a41acdf7a0257aff"
  ],
  "path_id": 6527,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08729538123823254,
  "num_matches": 3567
},{
  "distance": 10.26,
  "heading": 1.249,
  "instructions": [
    "Exit the bedroom from the left door. Turn right, and keep walking forward. Pass two picture frames on the right wall, and the American flag at the left corner. Stop next to the the big cushioned chair. ",
    "Turn and walk out the door to the left of the bed. Turn right and walk along the walkway. At the end of the walkway make a slight left and take two step into the study. Stop right there. ",
    "Turn left and then turn right. Follow the hall and stop just after the American flag. "
  ],
  "path": [
    "0730f29b10af4cbc93265ce3c73aff20",
    "ffcdf5557c684ebf81f6ab3dcef17325",
    "d5693cccdffa464d92381eff5fdb96a7",
    "1b6ad918388b4528bf0b511db7fd6279",
    "7deb7519052e480a933602dc9e37bd2d",
    "53e850a074ec4c9ebecb3c8f41361d57",
    "f67fc5e261794b2b8c4ef494604d2059"
  ],
  "path_id": 6118,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06765798337674116,
  "num_matches": 3211
},{
  "distance": 9.05,
  "heading": 4.152,
  "instructions": [
    "Locate the black chair. Travel to the right of the chair and down the hallway. Enter the door on the left. ",
    "Turn from the desk and walk down the hallway, with the fireplace on your right and the side chair on your left.  Continue walking down the hallway, with the railing on your right.  Go to the first door on your left, walk through the doorway, and stop once enter the bedroom. ",
    "Turn left and walk down the blue carpeted hallway. At the end turn left and stop once you enter the bedroom. "
  ],
  "path": [
    "9af627d79c5a44539e3e58a58ab6f534",
    "7deb7519052e480a933602dc9e37bd2d",
    "1b6ad918388b4528bf0b511db7fd6279",
    "d5693cccdffa464d92381eff5fdb96a7",
    "ffcdf5557c684ebf81f6ab3dcef17325"
  ],
  "path_id": 3920,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0725206992908586,
  "num_matches": 2464
},{
  "distance": 7.3,
  "heading": 4.629,
  "instructions": [
    "leave sitting room, jump the ropes and stop at top of stairs looking toward chandelier. ",
    "Walk out of the sitting area and go the stairs. Go down one stair to the second from the top and stop. ",
    "Go around the table and head towards stairs that lead down. Walk a little forward towards the chandelier and wait at the stairs before going down. "
  ],
  "path": [
    "aea65d3bc7c34d019bf5bc3b0b27fab4",
    "adcc15e35b9441139036aeefda56e0a4",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 297,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05440311393465112,
  "num_matches": 2689
},{
  "distance": 5.09,
  "heading": 3.349,
  "instructions": [
    "Go up the stairs and stop at the top, where the red path splits. ",
    "Go up the stairs. Wait near the chandelier. ",
    "Walk up and wait at the top of the stairs. "
  ],
  "path": [
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a"
  ],
  "path_id": 4185,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.06314630547001751,
  "num_matches": 3133
},{
  "distance": 8.36,
  "heading": 5.743,
  "instructions": [
    "Go up the stairs all the way to the top floor. At the top of the stairs take a right and stop in front of the first panel of the banister. ",
    "Walk up the stairs and onto the deck. ",
    "Walk up the stairs. Turn right at the top and wait near the glass guardrail. "
  ],
  "path": [
    "1349a908694c4494999f72c36e52e1bf",
    "c92b9bd8b885423b8d6d1a7a58d2ca2c",
    "5c1275543c164a4f9bc60b08d8cb5c43",
    "b72bbf5f815e43bca6bf4509fd7c9258",
    "30c97481412946f292272d28af5d00dd",
    "585c34af2340439e9fa507888421bb9b",
    "4224e105e67346bf9a22f8d74e137a4f"
  ],
  "path_id": 1994,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.13446902625636098,
  "num_matches": 3119
},{
  "distance": 13.48,
  "heading": 2.46,
  "instructions": [
    "Turn left and exit the bathroom. Once out walk forward past the stairs. Go across the living area, past the fireplace and then turn right into the hallway.  Enter the first door on the left with the handicap sign beside the door. ",
    "Exit the bahtroom and make a right out of the bedroom and into the main living space. Continue walking to the area infront of you until you can see the doorway on the right hand side of the two plaid chairs. Once in the doorway make a right down the carpeted hallway and into the second door on your left. Wait there. ",
    "Exit the bedroom through the door on the right. Continue forward past the stairs on the left and the fireplace on the right. Turn right at the curio cabinet and enter the first door on the left. Wait in the bedroom doorway. "
  ],
  "path": [
    "55e4975d424c416691d6035030cc09be",
    "9224c582bc934d6ab146f7e624b0bab7",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "0e8e2c9d09974dab977c1d3868286f12",
    "9766d89c21094c5b872be3a378d4cbad",
    "7f39d79ddfec4b6e9c98e51576d59ab1"
  ],
  "path_id": 5699,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05404982518915402,
  "num_matches": 2227
},{
  "distance": 14.01,
  "heading": 3.6,
  "instructions": [
    "Go straight until you get to the table and chairs then turn left and go down the stairs. Turn right and go down three steps then stop. ",
    "Step down and go forward and then turn left. Proceed to the stairs and go down to the first landing. Turn to the right and go down two more steps. Wait there. ",
    "Go down the stairs to the landing. Go down three stairs on your right, and stop. "
  ],
  "path": [
    "d312e6ef3a414dde893ceedbe6563b18",
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "e87f560e1b5a497487526e64db42f8c8"
  ],
  "path_id": 5951,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.037745868817437134,
  "num_matches": 2547
},{
  "distance": 6.18,
  "heading": 2.977,
  "instructions": [
    "exit bedroom to hallway, turn left and go straight down hall to open door, stop in doorway facing christmas tree. ",
    "Turn left and go down the hall. Go through the door at the end of the hall and stop in the doorway. ",
    "Exit the bedroom and move down the hallway, past the fire extinguisher and Christmas tree. Continue forward and stop in the doorway that is marked Master Suite. "
  ],
  "path": [
    "62994d72dab246fbb839f3699b9cacd6",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641"
  ],
  "path_id": 334,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.10650896837793442,
  "num_matches": 2506
},{
  "distance": 7.85,
  "heading": 2.614,
  "instructions": [
    "Turn around and exit the room. Walk all the way down the steps to the bottom and stop. ",
    "Turn around and go down the stairs. Wait at the bottom of the stairs next to the Christmas tree. ",
    "Turn around and go down the stairs. "
  ],
  "path": [
    "4531a8cd59c7423e8f938bcd905f7b62",
    "bec7a60657d6483996aa2f0d03b9d691",
    "80befc44c6d14348a3f9bda8ba719d70",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "41873d3929e64a9a938a5fac3b6bbd79"
  ],
  "path_id": 4045,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.045223007103643874,
  "num_matches": 2480
},{
  "distance": 11.08,
  "heading": 1.708,
  "instructions": [
    "Turn around and walk all the way down alongside the table you were beside to the other end. Stop in front of the 2 wooden chairs at the other end. ",
    "Face right and walk past the altar. Turn right and walk across the church until you reach the stone wall. Turn at a 45 degree angle, walk to the chairs, and stop. ",
    "Walk past the three chairs on the left and turn right. Walk past the altar and stop by the chairs on the right. "
  ],
  "path": [
    "986ea075ba794e549d8c0b7401487f9e",
    "6c6bf7ed2811477cac4123a4be1ac981",
    "084ee8230aac42918476f2b67585fe01",
    "a061bf8e69e74a92b02d4ad45e0d7ab0",
    "934734efa498455bbbabb9e0cc8e342d"
  ],
  "path_id": 4809,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.05939537246031386,
  "num_matches": 4299
},{
  "distance": 15.4,
  "heading": 3.006,
  "instructions": [
    "Walk out the door left of the second fire place, then ascend the stairs to the right and wait on the top step between the winding stair cases. ",
    "Walk forward throuhg the sitting room passing the fireplace with the sitting area on your left to exit the room. Out of the room take a right and go  up the marble stairs. Stop on the top of the marble stairs next tot he left pillar. ",
    "Go straight and turn right. You can see near pillars and upstairs. "
  ],
  "path": [
    "e5bf751e9d7a4cb19e3d68c3fb881c29",
    "597c742850c14dcebd17081484195bee",
    "19c60ba074144f09ba124adef82ef7fa",
    "b4e027328a1b492e85e269df23fef364",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "3f75b2d4af4d4afd85666d4c1302008c"
  ],
  "path_id": 1218,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04217867790712524,
  "num_matches": 2434
},{
  "distance": 14.65,
  "heading": 3.185,
  "instructions": [
    "Stepout of the bathroom and into the hall way and make a right and walk into the foyer and turn right and walk to the end of the stairs and make a left and walk to doorway between the statue of a person with a hat on and the vase and walk though the doorway and wait there. ",
    "Walk out the bathroom and turn right, walking straight towards the staircase. Walk right till you reach the beginning of the staircase, and walk directly straight towards the set of doors to the right of the two gray chairs. Stop when you walk direclty through the doors. ",
    "Walk out of the bathroom and make a right, walk to the stairs then make a right. Make a left at the stairs then walk into the room directly in front of you. Wait by the door. "
  ],
  "path": [
    "884e06fb5a9141e8917de14fe8fd8de4",
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "f5bef118db5b41849ce63cbfcefed938",
    "fadac209cfc04129998323d048a5c908"
  ],
  "path_id": 1822,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.05834959855889775,
  "num_matches": 2331
},{
  "distance": 7.47,
  "heading": 0.826,
  "instructions": [
    "Go down the stairs and towards the table. Turn left through the doorway. Walk towards the TV and stop at the couch. ",
    "Go down the stairs and turn left through the doorway behind the dining table. Stop between the coffee table and the pale blue loveseat. ",
    "Go down the stairs. Turn left just past the naked woman statue. Stop between the blue sofa and the table. "
  ],
  "path": [
    "1527831f765e40c1b5210e52248427f7",
    "51328414aea04771890766f436b40021",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "b03eb3aa3b6e4c5abb5e78830372ff89"
  ],
  "path_id": 6470,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0758185570089098,
  "num_matches": 2067
},{
  "distance": 16.25,
  "heading": 4.866,
  "instructions": [
    "Leave the salon by going under the red velvet rope and exit through the door on the left. Follow the red carpet and go through the double doors. Enter the next room and go stand by the short table under the chandelier. ",
    "Turn and walk out the double doors to left of the fireplace. Walk across the room and into the door straight ahead. Once you enter the room walk to the other side of the rope on the left  and stop in between the benches and the table at the blue vase. ",
    "Walk and turn left towards the door. Enter the door, and keep walking forward, and enter a door that has a huge round mirror on the right. Turn left towards the brown chairs, and stop there. "
  ],
  "path": [
    "3b36912b85834ca78616c6a7337d6303",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "7551be9b1e4a45fa959217431fc4c463",
    "f8a5d4f68a4f49dd83688e863efeddff",
    "154cbcc9b744473780da78d787e1ad34",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "259fd84d195d4d9bac4e14bdf953521d"
  ],
  "path_id": 4377,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04007040659440984,
  "num_matches": 2423
},{
  "distance": 12.08,
  "heading": 0.748,
  "instructions": [
    "There is a wall with three doorways. Go stand next to the shelf between the two doorways farthest from you. ",
    "Go past the table and chairs and stand close to the middle door. ",
    "Walk around the dining table and stop in front of the credenza furthest to the right. "
  ],
  "path": [
    "4187ed8e4a504b7d8caeafa3a0627031",
    "ea1d38c4b610463396ec72fdaf5d5ece",
    "74e7d3ed76fe40b8a0d2ea19aaf4196c",
    "babbef7305e34152950788aa9cb363cc",
    "faddc614417b4861b4cd05176a35b947"
  ],
  "path_id": 3454,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.1044726356757234,
  "num_matches": 5186
},{
  "distance": 9.26,
  "heading": 4.57,
  "instructions": [
    "Walk across the roof. Stop at the top of the stairs. ",
    "Walk along the balcony close to the glass railing and stop before you reach the stairs. ",
    "Walk across to the opposite side of the patio and stop before the stairway. "
  ],
  "path": [
    "ec480cf25f5d4f869ff93e455aa707e5",
    "4bfaa80c580e44199e4be62c205857b3",
    "7158079b64374ecab3e24a2b7e1b4e5f",
    "7cdc8d66cb0b408d8c82c16e6f08bf8f",
    "4224e105e67346bf9a22f8d74e137a4f"
  ],
  "path_id": 1426,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.1341974785432427,
  "num_matches": 2852
},{
  "distance": 13.2,
  "heading": 3.383,
  "instructions": [
    "Walk down staircase. Wait by the two gold and white pillars at bottom. ",
    "Walk down the stairs and when it splits into two staircases, turn right and go down the rest of the stairs.  Stop on the marble where the two staircases meet up at the end with two pillars on one side and the circle mosaic on the opposite side. ",
    "Turn around, and go down the staircase. Turn right down the right staircase. "
  ],
  "path": [
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 7015,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03539361982964578,
  "num_matches": 2005
},{
  "distance": 13.16,
  "heading": 1.812,
  "instructions": [
    "Pass the pews and turn right. Then turn left and go towards the desk. Turn left again and enter the large room. Stop in front of the lectern. ",
    "walk towards the banister and turn right.  Walk around the wooden chair and enter the next room, Then turn left and stop next to the chair. ",
    "Walk passed the throne, and turn left to reach the main hallway. Turn left into the large wooden entryway and stop. "
  ],
  "path": [
    "2094de1e2c934d9ca603a405739df547",
    "57675495582049a08d338804d36e72e6",
    "dad0e2b0427b40ec8e23f21760179e22",
    "b44972ac14a04dc1a18556e918b0c0c7",
    "16cbae81701541f6a55597d6dc746163",
    "d34877b97e1545188e177b2715e434c5"
  ],
  "path_id": 6184,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.0738742932516572,
  "num_matches": 5406
},{
  "distance": 9.85,
  "heading": 1.952,
  "instructions": [
    "Exit the bathroom, then exit the bedroom through the door on your left.  Turn to the left and walk down the hallway.  Enter the bedroom on your left then stop in front of the toilet on your right. ",
    "Exit the bathroom toward the room then use the door on the left to exit the bedroom. Turn left and head down the hall. Turn left on the first door and then turn right into the bathroom and wait by the toilet. ",
    "Leave the bathroom, and bedroom. Take a left in the hallway and enter the first bedroom on the left. Enter the bathroom. Stop in front of the toilet. "
  ],
  "path": [
    "55478113a5aa45afa32b49188bf6df34",
    "6cd88fc6ffae479694b5d2442a6998d4",
    "172c2604a9054ee784ac24f7af45250a",
    "e83d56b54fc3442aac2906f5241043d6",
    "e968c229f17d4600a704d6197473c5a4",
    "aaaee36fbfc94d26be1a858fceaa91dd"
  ],
  "path_id": 3410,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0837660379750169,
  "num_matches": 3420
},{
  "distance": 12.5,
  "heading": 2.353,
  "instructions": [
    "Go into the dining area. Walk to the other side of the room, turn right,  and go to the door on the left side of the room. Stop in the doorway. ",
    "Walk across the dining room and wait outside on the patio. ",
    "Walk into the dining room and take a right. Walk around the tables and go to the door at the end of the room on the right. Stop once you exit the room and are on the patio. "
  ],
  "path": [
    "54f83ce9bf4543ff8219bd1c450ada78",
    "105998261dc9418da248f0190c8b1568",
    "f0d137bab5454f96857166a48536cb59",
    "6c1a4c906ad84fa4b0fd60e1223fb836",
    "564602b369f64e398b859ec38dee1dc2",
    "1723396e89154f649171f0def3b8cccc",
    "218bbf19f35641d2b7928da523fe44e2"
  ],
  "path_id": 1447,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08655297759655392,
  "num_matches": 6493
},{
  "distance": 8.17,
  "heading": 6.011,
  "instructions": [
    "Walk straight ahead and wait next to the small glass table with the flower arrangement on it. ",
    "Walk forward with the reception desk on your left. Stop before you reach the round table on the round tile decoration. ",
    "Facing the room marked \"management\" turn left and go down the hallway, and stop near the circle in the middle of the room. "
  ],
  "path": [
    "cde4845dbdcd439b988ffa3ab38262d1",
    "462cd36ba0ff43b7af69994cc7e2384f",
    "854ce53825a347bba52684d20cca190b",
    "3875b9ad36924b869985fed0412bc926",
    "37f62db110c94798b2eec3c180d2fa39",
    "21b70fb62de1453295b57dcba54c8310",
    "97199ffe16bc45d0acb64341501e467e"
  ],
  "path_id": 3956,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.11481763977648028,
  "num_matches": 2535
},{
  "distance": 12.06,
  "heading": 3.2,
  "instructions": [
    "Go down the brick walkway towards the brick stairs.  Go into the large room on the left, before you get to the stairs.Wait. ",
    "Walk passed the open double doors. Walk along the patio passing the woven lounge chairs. Walk into the open double doors on the other side of the lounge chairs and into the home. ",
    "Walk straight along the path past the table and chairs and turn left and enter on the first open doors you see. "
  ],
  "path": [
    "e3e9e67979e94b6e9f8cbb441dadc8da",
    "979afc5dbfbb44b3ba60cb5cafedda0d",
    "88f27f2d89d84d689bbe1ba584e211c5",
    "e74cca5444c34dbf9b071e6ef0a538ce",
    "65f77641cf3b4650bf492763e6ec5790",
    "1b8c3792715f4483aab0d36698658ef6",
    "2fe8aba87e074b98affe61cbdb5513ce"
  ],
  "path_id": 599,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.029753744148669232,
  "num_matches": 2115
},{
  "distance": 7.95,
  "heading": 4.985,
  "instructions": [
    "Exit the room. Turn right then continue down the hallway. Walk straight until you get to the front room. Wait near the two Christmas trees. ",
    "Exit room, and make a right to go down corridor.  Pass the Christmas tree, and enter the room straight ahead.  Wait by mirror. ",
    "Exit, and turn right. Walk all the way forward towards the very end room that is in front of you. Enter inside the room, and stop in front of the two small Christmas tree. "
  ],
  "path": [
    "69dc547801584e1a9aa129ff36289f52",
    "6249652893364b62b1c30df6c6516a71",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792"
  ],
  "path_id": 4807,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09451951134194927,
  "num_matches": 3090
},{
  "distance": 13.01,
  "heading": 0.485,
  "instructions": [
    "Keeping the swimming pool to your right, move forward until you just pass the end of the pool. Walk around the planter on your left, then go forward and up the one step. Move straight ahead until you are next to the third of the three planters. Keep the planters on your right, Stop next to the third planter and await further orders. ",
    "Turn around and walk past the pool and stand next to the block wall near the patio doors. ",
    "Walk towards the end of the pool with the steps to get in the pool. Walk straight passed the steps of the pool to the double doors to go indoors. Stop near the door and the three small plants on the ground. "
  ],
  "path": [
    "fd0949b7763b44f4ab5a8de9e2ac1fdb",
    "72db3b5a55bd4bf99fef4c0774263fa1",
    "d347f148995543ce8ae28d7c50ba5250",
    "d7fd6e3ab372450b8f38600aea06b680",
    "4838fa0d949e4cd3905f5e1ba665c59b",
    "626241dbd7334a45868a1092a3e195af",
    "f51ad0a5eae14774abac510880e1f364"
  ],
  "path_id": 5861,
  "scan": "82sE5b5pLXE",
  "source": "R2R",
  "similarity": 0.07693183017438966,
  "num_matches": 2114
},{
  "distance": 13.87,
  "heading": 4.588,
  "instructions": [
    "Walk towards the staircase and at the bottom, turn right and walk to the front door.  Go through the door and step outside. ",
    "Go into the room with the large open staircase ahead of you and to the left. Once inside that room, turn right and head to the center doors on the wall opposite the staircase. Go through those exit doors and stop halfway between the doors and the four pillars ahead of you. ",
    "Walk forward and make a right towards the chairs. Stay at the center of the huge carpet, and walk forward towards the open door and exit the door. Stand on the tiles outside the door, and stop there. "
  ],
  "path": [
    "ffd41f034ca44fe280a59b6a192be618",
    "6d88b250b28f4f28afbcf356f6a33909",
    "f59c4b4ff65e4a539bbba69e67de001e",
    "d35b945333f5413a9f5586b794cd2680",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 3656,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0922640997259762,
  "num_matches": 4748
},{
  "distance": 16.7,
  "heading": 3.297,
  "instructions": [
    "Turn around, move through the door and into the hallway. Turn left and move forward to through the doorway. Next turn right, walk to the end of the runner and turn left again. Go forward past the stairway, take a left and a quick right into the next door. Wait in that doorway. ",
    "Walk through the doorway and turn left. Walk toward the stairs and turn right. Walk past the stairs and turn left. Walk into the doorway to the left of the vase and stop. ",
    "Turn around and take a left at the bathroom. Turn right. Turn left when you get to the stairs and wait in the doorway to the room with big open space. "
  ],
  "path": [
    "ba3207f81c55467fa7e6760f6232fb07",
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 6363,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.05628788161677236,
  "num_matches": 2290
},{
  "distance": 6.76,
  "heading": 2.062,
  "instructions": [
    "Turn around to walk down the hallway and enter the first room on the left. Wait near the counter. ",
    "Go straight down the hallway. Turn left on the first door. Wait at the entrance. ",
    "walk away from door to outside, down the hallway, turn left and enter the first doorway and stop. "
  ],
  "path": [
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "cc7f149e59eb47fd8bde336f2bf3391d",
    "9e94e381ffbf44eabc4b3fb0f8bff78a"
  ],
  "path_id": 4077,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12733482008301833,
  "num_matches": 3496
},{
  "distance": 17.39,
  "heading": 1.243,
  "instructions": [
    "Walk forward toward the blue furniture and take a left. In the main room go out of the main door on the right. Stop once you are outside. ",
    "Walk into the the room with the blue furniture. Walk left out of the door and into the room across the hall. Go right and stand just outside the double doors. ",
    "Enter the room with the blue curtains, blue carpet and blue upholstered furniture. Then exit via the double doors to the left. Continue through the passage way until you see a large open staircase towards your left, then head right towards the middle set of doors leading outside. Go through those doors and stop. "
  ],
  "path": [
    "8b22751d94034268b26b9960c1d28e4e",
    "c645fc0e7e2a488fbed3580e98bd041e",
    "cfd9511c06b34cd1b89ba36919a4e6b6",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1"
  ],
  "path_id": 2557,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07294246483586178,
  "num_matches": 3773
},{
  "distance": 15.82,
  "heading": 4.558,
  "instructions": [
    "Turn around and go on to the deck. Pass the couches and go towards the living room. Stop near the coffee table and the couch. ",
    "Walk outside and turn right. Walk past the reclining chairs and into the building. Stop next to the couch. ",
    "Walk out the door that leads to outside and towards the pool. Then walk along the pool, and walk in the room with the gray shag rug. Stop when you are on top of it. "
  ],
  "path": [
    "69da3742bce54199a1f2a49ecabf8618",
    "6536cc05bf45478aa2aceaa3bc575b61",
    "4848ed4db295441c8722127d3df1c8c1",
    "c75f71faa8b74a8eb875731b3dbe6183",
    "be698bf5eb97439c98ce83c945aba879",
    "7dca42b9f8a04177b4766e6b90a76aef",
    "6b5e5f6e0e77495eb9333b0a741116f9"
  ],
  "path_id": 6887,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.10504212762747533,
  "num_matches": 2098
},{
  "distance": 9.26,
  "heading": 0.42,
  "instructions": [
    "walk towards the door with the exit sign above it, turn and walk through the doorway on the left, enter the bedroom, walk around the foot of the bed, towards the bathtub, turn left and stop in front of the flower barrier near the bathroom. ",
    "Turn left into bedroom. Walk around bed to entrance to toilet and wait. ",
    "Turn around. Walk through the door to your left. Walk around the bed and stop facing into the bath room where you can see the mirror, sink and toilet as well as still see the tub in the room. "
  ],
  "path": [
    "1b6ad918388b4528bf0b511db7fd6279",
    "d5693cccdffa464d92381eff5fdb96a7",
    "ffcdf5557c684ebf81f6ab3dcef17325",
    "4db175db9ecf4f07b8c8de9ab885611a",
    "dad7d0531dd2422bac0484433e926a45",
    "cf778c1cb15b4dd8a7ac0001ac7e6b94"
  ],
  "path_id": 2216,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06956038895232829,
  "num_matches": 2663
},{
  "distance": 6.12,
  "heading": 0.031,
  "instructions": [
    "Turn toward inside of house. Talk through foyer. At stairs, turn left. Go up two stairs. Stop. ",
    "Go straight into the house using the double doors. Walk toward the stairs and go up the stairs on the left. Go up three steps then stop. ",
    "Walk through the circular room. Turn left and wait on the second step of the staircase. "
  ],
  "path": [
    "a58cfc143a484947b0a2c9395e7f11de",
    "067ad57950864b6482eee91a5bd6f5f5",
    "aabe1ec42c7f426a85b709e03c4711e9",
    "0e59dc94728348e7a3e5e3746f2742ea",
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "3c9615b3193a4e71ae932ea45fef8dde"
  ],
  "path_id": 4530,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.07355041501012297,
  "num_matches": 2761
},{
  "distance": 12.79,
  "heading": 3.349,
  "instructions": [
    "walk up the stairs, turn right at rope barrier, turn left after rope barrier,  turn right and walk through doorway, stop next to chair on left. ",
    "Go up the stairs. Turn right when you see a chandelier, then go through the door opposite chairs and a couch. ",
    "Go up the stairs and through the second entry way on the right. Stop by the chair on the left. "
  ],
  "path": [
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "8113cb01c8d944a1af5f2dfc7f008b0c"
  ],
  "path_id": 4671,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04979182731023413,
  "num_matches": 3480
},{
  "distance": 10.85,
  "heading": 4.728,
  "instructions": [
    "Exit the barbecue area and enter through the door on left. Walk across the living area and wait in the hallway. ",
    "Follow the wall of the house, keeping the house on your left side.  Enter the house by the first doorway you come to.  These will be double glass doors.  After you enter the house, walk through the living room.  Walk between the couch and the television mounted on the wall, with the television on your left.  Stop when you get past the far edge of the couch, by the column. ",
    "Walk towards the outside patio set, walk through the first door on the left, walk through the living room past the furniture, stop when you reach the hallway. "
  ],
  "path": [
    "b6bfed9c855f4d67a0ece0a83fc4ef67",
    "33aaa553587c41fbb213c8f321eab8b2",
    "de39d04000ec4298a1d37e84eec6ea8d",
    "15dee203cd804c2f998b8dbbc55d6f98",
    "cd2f3a1a606346c1980d4b27004f05cf",
    "410ec890d2514ed39248e9204f785ab8",
    "7022a22f8b694102a795919fce934e03"
  ],
  "path_id": 1761,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.043517178910930474,
  "num_matches": 2410
},{
  "distance": 8.75,
  "heading": 3.146,
  "instructions": [
    "Walk to the right, around the fireplace, through the doorway and turn right. Wait in the hallway by the pocket door. ",
    "Go to the fireplace. Go to the bottom of the stairs. Go into the room nearest the television. ",
    "Walk forward to the fireplace. Turn right and walk to the bottom of the stairs. Turn left and enter the next room. Turn right into the doorway. Stop in front of the bathroom. "
  ],
  "path": [
    "d807887a425a41249a31c69a41adb313",
    "28170cad00aa4938a612db2e82628000",
    "21da82bc068c4d19a1c9168e86c417c2",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6378,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0925199569937561,
  "num_matches": 4544
},{
  "distance": 16.78,
  "heading": 1.791,
  "instructions": [
    "walk and take right side. Then up stairs and reach. ",
    "Walk into the hall and take a left, then go up the stairs. Stop on the first stair landing in front of the window. ",
    "Turn around and walk forward into the room towards the stairs, then turn left and then right and walk towards the base of the stairs. Walk up the stairs until you reach the second landing where the stairs branch off to either side of you. Stop as soon as you reach this landing. "
  ],
  "path": [
    "8d01d3df74ea481bb82fd00f4ae6bae7",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "ed46f2e3d89d4f2ea2ec7b14affef69d",
    "10b11d5c0cb7449baca31324b6a371bb",
    "ea8c31ffae82450f87d19ca1ac4d01b7",
    "bb2ed22637c342ba8acb80a377f234f9"
  ],
  "path_id": 908,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.04011826423788378,
  "num_matches": 2118
},{
  "distance": 14.31,
  "heading": 5.117,
  "instructions": [
    "Walk through the door furthest away from you and take a left. Wait at the top of the white marble stairs. ",
    "Walk across sitting room to hallway that is to the right of the fireplace. Turn left towards stairs, stop at top step between two pillars. ",
    "Move around the table and to the right. Then go over or under rope and move forward. Continue down the hall straight, then through the doors. Turn to your left and continue forward and up the stairs. "
  ],
  "path": [
    "5ee1a604d54f459cb64f33acdd18910e",
    "8be5effc17454d3f872ea16b4948015b",
    "db3f3ca133714b02877c14da914630ab",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "154cbcc9b744473780da78d787e1ad34",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "3f75b2d4af4d4afd85666d4c1302008c"
  ],
  "path_id": 2759,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04712656105671875,
  "num_matches": 2816
},{
  "distance": 10.7,
  "heading": 0.164,
  "instructions": [
    "Walk into the hallway and to the right. Wait in the doorway next to the bathroom, at the end of the hall. ",
    "Exit the bedroom and turn right.  Walk down the hallway toward a bathroom and another bedroom.  Stop inside the doorway to the right, the one with a bed in it. ",
    "You need to leave the bedroom and make a right turn in the hallway. Next, walk to the end of the hall to the bedroom that is to the right of the room with the large sink. When you get to the doorway of the bedroom stop. "
  ],
  "path": [
    "ca38c3e0cbcf4a4992d79889e5793cb7",
    "2754c89e3b2645d598ace5d7878f5d13",
    "980150b99a2946a0894c33df8fb616d2",
    "e5c5d8fa1ad94d97bcdb74e69e938ea0",
    "d2a0481db3044dfbac40244bdbf9f9e1",
    "91b54e8895bf4d63922b5ef7ea839d4c"
  ],
  "path_id": 3543,
  "scan": "1LXtFkjw3qL",
  "source": "R2R",
  "similarity": 0.10848734990463337,
  "num_matches": 3742
},{
  "distance": 5.95,
  "heading": 4.579,
  "instructions": [
    "Walk past the bed, turn right, enter the bathroom, wait by the toilet. ",
    "Go around the bed and enter the bathroom, turn left and wait by the door. ",
    "Pass the foot of the bed and go into the bathroom  Head into the room with the toilet and face the sink. "
  ],
  "path": [
    "1dd50bf3662244b68314b8400ebb66b6",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "efe359ee05ea46c587196354c2d1cc96",
    "8b41e8798d78402f9f36b242972d729b",
    "45ee2d428b7c42a98afe21f68a8fa298",
    "5c3fa398480741ff9d996b26596e647c"
  ],
  "path_id": 967,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.07862120482729017,
  "num_matches": 3186
},{
  "distance": 12.69,
  "heading": 3.224,
  "instructions": [
    "Walk through the living room area past the natural wooden table top. Walk past the armchair and around the fireplace to the right through the open double doors with a plaque above it. Walk around the stairwell and into the hallway. Walk past the rotary phone hanging on the wall. Walk into the open door at the end near the elevator and into a bathroom. ",
    "Walk straight and then go into the room on the right of the fireplace. turn right and go into the hallway. turn left on the door right by the elevator then wait at the bathroom entrance. ",
    "Walk past the fireplace to the right and enter the bathroom hallway.  Stand near the entrance of the men's room. "
  ],
  "path": [
    "46e170296a7f4b88b50ebeb7e2a27894",
    "d807887a425a41249a31c69a41adb313",
    "28170cad00aa4938a612db2e82628000",
    "21da82bc068c4d19a1c9168e86c417c2",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "acc96ef459564d42b60eac9dad07708a",
    "717b0a0713c44e0ea5b5a557c96076a1"
  ],
  "path_id": 4050,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10625124733294482,
  "num_matches": 6547
},{
  "distance": 13.59,
  "heading": 5.242,
  "instructions": [
    "Go straight past the pool. Turn left and go into the house using the large glass sliding doors. Pass the table and wait near the door to exit the room. ",
    "Walk straight down the patio past the two chairs and then two beds.  Turn into the room on the left after passing the two beds.  Walk through the room and stand in the doorway on the opposite wall from where you entered on the left, just past the animal skin rug.  Stop in this doorway. ",
    "Start at the pool near two long sofa chairs, go past them and then turn left through the glass door opening. "
  ],
  "path": [
    "7dca42b9f8a04177b4766e6b90a76aef",
    "be698bf5eb97439c98ce83c945aba879",
    "c75f71faa8b74a8eb875731b3dbe6183",
    "4848ed4db295441c8722127d3df1c8c1",
    "6536cc05bf45478aa2aceaa3bc575b61",
    "69da3742bce54199a1f2a49ecabf8618",
    "561539769a374a5fa17f167e4394a4c1"
  ],
  "path_id": 5936,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.11194224494613077,
  "num_matches": 2079
},{
  "distance": 8.39,
  "heading": 1.59,
  "instructions": [
    "Turn to your left and walk around the table to your left. Pass by the next table as well and turn left between that table and the last table and stop. ",
    "Walk between the tables, turn left and continue through the chairs. Stop near the last row. ",
    "Walk forward past dinning tables, wait by last table on the left by the door. "
  ],
  "path": [
    "5e54afb639e8489282ebf3ac01821cc7",
    "434eafc01e8e4a32beeeddba478776bf",
    "dcb7e1f526b646819aa4a485171958a7",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "4122ef1b23ca44b78c7cb26fa1c6a645"
  ],
  "path_id": 5295,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.11403795044099843,
  "num_matches": 4263
},{
  "distance": 7.48,
  "heading": 2.263,
  "instructions": [
    "Walk up the stairs and stop. ",
    "Walk upstairs and wait at the top. ",
    "Climb to the top of the stairs following the blue dots. ",
    "Go up the stairs.  Wait at the top of the stairs  You'll stop near the roped off area. "
  ],
  "path": [
    "fd263d778b534f798d0e1ae48886e5f3",
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a"
  ],
  "path_id": 135,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.057432951876735666,
  "num_matches": 3424
},{
  "distance": 11.76,
  "heading": 3.062,
  "instructions": [
    "Leave the bathroom and walk through the bedroom to exit the bedroom by the door on your left.  Make a left out of the bedroom and walk down the hall.  When you get to the end of the hall by the elevator, make a right and stop at the foot of the stairs ascending from there. ",
    "Walk forward to exit the bathroom and enter the bedroom. Walk diagonally to the left until you come to the doorway. Walk through the doorway and turn left. Walk forward down the hall until you just pass the open doorway on the left. Walk forward to the base of the stairs and stop and wait. ",
    "Leave the bathroom and make a left to leave the bedroom then make another left in the hall. Walk to the end of the hall then take a slight right and wait in front of the stairs. "
  ],
  "path": [
    "aaaee36fbfc94d26be1a858fceaa91dd",
    "e968c229f17d4600a704d6197473c5a4",
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "c69af2f0e57b485886e0f4667b2209a5"
  ],
  "path_id": 1162,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08603729099089157,
  "num_matches": 5070
},{
  "distance": 12.12,
  "heading": 3.397,
  "instructions": [
    "With the ping pong table behind you, walk down the length of the room.  When you see two staircases, take the one on the right and stop on the first stop. ",
    "Walk straight past everything and go down one step down the stairs then stop. ",
    "Walk straight ahead toward the stairs. Wait on the second step. "
  ],
  "path": [
    "6944cb3d349a424899b2ed5b4c972763",
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562"
  ],
  "path_id": 7277,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07944399652736513,
  "num_matches": 2460
}]
