[{
  "distance": 11.66,
  "heading": 3.751,
  "instructions": [
    "Walk down one flight of stairs and stop on the landing. ",
    "Walk between the columns and make a sharp turn right. Walk down the steps and stop on the landing. ",
    "walk forward then turn right at the stairs then go down the stairs. "
  ],
  "path": [
    "af3af33b0120469c9a00daa0d0b36799",
    "5be145994f974347850a48cecd04cdcd",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 6250,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038374241318200754,
  "num_matches": 2219,
  "direction_num": 6
},{
  "distance": 13.34,
  "heading": 1.829,
  "instructions": [
    "Walk beside the outside doors and behind the chairs across the room. Turn right and walk up the stairs. Stop on the seventh step. ",
    "Turn left and walk through the living room. Exit the room, turn right and walk up the stairs. stop in th e middle of the stairs. ",
    "With the windows on your left, walk through the large room past the sitting areas.  Go through the door left of the tapestry and enter a wood paneled room with a circle table in the middle.  Go up the stairs and stop on the sixth step from the bottom. "
  ],
  "path": [
    "bd67e1a2dec64aab9e028df026ce4caf",
    "d2cf7bc1308c4d1b86973b4ad1336404",
    "6019439d967f4e5ab8332170d0d17a57",
    "913aefa5733c425eb79de9f5e225cd0e",
    "f745a3bf638a40dd85e29ce98d8c2aba",
    "81a50ecde0ab42cd81e0cf23a2529675",
    "7d9e8e6508884b1c8c9fedf59d70729e"
  ],
  "path_id": 6310,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.05702383628419374,
  "num_matches": 2553,
  "direction_num": 6
},{
  "distance": 14.22,
  "heading": 4.062,
  "instructions": [
    "Turn around until you're facing the middle of three arches with a table surrounded by six chairs behind you. Walk through the middle arch until you see a long table with eight chairs on each side and a fireplace further down in the next room to your right. There will be a door leading to the outside on your left. Turn ninety degrees to the right and walk towards the fireplace with the long table towards your left, stopping just before reaching the carpet in front of the fireplace. ",
    "Facing the three archways go forward and immediately right, go through the rectangular archway and go into the first room on your left, go along the table, and stop at the chairs. ",
    "Leave the office heading to the dining room. Walk through the room and into the kitchen. Stop in the doorway to the sitting room. "
  ],
  "path": [
    "3611ca6eb11f4a32a7cd3c073862860d",
    "b2d31a869b644c738697a237d4e724b5",
    "3d6c224493aa4b8fa5fd16e7ae8e2d66",
    "82ee7783a95b4beeb1b8c518107c9ae2",
    "2d21aec2e48b4797ad0367e96fd316f4",
    "397cae1de3b74644804196b838fd3c8a",
    "5b4f88b00af3413eb8a3706a62a761e1"
  ],
  "path_id": 2539,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.06181540970071312,
  "num_matches": 1520,
  "direction_num": 10
},{
  "distance": 13.23,
  "heading": 1.874,
  "instructions": [
    "Walk down the stairs and walk towards the red sofa. Turn left and enter the bathroom. ",
    "Walk down the stairs all the way and past the Christmas tree. Make a right turn and walk past the blue chair into the room with the white sink. ",
    "Walk down the stairs, walk into the room with the fireplace, walk around the chairs and turn left into the bathroom, stop in front of the sink. "
  ],
  "path": [
    "be3d7ae0352d481191e4c9e351e71b08",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "124c7635126f4fefaf3c57742dbe1193",
    "b6169d6b759547769509b4d781a8bff6",
    "69cbdf9fd3b64552b57887b813845cfa"
  ],
  "path_id": 211,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04086981985506459,
  "num_matches": 2446,
  "direction_num": 9
},{
  "distance": 6.75,
  "heading": 3.759,
  "instructions": [
    "Go past the fireplace, make a left and go through the doors. Make a right turn under the deer head and go straight to the open door. Stand in the doorway to women's bathroom. ",
    "Walk past the fireplace then turn left. Turn right and then go straight into the room ahead. WAit there. ",
    "Go to the bottom of the staircase. Go into the dining hall. Enter the room with the buck head above the doorway. Go straight into the women's restroom. "
  ],
  "path": [
    "8d27cd9bb3884465a9c48ad38fde69fd",
    "592a33a207ee425ebaa1c86f9a31e1a3",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "761e41fbabfd4f1c80c3ab77df6732ce",
    "635e26ebc0594a23b1159bb0c6d15cc8"
  ],
  "path_id": 5987,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.14452717666641193,
  "num_matches": 6646,
  "direction_num": 9
},{
  "distance": 11.64,
  "heading": 2.839,
  "instructions": [
    "Go straight past the brown chairs, pass the grand piano, pass the first and second column and wait there. ",
    "Go through the room along the pillars and stop halfway between the last and second to last pillar. ",
    "Wait in between the two white pillars next to the brown couch. "
  ],
  "path": [
    "cc3a8c91626f4824ab02269b167c0ea1",
    "81999e63ec744b079b238f6bb3662df4",
    "8f421a6da84d4a4a9e0c79b8b3d19e69",
    "de17e14896824460b354f6756e8391ad",
    "53e6ea6aa17b4876b3fc7835279e99c2",
    "6afb5c8288bb493f909657f76222a98e",
    "5c0f242b1f4c45868a768d5d5ffeab97"
  ],
  "path_id": 3559,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.07209917449569238,
  "num_matches": 1628,
  "direction_num": 2
},{
  "distance": 10.61,
  "heading": 2.185,
  "instructions": [
    "Walk down the hallway towards the stairs. Stop in front of the windows on the right past the door. ",
    "Walk down the walkway and wait at the top of the steps. ",
    "go forward down walkway, continue walking straight. keep walking straight past open door.  Move to next door and stop. "
  ],
  "path": [
    "c6708fedf6b241148554f8d8592036b6",
    "5ee7559f2e4e46cc9a20562c3afb7ce6",
    "7c0b96985c344cbeac0f7c69e11dc60e",
    "062df9954974450a9eb914da2727062d",
    "1aba6e328b4d4211900d8296b88f6127"
  ],
  "path_id": 319,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.05214474908055633,
  "num_matches": 1710,
  "direction_num": 10
},{
  "distance": 16.6,
  "heading": 3.288,
  "instructions": [
    "Walk through the game room past the table tennis game. Walk into the next room through the arches and past the desks towards the couches in the corner of the room. ",
    "Walk toward and past the ping pong table. Continue in that direction until you reach the sofa with two green pillows. Stop in front of the table that is in front of that sofa. ",
    "With the stone pillar on your right and the table on your left walk into the main room going forward and passing the tennis table on your left go between the work tables and go forward to the table and stop in front of the table in front of the love seat. "
  ],
  "path": [
    "85541431cbaf4053af5fde8bcebc4d92",
    "7856a3d706f7400bbdbd8410d40f832b",
    "adbe4f1c6ccd4dfbb3752685700e412a",
    "5a158ce64e934236af9dccbecec6e16b",
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "12eaa3a3a39e4c9fa5106812cb7da084"
  ],
  "path_id": 97,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.050236104138237016,
  "num_matches": 1869,
  "direction_num": 9
},{
  "distance": 8.29,
  "heading": 0.892,
  "instructions": [
    "Turn around and walk along the long table to the other end. Keep walking straight and stop at the first wood chair with a white cushion in the sitting room. ",
    "Walk across dining room to sitting area with table. stop at white chair. ",
    "Walk to the left side of the dining room table and stop just before the chair in the next room. "
  ],
  "path": [
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "4fca698177d14f40a2008174193dcfb5",
    "b618cd7f70bd430a9af0e0770738cb41",
    "cbeb8dcdebb34b1daf46a8aa1983139e"
  ],
  "path_id": 4615,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06437196912567467,
  "num_matches": 1655,
  "direction_num": 2
},{
  "distance": 14.73,
  "heading": 5.103,
  "instructions": [
    "Go toward and then behind the desks with the glass wall on the right.  Go past the book case and toward the long table.  Stop in between the two tables and near the post. ",
    "When you are at the top of the stairs go straight back to the table with the computer and black office chair. Once you are at the table walk around the back of the chair, then walk straight back until you get to the wooden table that is in front of a projection screen. Now walk to the wooden chair in front of the screen and wait. ",
    "Walk from the stairs to the work space directly ahead. Pass the conference room and the bookcase on the right. Wait by the wooden tables. "
  ],
  "path": [
    "6c86f8dd156142a1972e3c17310b6376",
    "e48486bb391449b2becb28faf44e515a",
    "cdf8c27ef42e466d90f49aca714a048b",
    "5377d17e2a4d4a28abf16709e02e97a9",
    "96c723cbe63d489295a0cc3a99438f08",
    "6855b783e2f34c7981b90ddb5de81bd7",
    "2b8074f44cbb43e0949091be7cc1a7b1"
  ],
  "path_id": 2102,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.04740326081347522,
  "num_matches": 1516,
  "direction_num": 5
},{
  "distance": 10.03,
  "heading": 1.567,
  "instructions": [
    "Walk down the stairs and wait on the red rug. ",
    "Turn left to steps leading down. Go down steps and continue following them down as they spiral left. Stop on red rug. ",
    "Go down all the stairs and stop on the mat at the bottom on the tile floor. "
  ],
  "path": [
    "8a6b00dd0b0d4759bbfae067cc206ac3",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "cefe85eb9d1e4592a020547df6107246",
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "d0b75539f2484b0bb8e1612e549c06d3",
    "baf252d021004390831cffc0c4987afd"
  ],
  "path_id": 2655,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.08286302302714334,
  "num_matches": 1767,
  "direction_num": 7
},{
  "distance": 5.59,
  "heading": 4.763,
  "instructions": [
    "turn around and walk straight. Stop at the hallway. ",
    "Walk forward in the kitchen past the sink on your right Keep walking straight past the stove and out of the kitchen. Once out of the kitchen in the hallway stop just beyond the doorway. ",
    "TURN RIGHT UNTIL THE STOVE IS ON THE LEFT AND A SINK IS ON THE RIGHT, WALK THOUGH THE KITCHEN TO GET TO A DOORWAY NEXT TO SOME CABINETS, WALK FORWARD UNTIL YOU ARE IN THE MIDDLE OF THE HALLWAY SURROUNDED BY DOORS. "
  ],
  "path": [
    "814d9aba371640e5a70bcb7833bfe08f",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "e0d2a4e22abe44d7810d7e448fff6704",
    "f553a3287fb2438b979f09b09448c7c0",
    "74a12d0675b54d6193ba63104a6a8e2e"
  ],
  "path_id": 684,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.06514220393964588,
  "num_matches": 1725,
  "direction_num": 6
},{
  "distance": 9.63,
  "heading": 2.708,
  "instructions": [
    "Walk through the entryway and left up the stairs that curve left. Stop at the top of the stairs. ",
    "Stand with the door behind you and go up the staircase on your left.  Stop where the other staircase meets up, just before the single staircase going up. ",
    "Walk forward towards the staircases and go up the staircase on the left. Once you have finished climbing up the first set of stairs there will be a short landing area. Wait there do not continue upstairs or go back downstairs on the set of stairs in front of you. "
  ],
  "path": [
    "0e59dc94728348e7a3e5e3746f2742ea",
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "e49192047ff241b5933dfef7b832b8fe",
    "f490656d21134ff79be372d985ad965c",
    "fd263d778b534f798d0e1ae48886e5f3"
  ],
  "path_id": 5724,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.047855660686549194,
  "num_matches": 2231,
  "direction_num": 7
},{
  "distance": 8.48,
  "heading": 3.432,
  "instructions": [
    "Turn right and down the hallway. Turn left and wait near the round table . ",
    "Turn around and exit out the wood and green door to the right of the fire extinguisher. Walk forward until you reach the rope. Stop on the other side of the rope when you reach the next rug. ",
    "Turn around and exit the door to the right of the fire extinguisher. Walk forward and enter the next room. Walk over to the small table and stop behind the first stool you reach. "
  ],
  "path": [
    "248492258fd5435c8276f59f63ddf0ef",
    "c55fa077761c4154af4b26da88eee80d",
    "744eba592017466eab0da528e0cfdf7c",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "cd680b57443748fcae2de7c8e39970ad",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 4898,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03933416193415868,
  "num_matches": 1794,
  "direction_num": 7
},{
  "distance": 14.43,
  "heading": 6.059,
  "instructions": [
    "Walk straight into the cathedral. Walk through the footpath of the single pew on your right, moving towards the center of the room.  Walk up the center of the cathedral and stop when you get to the front of the altar. ",
    "turn slight right and walk over chair, at next row of pews turn slight left into center of main room, turn right  and walk up 2 stairs, stop facing main alter and cross. ",
    "Go and stand in the center of the main alter. "
  ],
  "path": [
    "b44972ac14a04dc1a18556e918b0c0c7",
    "dad0e2b0427b40ec8e23f21760179e22",
    "57675495582049a08d338804d36e72e6",
    "2094de1e2c934d9ca603a405739df547",
    "ec1f835335ec483d81238a3729e7d34a",
    "1ecbf04528c0464e9e2fa4aa55ecb69f"
  ],
  "path_id": 2641,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.061410368768476026,
  "num_matches": 5193,
  "direction_num": 6
},{
  "distance": 6.37,
  "heading": 1.064,
  "instructions": [
    "Once you are in the library make a right and go through the door to the room with the glasses. Now make a right to leave the area and wait in the doorway. ",
    "Turn around so that you are facing the open doorway.  Walk towards the two open white doors.  Walk through the doors.  Proceed down the hall until you reach an open doorway on your right.  Stop and turn ninety degrees until you are facing the open doorway.  Walk through the open doorway and stop.  You are in a large room, and there should be a large table in front of you. ",
    "walk away from piano through double doors with bookshelf on left, turn right and stop in doorway. "
  ],
  "path": [
    "3769d27ee6f8462e815e9ebdc33af7e8",
    "b1265fece0604be79853a0ce270d7c45",
    "c6e8090bda95489fb0dc1c5b569461e7",
    "51d76627bfb6408c96792ae892dde21f",
    "9e843154119444daa94914691bcfd869",
    "add134cc07e64d9d8524d0d9f96c4180"
  ],
  "path_id": 4722,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.08455890101835474,
  "num_matches": 1700,
  "direction_num": 7
},{
  "distance": 10.03,
  "heading": 2.05,
  "instructions": [
    "Head towards the two ivory tusks at the opposite side of the room, then exit the room through the narrow corridor to the left. Stop once you've exited the corridor and have entered the next room. ",
    "With your back faced towards the art easel, walk straight forward past the wooden box towards the two large white tusks. Directly to the left of those tusks is an open door to which you turn towards and your destination is just a few feet beyond that. ",
    "Go to the statue on a pedestal. Go through the corner passageway. "
  ],
  "path": [
    "31866025bbc74d7fbf99524d81d35bd1",
    "8e0a04db99fd4c61a9f669d2e6e421a8",
    "9f6684e165434894a5185bb5c3e2c275",
    "764cb58a8d31461892ca6bdc675c14df",
    "be255b95116f48599c036544957334ec"
  ],
  "path_id": 7263,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10915416016020732,
  "num_matches": 3078,
  "direction_num": 9
},{
  "distance": 5.85,
  "heading": 3.341,
  "instructions": [
    "Move up the stairs. Turn right at the moose decoration and continue moving up the stairs. Stop just before the green carpet on the next floor when you finish ascending the steps. ",
    "Go up the stairs and stop at the top next to the stuffed bear. ",
    "Go up all of the stairs and wait at the stop facing the plaid chairs. "
  ],
  "path": [
    "e0d208d8f64d48d59aa8a971c3892e29",
    "abfdc492f81e4b8e87837b26cde983a8",
    "ea33c2a8e88742e19afe11c54680c7e2",
    "accd06798cf84596ada8f0cbc36af696",
    "7f83a9b5299744cc8bc32be5d94108c0",
    "a09817a4c04d49d1b8f2badabb7692ae"
  ],
  "path_id": 1327,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.04820815067318221,
  "num_matches": 1615,
  "direction_num": 1
},{
  "distance": 11.97,
  "heading": 2.909,
  "instructions": [
    "Stand facing the railing and walk left down the walkway.  Go up the stairs at the end and stop on the sixth step from the bottom. ",
    "Across deck towards the stairs. Go up the stairs and stop on the fifth step. ",
    "Walk across the deck and walk halfway up the brick stairs. "
  ],
  "path": [
    "88f27f2d89d84d689bbe1ba584e211c5",
    "e74cca5444c34dbf9b071e6ef0a538ce",
    "65f77641cf3b4650bf492763e6ec5790",
    "1b8c3792715f4483aab0d36698658ef6",
    "136ca89bcb5d441c877de80ebbeb6490",
    "5c2ab2b08f2d40b3aa4dd5f25013d924"
  ],
  "path_id": 4181,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.02802694047283749,
  "num_matches": 1846,
  "direction_num": 3
},{
  "distance": 7.47,
  "heading": 2.156,
  "instructions": [
    "Walk through double doors and take a right at the tapestry.  Walk to the end of the hallway and wait by the bathroom door on the left. ",
    "Go through the double french doors and then turn right. Follow the runner through the hallway and turn left. Stand in front of the bathroom doorway and wait there. ",
    "Turn left and exit the room. Turn right and walk across the hallway. Exit the hallway by the farthest leftmost doorway. Wait by the mirror just outside the bedroom. "
  ],
  "path": [
    "88f5ba9d06ac4413b1a3908af6544308",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 5131,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09614982048628362,
  "num_matches": 2385,
  "direction_num": 7
},{
  "distance": 11.87,
  "heading": 4.886,
  "instructions": [
    "Exit the room and make a left. Walk to the other end of the carpeted walkway, and make a left once you counted the 3rd tall, wooden post. Wait at the wooden door entrance of a bedroom where there is a sink to the left once you enter the bedroom. ",
    "Leaving the room facing the wall in the hallway take a left and go down the hallway straight ahead down the hall and taking a left into the last bedroom in the second door on the left on the at the end of this hall before entering the next hallway. ",
    "TURN TO THE RIGHT UNTIL YOU ARE FACING A HALLWAY WITH ANIMAL PELTS ON THE WALL, WALK DOWN THE HALLWAY UNTIL YOU REACH THE LAST DOOR ON THE LEFT, TURN LEFT TO FACE THE DOOR, WALK THOUGH THE DOOR AND INTO THE BEDROOM. "
  ],
  "path": [
    "1e013670f0ba4c9494734cedf464e11a",
    "4e900e156c83453495bfdc9348369b9c",
    "5afc855988064b999acb5b3b180e8348",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 652,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11009823420625094,
  "num_matches": 4994,
  "direction_num": 9
},{
  "distance": 14.73,
  "heading": 3.841,
  "instructions": [
    "turn left and walk towards opening on the right. Enter large hall. turn left towards short stairs. Go up short staircase and stop at the top between another set of stairs. ",
    "Walk through the living room area passed the chairs. Walk through the open double doors and into the entry room with red carpet. Walk up to the stairwells. ",
    "Follow the couch round the table and out the door on the right side of the room. Walk up the stairs to the left and hold on the landing between the winding staircases. "
  ],
  "path": [
    "acd8315e6a434feabd3937499bd53dbb",
    "259fd84d195d4d9bac4e14bdf953521d",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "154cbcc9b744473780da78d787e1ad34",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 45,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05620947246921239,
  "num_matches": 2918,
  "direction_num": 7
},{
  "distance": 12.39,
  "heading": 1.199,
  "instructions": [
    "leave the room with the barber chain in it and walk 5 feet into room with long table.\r\nturn right and walk 20 feet to the end point of the long table which should be on your left.\r\nat the end of the long table turn left to face an open door with glass windows on the top half and with a ventilation grate directly in front of door jam.\r\nwalk approximately 8 feet to the entrance of the open door and stop just outside the entrance to peer into a hallway which opens to another open door with a bed facing you. ",
    "Turn around and walk into the dining room. Take a right. Take a left after the table and wait in the doorway. ",
    "Walk into the dining room and turn right.  Walk past the long table and turn left before you reach the smaller round table.  Walk to the open door that has the four glass panes, and stand in the doorway. "
  ],
  "path": [
    "5eedd74c2a86462dafb8031559666b15",
    "60296c63d7814cd09749634f671708ad",
    "21dd8e71dae64f378401cb0eba702b7d",
    "ce5df3235866447d95c4667d72528984",
    "a5f4055ab7134ffcbbe8b33150552301",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "59163d8ecd3a41038c79bad8d0b51d7e"
  ],
  "path_id": 90,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.08665131323820378,
  "num_matches": 2218,
  "direction_num": 8
},{
  "distance": 10.16,
  "heading": 4.635,
  "instructions": [
    "on the balcony, turn right and go into the bedroom, walking between the bed and couch.  Turn to the right and walk into the bathroom.  Go to the toilet room and stand there and wait. ",
    "Walk into the bedroom from the balcony.  Walk across the bedroom.  Enter the bathroom by the first door on your right.  There are two doorways close to one another.  The doorway for the bathroom is in the darker painted wall.  Inside the bathroom, make a left and stop in front of the toilet. ",
    "Go check on the bathroom that is in the bedroom as soon as you walk through the door off the porch. "
  ],
  "path": [
    "cf1e2fed4ab24fe4818c1a92c8567786",
    "234597e72c5f4c79a88e94ccc7979b4a",
    "e0dc27df8b2d4484bde0f97284d4cdf7",
    "285b697fed754f86a09602c93628cfb4",
    "8b07a4b08cf447abb246769d8dce8494",
    "950f2117a6164fbc8d2faff96c40a1e9",
    "c28d78b8e9c94e89aac08c1f75804c3d"
  ],
  "path_id": 23,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09271647322868312,
  "num_matches": 1536,
  "direction_num": 4
},{
  "distance": 7.17,
  "heading": 1.157,
  "instructions": [
    "Go to the stairs and go all the way down. Wait at the bottom of the stairs. ",
    "Face the stairway and walk down.  Wait at bottom of steps. ",
    "Go to the bottom of the staircase and stop. "
  ],
  "path": [
    "53672af2c15047818f2ead24a2370930",
    "9001b330086e4aa69799729560e6dca0",
    "c4fc538718cc4918884d2040ce523a5f",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "673ae67937804c42b3c22e93efb5d069",
    "fea7a9db41944d76b258036b046d13aa",
    "32fb55017460457cbe0b8d1790a54786"
  ],
  "path_id": 4090,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.059051319858855554,
  "num_matches": 1790,
  "direction_num": 2
},{
  "distance": 12.25,
  "heading": 3.107,
  "instructions": [
    "Walk between the stone walls and turn right at the bookcase. Walk across the room between the table and ping pong table and wait there. ",
    "Enter the office room and turn right. Walk past the ping pong table and wait near the desk with the white garbage can. ",
    "Go straight and pass the tables and chairs. Go past the ping pong table and wait by the desk with two brown chairs and one black chair. "
  ],
  "path": [
    "a31805b1b6dc4947a9cf22f16850a142",
    "83404d7a12fc4749bf0cfff1e1e07987",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "114842471cc14a44b2f284c943281413",
    "a25a1fe848e044a99a0033878cd108bb",
    "2ed7a969a2d94eeb992c4f49d59cf0d7"
  ],
  "path_id": 2704,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.05285902622046442,
  "num_matches": 1645,
  "direction_num": 5
},{
  "distance": 5.46,
  "heading": 2.971,
  "instructions": [
    "Walk past coat rack. Walk through closed door. Wait at fireplace. ",
    "Walk out the doorway. Move around the chair in front of the fireplace. Stop in front of the fireplace. ",
    "Go through the door with the glass oval. Go toward the fireplace and stop in front of the fireplace. "
  ],
  "path": [
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "35aade4482c04c1385cbb19c25bd1d7e",
    "091c189689a74ae3908ba76361e0cae0",
    "7a489c31ceb14eca8783e4f1d8dc1c41"
  ],
  "path_id": 1243,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.0593128533836938,
  "num_matches": 1751,
  "direction_num": 1
},{
  "distance": 5.68,
  "heading": 0.892,
  "instructions": [
    "Take a left into the library, then sit on the white chair to the immediate left. ",
    "Walk forward to the dining room table. Turn left and enter the room. Wait at the chair by the door. ",
    "Go past the table and turn left on the second door. Wait right by the light blue couch. "
  ],
  "path": [
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "b03eb3aa3b6e4c5abb5e78830372ff89"
  ],
  "path_id": 2716,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0743507880112487,
  "num_matches": 1538,
  "direction_num": 7
},{
  "distance": 7.54,
  "heading": 1.157,
  "instructions": [
    "Walk down the stairs and turn left once you get to the bottom.  Step into the kitchen/eating room and stop just after going through the doorway. ",
    "Go towards the top of the stairs, go down the stairs, make a left into the archway and stop. ",
    "Turn around, go down the hall to the stairs, then go down the stairs. Turn left and wait in the doorway to the kitchen. "
  ],
  "path": [
    "53672af2c15047818f2ead24a2370930",
    "9001b330086e4aa69799729560e6dca0",
    "c4fc538718cc4918884d2040ce523a5f",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "673ae67937804c42b3c22e93efb5d069",
    "fea7a9db41944d76b258036b046d13aa",
    "8f5a767771964a56b3708d5415c446b2"
  ],
  "path_id": 2418,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.05916043653030206,
  "num_matches": 1671,
  "direction_num": 8
},{
  "distance": 9.72,
  "heading": 3.751,
  "instructions": [
    "Walk forward and make a left into the first hallway. Continue down that hallway and climb over the ropes in front of you, if they are there. Wait on the oriental rug on the floor in the sitting area. ",
    "Make a left to exit room, proceed down hallway, and stop in fainting room. ",
    "Turn left into the hallway. Go straight until you get to the oval table.Wait there. "
  ],
  "path": [
    "af3af33b0120469c9a00daa0d0b36799",
    "c55fa077761c4154af4b26da88eee80d",
    "744eba592017466eab0da528e0cfdf7c",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "cd680b57443748fcae2de7c8e39970ad",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 5624,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03383207073344402,
  "num_matches": 1523,
  "direction_num": 7
},{
  "distance": 6.76,
  "heading": 2.097,
  "instructions": [
    "Walk into the room, directly right of the three pictures on the wall. Walk through the room, and through the doorway on the left. Stop when you are in front of the mirrow. ",
    "Go down the hallway opposite the door to the outside area, and then make a left at the first doorway, go into the room and cross the room between the green counter and the brown table into the brown archway, take a step into the bedroom and stop. ",
    "Position yourself so that the railing is on your right and walk down the blue carpet and turn left at the first door.  Walk into the room with the square table and chairs and enter the room to the left.  Stop near the mirror after passing the pocket doors and entering the room. "
  ],
  "path": [
    "732ae10002fe4de0a6f62864391cdf11",
    "cc7f149e59eb47fd8bde336f2bf3391d",
    "7c8bb5c8b95941359d5f20d3b4f7eca1",
    "eb9ebc006f78472b92fa252c47715a3a",
    "b533c9d2c25b4b10afa49cb37910ccda"
  ],
  "path_id": 6598,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06576169783998899,
  "num_matches": 1567,
  "direction_num": 8
},{
  "distance": 9.09,
  "heading": 0.133,
  "instructions": [
    "Walk down the first flight of stairs and turn right. Go down 2 steps and stop. ",
    "Go down the stairs, at the first landing go to the right and stop. ",
    "Go down the stairs to the first landing. Turn right and go down three more steps. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "e87f560e1b5a497487526e64db42f8c8"
  ],
  "path_id": 6090,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04996544053768653,
  "num_matches": 2897,
  "direction_num": 8
},{
  "distance": 10.61,
  "heading": 1.13,
  "instructions": [
    "Exit the room and walk straight across the next room. Wait in front of the bathroom. ",
    "Turn to your left and exit the room. Go across the next room and enter the door straight across. Stop once you enter the bathroom door. ",
    "Leave the salon and walk past the table. Go through the door straight across. Stop in the doorway. "
  ],
  "path": [
    "47e9ed95d9c740248ad1c6fa1352528e",
    "4cc28f0811834f66a8b759b463fa7f9c",
    "5eedd74c2a86462dafb8031559666b15",
    "60296c63d7814cd09749634f671708ad",
    "397cae1de3b74644804196b838fd3c8a",
    "6274ee399dac4c5fb61f8198069b490e",
    "4903a8de1d0945b6bd815f11aa2850e9"
  ],
  "path_id": 3744,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.08676439836293115,
  "num_matches": 1512,
  "direction_num": 5
},{
  "distance": 7.12,
  "heading": 3.322,
  "instructions": [
    "With the green painted wall to your immediate left, walk forward into the hallway all the way to the end. At the end of the hallway, turn right and enter the bedroom. ",
    "Walk down the long hallway towards the square tapestry on the wall.  Turn right and walk through the open door that says \"Sunset Room.\"  Take a few steps into the room and stop on the carpet that is next to the bed and the white nightstand with a clock radio on it. ",
    "Walk down the hallway, heading away from the door labelled \"Master Suite.\"  Go through the second doorway on your right.  The door will be labelled \"Sunset Room.\"  Stop next to the bed in the Sunset Room. "
  ],
  "path": [
    "de655166da274d40841f1e5e488ab641",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "62994d72dab246fbb839f3699b9cacd6",
    "413903c083d64f2696539cf9f181894e"
  ],
  "path_id": 7134,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.12084008265674269,
  "num_matches": 3125,
  "direction_num": 8
},{
  "distance": 6.58,
  "heading": 4.461,
  "instructions": [
    "Walk past the bed on the left, and through the door. Stop immediatly before passing under the doorway. ",
    "Turn to the right and walk past the bed. Walk into the next room, standing by the fireplace. ",
    "Walk straight past the bed and walk slightly to the left stopping by the doorway. "
  ],
  "path": [
    "c94a99a685884c29b5f4857fb70298e0",
    "2e02646332bf40d9b91a3373c87e4e5a",
    "7281ba9281a94372bda0a330dfc7afa8",
    "326494a7ec264aa7a19b6e49b0e71415",
    "b533c9d2c25b4b10afa49cb37910ccda",
    "5bc65c559e2c4edc92ac6e9832d28ab1"
  ],
  "path_id": 6542,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06120987574850126,
  "num_matches": 1511,
  "direction_num": 7
},{
  "distance": 5.26,
  "heading": 3.044,
  "instructions": [
    "Turn 180 degrees to face stairs. Walk up stairs. On landing, make slight left toward door in corner with light switch next to it. Stop in front of door. ",
    "Turn around and walk up the stairs. At the top, turn left and stop when you reach the first door on your right. ",
    "Go up the stairs. Turn left and wait there near the large white door ahead. "
  ],
  "path": [
    "fea7a9db41944d76b258036b046d13aa",
    "673ae67937804c42b3c22e93efb5d069",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "c4fc538718cc4918884d2040ce523a5f",
    "9001b330086e4aa69799729560e6dca0",
    "d8b7a6a6205f4e72b6ce4bd31d296660"
  ],
  "path_id": 5582,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.07178169007737194,
  "num_matches": 1587,
  "direction_num": 4
},{
  "distance": 13.91,
  "heading": 2.804,
  "instructions": [
    "Exit the room, make a right and go straight through the room to the next archway, then take a few steps into the big room and stop. ",
    "Walk through the doorway in front of you. Once out turn right. Go across the large open room with the rug and enter the door straight in front of you. Once you enter the next room. Stop right before you get to the carpet. ",
    "Take a right and wait in the entrance to the large open room. "
  ],
  "path": [
    "377785e3a8ec4ce7bff6de3035f6fcd5",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "f12b7ffe7f9e4ece9bd927edf6b52b71",
    "1ad73ac43096496f9b6084071d1d944f",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 2530,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.09638871714854036,
  "num_matches": 4352,
  "direction_num": 6
},{
  "distance": 5.5,
  "heading": 6.028,
  "instructions": [
    "Go forward so that you line up with the pool. Towards the middle of the pool turn right to be between two chairs. Continue forward until you reach the stairs. ",
    "With the pool on your left walk straight and go through the tan and green patio chairs towards the stairs out of the patio stopping before you hit the mosaic at the bottom of the stairs. ",
    "Walk straight past the first two lounge chairs, then turn right. Wait by the steps. "
  ],
  "path": [
    "e775ea81e83c45719de5a1577f8f7e39",
    "9b2b12257e9a4c5d9f99f141769e9301",
    "7e094a308dec4987a5185a0426f4ec3c",
    "ff2dd63ad83245c3b4831b4f8a6911ac",
    "2596868500734b1496d479e6936cceb3"
  ],
  "path_id": 575,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.0980307414382566,
  "num_matches": 3753,
  "direction_num": 9
},{
  "distance": 9.45,
  "heading": 4.887,
  "instructions": [
    "Walk down hall to exit sign. Turn right and stop at sink. ",
    "Turn left to walk down the hall toward the exit. Wait in the last doorway on the right. ",
    "With the handrail to your left, move down the hallway towards the exit sign at the end. Stop at the entrance to the room just prior to the exit sign. "
  ],
  "path": [
    "9bbc936210084a00ad05856e0f5a3364",
    "ba692fd9ec524282935a608d975374e3",
    "5afc855988064b999acb5b3b180e8348",
    "4e900e156c83453495bfdc9348369b9c",
    "1e013670f0ba4c9494734cedf464e11a"
  ],
  "path_id": 2869,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09609409886964221,
  "num_matches": 3309,
  "direction_num": 8
},{
  "distance": 12.29,
  "heading": 5.804,
  "instructions": [
    "Follow the long red rug and leave the sitting room. walk froward in the open area and take a right at the end of the roped off seating area and stand on the red rug behind the sitting area before you reach the doorway into the next room/. ",
    "exit room and walk through room, stop between doorways on right. ",
    "Turn right and walk along the red carpet into the next room past the chairs and wait between both entrances. "
  ],
  "path": [
    "45bdfa7b4d2b4d7e961898c9bf703c7d",
    "bf7dedec250d405f809a7124509d7c2f",
    "564526d4eff54e61b077aefcfb070cfd",
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "fd433ad8502149ec849c4c51bb989e4a",
    "248492258fd5435c8276f59f63ddf0ef"
  ],
  "path_id": 915,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03309876588106077,
  "num_matches": 1583,
  "direction_num": 4
},{
  "distance": 8.41,
  "heading": 3.913,
  "instructions": [
    "Go around the table and pass the ping pong table. Wait near the desk with the two brown chairs and one black chair. ",
    "walk to center of room, turn right at ping pong table. Walk straight towards glass doors. Stop next to the desk on the left. ",
    "Walk past the ping pong table. Wait at the white garbage bin on the floor to the left. "
  ],
  "path": [
    "6855b783e2f34c7981b90ddb5de81bd7",
    "6944cb3d349a424899b2ed5b4c972763",
    "114842471cc14a44b2f284c943281413",
    "a25a1fe848e044a99a0033878cd108bb",
    "2ed7a969a2d94eeb992c4f49d59cf0d7"
  ],
  "path_id": 2646,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07002087357937717,
  "num_matches": 1888,
  "direction_num": 6
},{
  "distance": 14.14,
  "heading": 6.135,
  "instructions": [
    "Walk up the curved staircase on the right.  Next turn left to walk up the next set of stairs.  Walk towards two white pillars at top of steps.  Wait here. ",
    "Go up the stairs on the right.  On the landing, turn left and go up of the rest of the stairs.  Stop on the last step before reaching the top. ",
    "Walk up the staircase to the right. Walk all the way to the top of the staircase. Stop on the second step from the top. "
  ],
  "path": [
    "3f75b2d4af4d4afd85666d4c1302008c",
    "3c9615b3193a4e71ae932ea45fef8dde",
    "e87f560e1b5a497487526e64db42f8c8",
    "fd263d778b534f798d0e1ae48886e5f3",
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 5989,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03654315310339091,
  "num_matches": 2402,
  "direction_num": 6
},{
  "distance": 16.94,
  "heading": 1.448,
  "instructions": [
    "Turn to the right.  Walk straight ahead until you get to a big fan.  Go a little to the left and walk down that aisle.  Stop there and wait by the big wooden chair. ",
    "Walk across church to railing. Go over railing. Continute across church to pews. Walk straight between pews and desks to pillars. Turn slight left and enter next set of pews to left of fan and stop between pews and desks. ",
    "Turn right and walk between the pews and stop beside the pews that sit in front of the organ. "
  ],
  "path": [
    "934734efa498455bbbabb9e0cc8e342d",
    "0cfb39f99a5649fe9d49e5669779c43d",
    "23b6674835004403ab9356fdc7e2a7d5",
    "d57e0c1e647a4c03a9616384045926e0",
    "dae1c005bfed4efb8b08dd35c18190c2",
    "28e29ebaf1694e0f870cad8268220287"
  ],
  "path_id": 1364,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.05879234411343953,
  "num_matches": 4004,
  "direction_num": 8
},{
  "distance": 9.55,
  "heading": 1.543,
  "instructions": [
    "Walk up two sets of stairs.  Continue straight towards colorful painting of a boat.   Enter room to the left of the painting.   Wait by sink. ",
    "Walk all the way up the stairs to the top of the stairs. Once at the top, walk forward passing a bedroom on the left. Walk towards the last room on the left. Enter inside the room, and stop there. ",
    "Turn and walk up the stairs all the way to the top. At the top walk straight forward and enter the last door on the left and stop in the doorway. "
  ],
  "path": [
    "d0b75539f2484b0bb8e1612e549c06d3",
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "cefe85eb9d1e4592a020547df6107246",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "087bf4ad4a0b4a17afc2d6c173eceff3",
    "3851376d4f84494ebdc080b34ddc0f5e"
  ],
  "path_id": 4047,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09726238545950475,
  "num_matches": 2082,
  "direction_num": 10
},{
  "distance": 8.91,
  "heading": 4.721,
  "instructions": [
    "Exit the laundry room, turn right, and go down the stairs. Stop about two steps above the final break in the stairs, in front of the shiny round silver object on the wall. ",
    "Exit the laundry room then turn right and go down the stairs. Go down twelve steps then wait there. ",
    "Exit the room and turn right. Go down the stairs and stand on the bottom of the steps across from the silver round wall art. "
  ],
  "path": [
    "ec8f8c12b70e4969ae24adb7031d9312",
    "3851376d4f84494ebdc080b34ddc0f5e",
    "087bf4ad4a0b4a17afc2d6c173eceff3",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "cefe85eb9d1e4592a020547df6107246",
    "cc0682e6d88a44f3bfaeb81e91a79124"
  ],
  "path_id": 3427,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09640607887739823,
  "num_matches": 1824,
  "direction_num": 7
},{
  "distance": 6.92,
  "heading": 4.887,
  "instructions": [
    "Walk straight and past the bar. When you pass the table and chairs and get near the fireplace turn left into the hallway. Wait there. ",
    "Turn right. Turn left after the television that is on the wall on the left. Stop and wait there. ",
    "Head toward staircase passing by dinning area, make a left, and wait at entrance. "
  ],
  "path": [
    "8fa748001d8d47c8aa0c116d9fd14866",
    "e2230fa2c84b43cfb8d414048a8241a1",
    "0328d42616e244aeaa60f339795c9ad8",
    "f0d137bab5454f96857166a48536cb59",
    "105998261dc9418da248f0190c8b1568",
    "54f83ce9bf4543ff8219bd1c450ada78"
  ],
  "path_id": 5347,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08007454183049836,
  "num_matches": 6402,
  "direction_num": 7
},{
  "distance": 9.52,
  "heading": 5.316,
  "instructions": [
    "Walk forward and slightly to the left, going around the glass floors and past the gray lounge chairs on the left. Wait next to the sliding glass doors. ",
    "Walk forward past the lounge chairs. Walk past the table into the doorway and stop. ",
    "Walk past the pool between the water and the gray pool chairs, wait at the doorway to the office. "
  ],
  "path": [
    "69c059f0f5c6450e8cc5e6459bd4cb3c",
    "bda8025f20404048a77381e9e0dc0ccf",
    "4848ed4db295441c8722127d3df1c8c1",
    "6536cc05bf45478aa2aceaa3bc575b61",
    "6a2ce6dc04294e55af92a617d00fc4aa"
  ],
  "path_id": 819,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.10664290400667045,
  "num_matches": 1689,
  "direction_num": 8
},{
  "distance": 7.16,
  "heading": 4.285,
  "instructions": [
    "Exit the bathroom to the room then exit the room using the door on the left then turn left and head down the hallway then turn left on the next room and wait by the bed. ",
    "Exit the bathroom. Enter the bedroom. Exit the bedroom to the door on the left. Take a sharp left. Walk toward door on the left. Enter the bedroom. Wait there. ",
    "Exit the bathroom and turn left. Go through the door, exiting the bedroom and turn left again. Walk passed the lamp on the small table and go in the first room on the left.  Wait in the doorway next to the night stand. "
  ],
  "path": [
    "57604d4a6801436f9875134330834eb0",
    "c3f0a365dde24eb1a98807c5f02f8125",
    "7f39d79ddfec4b6e9c98e51576d59ab1",
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 3238,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12440205492731435,
  "num_matches": 5727,
  "direction_num": 10
},{
  "distance": 6.08,
  "heading": 5.833,
  "instructions": [
    "Walk down the stairs, turn right and then wait near the elevator. ",
    "Go downstairs and wait in the hallway, in front of the elevator. ",
    "Walk down the stairs to the bottom.  Turn right and stand near the elevator. "
  ],
  "path": [
    "53549a4cd8964df9a41acdf7a0257aff",
    "778b27da719d47b494cce8c6896a9bdf",
    "94446ee1941346fa9d9ed2e8251dd5c0",
    "abdb1b4d143e491f8a9350b2fd869122",
    "c69af2f0e57b485886e0f4667b2209a5",
    "70d67ed19aa34e34845d32ca74a1d711"
  ],
  "path_id": 4299,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.046122739719288826,
  "num_matches": 1523,
  "direction_num": 5
},{
  "distance": 7.01,
  "heading": 4.451,
  "instructions": [
    "Walk down the hallway with the tapestry behind you.  Turn left just after passing the small Christmas tree and enter the bedroom just before the staircase.  Stop in the doorway of this bedroom. ",
    "Walk down the hall and stop in the doorway next to the stairs. ",
    "Walk down the hall past the fire extinguisher and turn left. Stop in the doorway of the bedroom on the left. "
  ],
  "path": [
    "6249652893364b62b1c30df6c6516a71",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 6088,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.0787343285128732,
  "num_matches": 1812,
  "direction_num": 7
},{
  "distance": 9.45,
  "heading": 3.003,
  "instructions": [
    "Turn around and go up stairs to the second landing. ",
    "Climb three flights of stairs. ",
    "Go up the stairs. Turn right and continue going up the stairs. Go up eight steps then stop. "
  ],
  "path": [
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "cefe85eb9d1e4592a020547df6107246",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "558c07ff6d6d4d268f6c8de7abd76d1d",
    "cb6b9124a9594b4788966d28129cf531",
    "090a8663beeb4ce6aeadfe720ea0c8e9"
  ],
  "path_id": 7250,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.10306556378745381,
  "num_matches": 1923,
  "direction_num": 1
},{
  "distance": 8.23,
  "heading": 6.191,
  "instructions": [
    "Walk through the doorway between the two fireplaces. Wait at the gilded armoire. ",
    "Walk straight across the room and into the next one. Wait near the wardrobe. ",
    "Walk through the door between the two fireplaces. Veer right and step onto the rug. Stop on the rug in front of the armoire. "
  ],
  "path": [
    "adff6e1a0e8343a3bb02536c3f0fa420",
    "e1dd0761e4574583ada59217fd8980be",
    "9b23d010ac534ef190be38b9ab781a99",
    "bacce49c6f02481aaa803430d8699cee",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 4119,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03366372477419357,
  "num_matches": 1796,
  "direction_num": 2
},{
  "distance": 6.36,
  "heading": 1.745,
  "instructions": [
    "Go left along the balcony, make a right staying on the balcony, and make a right and stop. ",
    "Go straight and then turn right. Continue going straight until you get to a box with a cross on it. Then stop. ",
    "walk straight then turn right then walk again then turn right. "
  ],
  "path": [
    "0f69425af2544c6f981c0ae9a7f9b829",
    "1cf9bfa7442841e9b5edc64590d0e879",
    "1818ffc4d0eb47cfa726a12d3cfefee3",
    "7b19d99c586f456c8095502d78d0f6f8",
    "43f8894f1a9446599a6c89732aa3f2dc",
    "dc3170aacd3f40f2ac2f5b726bd75b88",
    "6c47cd8bd2664281bec3740c473946f8"
  ],
  "path_id": 6506,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.041116589657490564,
  "num_matches": 2087,
  "direction_num": 9
},{
  "distance": 17.18,
  "heading": 1.54,
  "instructions": [
    "Facing the wall and the double doors take a right and walk next to the wall then hang a slight right to walk in front of the long serving table covered in a white table cloth and stop next to the dining chair that sits to the right of the bar counter. ",
    "Walk along the wall to the left of the tables.  Keep walking until you reach the bar.  Stop directly in front of the bar. ",
    "Walk through the dining area passed the round table and then passed the long dining table. Continue to the bar area stopping near the counter. "
  ],
  "path": [
    "6785a37dc18b4dee9c60aa496efca3e2",
    "3a4650fded724e8587bc8fa91e0bdfc2",
    "f3d21b0654584b5292ecae9791515ad4",
    "7c16246e3d12454b97b6a5cf88a21032",
    "abd467777dcc41c0995588b7f97b388b",
    "47b09c2828524bb8925d108cf8c1829c",
    "31dfaa2e67354657a321602ab74e9b02"
  ],
  "path_id": 565,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.035653338567023726,
  "num_matches": 1609,
  "direction_num": 4
},{
  "distance": 8.75,
  "heading": 4.289,
  "instructions": [
    "Go straight down the hallway and stop in front of the second door to the left. ",
    "Walk down the hall away from the balcony door. Stop in the last doorway on the left before the wall turns to the right slightly. ",
    "Go down the hall and wait by the first door on the left. "
  ],
  "path": [
    "dd4abb5f6ded471baea5b6db19998fae",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "cc7f149e59eb47fd8bde336f2bf3391d"
  ],
  "path_id": 7146,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0907312449791465,
  "num_matches": 2351,
  "direction_num": 8
},{
  "distance": 6.42,
  "heading": 6.099,
  "instructions": [
    "Walk upstairs and wait on the landing. ",
    "Walk to the top of stairs.  Wait by table and chairs. ",
    "Turn to the right and go up the stairs until the top. Make another right on the stairs and go to the top. Go forward six steps. "
  ],
  "path": [
    "118169c7cc3f488e88a237f10cad437b",
    "e94cd6b986b5456990723fa8d9612759",
    "0d24c66abcef47fa898d9c239e6a3de9",
    "aa6ef1806b414e5ab49db9a45595c8cc",
    "564ec6d404cb4349a21a05e0b4bc5fc8",
    "2468abd2ba7b4e8a9222d3e318c6ad7f",
    "bace700b94f743d1bedc82b611604dee"
  ],
  "path_id": 5813,
  "scan": "EDJbREhghzL",
  "source": "R2R",
  "similarity": 0.04235700234204335,
  "num_matches": 1576,
  "direction_num": 3
},{
  "distance": 9.26,
  "heading": 3.841,
  "instructions": [
    "turn around walk through the large doorway, stop near the fireplace. ",
    "Exit the room through the doorway on the same wall as the mirror. In the next room there is a large empty rectangular table in the middle. Stand on the far side of it, between it and the two chairs. ",
    "Go straight into the door in the middle and wait by the fireplace. "
  ],
  "path": [
    "acd8315e6a434feabd3937499bd53dbb",
    "5ee1a604d54f459cb64f33acdd18910e",
    "26dedb23c6e949dcbc1aa47b70653ef3",
    "03f6e7e5c26b45d78feb5c2e3b6601e3",
    "50a6d809b39f4f19b02c4db72111046b"
  ],
  "path_id": 3560,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.030895048037529616,
  "num_matches": 1653,
  "direction_num": 1
},{
  "distance": 15.22,
  "heading": 4.008,
  "instructions": [
    "Turn left and walk along the red carpet. Enter the rightmost doorway behind the chairs. Wait by the small table in the middle of the chairs. ",
    "Enter siting room and walk straight across it passing chairs and table. turn right following rope.Turn left at open door. Enter through double doors and stop in the middle of the room beside chairs. ",
    "Travel straight through the large ornate room and through the double door with the golden wreath located on it and continue on until you see a large crystal chandelier. "
  ],
  "path": [
    "8113cb01c8d944a1af5f2dfc7f008b0c",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "293a1e64b85e4e84a3a44fe8ee9d9bd4",
    "248492258fd5435c8276f59f63ddf0ef",
    "e2f7333559be465d94798c1940b2e582",
    "f0244e1e73e34c6997e25f07e9b42328"
  ],
  "path_id": 1388,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.025756507588921798,
  "num_matches": 1574,
  "direction_num": 6
},{
  "distance": 5.87,
  "heading": 2.639,
  "instructions": [
    "Go to the dresser and turn right. Go through the open door at the end of the hall on the left. Enter the room. ",
    "After you leave the sitting room turn right and walk straight to the last door on the left. Now walk through the door and wait just inside the bedroom. ",
    "Go straight and turn right and go through door on the right and stop in the next room by the bed. "
  ],
  "path": [
    "3fd2f1d849de4e9f8c07863c845db6b5",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "138252ad9fab4ae1a86997fc363e6ac7",
    "87e7b6f2006541a9abe57fba18294a0c"
  ],
  "path_id": 7132,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.06911661573070485,
  "num_matches": 3457,
  "direction_num": 8
},{
  "distance": 8.14,
  "heading": 4.593,
  "instructions": [
    "Walk around the table and into the room with the long table and chairs. Walk around the table and go into the doorway on the left. ",
    "Exit the room through the smaller archway, make a right at the black table, go around the table and then stop in the archway just to the left of the tall greyish painting. ",
    "Walk towards the loveseat, turn left, and walk through doorway. Turn right in front of the table and walk around to the other side of the table.  Walk toward the door and stop in the doorway of the kitchen. "
  ],
  "path": [
    "3de5de73b782437291628651d994bfcf",
    "b03eb3aa3b6e4c5abb5e78830372ff89",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "7025038ba12d4a63a40c866489226fbe",
    "f4032225a0c6462ba02f728d031c2638"
  ],
  "path_id": 6445,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06514850621344943,
  "num_matches": 1723,
  "direction_num": 6
},{
  "distance": 9.09,
  "heading": 0.299,
  "instructions": [
    "Walk across the balcony passing the stone sink on the left. Wait by the couches. ",
    "Turn left and walk straight. Wait next to the beige couch. ",
    "Walk forward across the deck, passing the sink on the left. Turn slightly left and wait near the massage tables. "
  ],
  "path": [
    "db34b3aec8764d148b0a2cbebc0ebda7",
    "6a397fdd327d4bfa918a0d9586e4d25d",
    "fca61d936fac41c29ef4cd060765822d",
    "cab30cd8524348de8aa89b2c9e10167d",
    "de5a1f3ff9b24744b104e2e796b5cb29",
    "227ed4cadd89473b93bfdde29decd566",
    "bf6f080d1a064a2eb641e3ec699ed354"
  ],
  "path_id": 2982,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.04710256048600004,
  "num_matches": 1602,
  "direction_num": 6
},{
  "distance": 6.99,
  "heading": 4.419,
  "instructions": [
    "Walk forward with the fireplace on your left. Go over the velvet rope and walk towards the ornate doors. Stop at the doors with the fireplace poker on your left. ",
    "TUrn around, walk on the red runner, go past the fireplace.  Stop when you get to the 3 chairs.  wait there. ",
    "Walk past fireplace. Walk past chandelier. Walk past fireplace. Wait at double doors. "
  ],
  "path": [
    "b4e027328a1b492e85e269df23fef364",
    "19c60ba074144f09ba124adef82ef7fa",
    "b109cc5c9d3648e18077568789335d07",
    "69b8eb3000854ba48b2882a35f125af5",
    "cfe63c48c4464ac88ef3c681d9a15d70"
  ],
  "path_id": 177,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.037022871116531936,
  "num_matches": 1902,
  "direction_num": 8
},{
  "distance": 6.83,
  "heading": 3.117,
  "instructions": [
    "Walk along railing in front of chairs. stop at corner of deck. ",
    "Turn left and move straight.  Move slightly to left while proceeding forward.  Go straight. ",
    "Walk along the railing on the balcony. Go past the lounge chair on your right and go to the other end of the balcony. Stop in the corner at the other end of the balcony. "
  ],
  "path": [
    "0ad36a01319242bab7c5e303c2731bfd",
    "b6b7f34e5288498f83297dcf91047b11",
    "4979277e157943be82cbff6c25ae8bef",
    "0dd92311e1a34edb96d589118f687489",
    "7327f809158841168372656773dd5236"
  ],
  "path_id": 366,
  "scan": "PX4nDJXEHrG",
  "source": "R2R",
  "similarity": 0.1360313145065435,
  "num_matches": 1672,
  "direction_num": 7
},{
  "distance": 6.54,
  "heading": 4.482,
  "instructions": [
    "Go down the stairs and take a right. Enter the safari room straight ahead. Stop in the doorway to the room. ",
    "Go downstairs, make a right, go into the doorway marked \"Safair\" and stop. ",
    "Head downstairs and turn right.  Enter the room with a fire extinguisher outside. "
  ],
  "path": [
    "778b27da719d47b494cce8c6896a9bdf",
    "94446ee1941346fa9d9ed2e8251dd5c0",
    "abdb1b4d143e491f8a9350b2fd869122",
    "c69af2f0e57b485886e0f4667b2209a5",
    "70d67ed19aa34e34845d32ca74a1d711",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 2427,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09471432547737504,
  "num_matches": 3544,
  "direction_num": 7
},{
  "distance": 6.09,
  "heading": 1.669,
  "instructions": [
    "Go straight down the hallway and into the room ahead. Wait near the two small Christmas trees. ",
    "Walk down the hall past the fire extinguisher and stop just inside the door. ",
    "Walk down the hallway past the fire extinguisher.  Keep going until you get to a door that says \"Master Suite\" and enter the room behind it.  Stop just after stepping into this room. "
  ],
  "path": [
    "61c5f348dc854631b9754d81d414d7e9",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792"
  ],
  "path_id": 5446,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.11985089872709825,
  "num_matches": 3184,
  "direction_num": 6
},{
  "distance": 12.59,
  "heading": 3.803,
  "instructions": [
    "Walk straight through to doorway on the other side of the room. Turn left and stop on the stairs near the table. ",
    "Walk straight past the hot tubs.  Go through the doorway and turn to the right.  Then veer to the left and stop there.  Wait. ",
    "walk forward with the pool on your left. Enter the house and take a right. Go forward into the living room and stop in the living room doorway. "
  ],
  "path": [
    "5d50911d1c074a3c8de82d35bc4c558b",
    "8ba5f3cf31934fc98cde3cf4a1116551",
    "6c8329a5bbd5423696d5d9a22237d0f8",
    "1ed9136647664140918246b69b5d2dc5",
    "9377f3ca210946ff9dbea4937cf7d3ad",
    "8c31225bb638494082b206e492422ebf",
    "2185b2e2cb704157aefd1dd81f5f3811"
  ],
  "path_id": 1981,
  "scan": "VFuaQ6m2Qom",
  "source": "R2R",
  "similarity": 0.048968034201260495,
  "num_matches": 1773,
  "direction_num": 10
},{
  "distance": 12.14,
  "heading": 3.166,
  "instructions": [
    "go towards the living room area, go to the kitchen area, turn left beside the bar,  turn right beside the refrigerator and stop beside the refrigerator. ",
    "TURN AROUND UNTIL YOU FACE A SHORT HALLWAY AND WALK TOWARDS THE ARCHED OPENING ON THE LEFT OF THE HALLWAY, WALK PAST THE LIVING ROOM COUCH AND TOWARDS THE KITCHEN ISLAND BREAKFAST BAR, TURN SLIGHTLY LEFT AND WALK TOWARDS THE REFRIGERATOR, TURN SLIGHTLY RIGHT AND WALK TO THE LEFT SIDE OF THE REFRIGERATOR FACING A THERMOSTAT CONTROL PANEL. ",
    "Turn around and go down the hallway into the kitchen area. Go behind the kitchen island and wait in front of the refrigerator. "
  ],
  "path": [
    "818d69716786445f8eef89a590ec3f52",
    "01b439d39a8f412fa1837be7afb45254",
    "f032c9ee981a4462914468785f0a4abe",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "ca75317572dc44509427cf7b2caecda6"
  ],
  "path_id": 832,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.0488227806280209,
  "num_matches": 1586,
  "direction_num": 4
},{
  "distance": 13.07,
  "heading": 5.943,
  "instructions": [
    "Walk across the patio and into the house. Go straight past the sectional sofa and wait near the three doors. ",
    "Enter the house walking along the left of the folding chairs.  Continue past the blue couch on your right and stop in between the three doors at the end of the walkway. ",
    "Enter house through big doorway, go straight through bedroom stop in hallway with 3 doors. "
  ],
  "path": [
    "551d27bc723b4edd954467a432bb9880",
    "977dbb923d414081844485814d142093",
    "b2797ae5fc94453f9b9049f9ccc63f58",
    "69ef6a026c7b41529a76364b0577703d",
    "0c55a4a0877b46459d81c35ffeaa34c0",
    "522362613f6341389177c0c259455f38",
    "21d840b73bd84f65a97d2577b9a7cc6c"
  ],
  "path_id": 1476,
  "scan": "sKLMLpTHeUy",
  "source": "R2R",
  "similarity": 0.09546609752365162,
  "num_matches": 1964,
  "direction_num": 6
},{
  "distance": 6.74,
  "heading": 0.496,
  "instructions": [
    "Turn around and walk behind the back of the couch outside. Once you go past the chair on the end, stop in front of the next large window on your right past the door. ",
    "Go straight behind the blue couch. Turn left when in front of brick wall. Turn left and wait. ",
    "Walk all the way forward and turn slightly left towards the column near the big pool, and stop in front of the column. "
  ],
  "path": [
    "37c2223d40cb4aedb1563e5e0c3a53e1",
    "ea67416e45b14671a358cf54260bdefa",
    "06cce75e286e46a59d44615b4936d9df",
    "91335d5f98b6406e95416adc396c26df",
    "ddf4309aa8014d47b566d5221beac723",
    "e640ea06e612471d9dc0782d42ca6f52",
    "0f57b286bcc44b888113d6d4f6c05d15"
  ],
  "path_id": 4370,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.08013161277186488,
  "num_matches": 5742,
  "direction_num": 9
},{
  "distance": 12.92,
  "heading": 1.07,
  "instructions": [
    "Enter house from porch, turn slight left and enter hallway, continue straight  and enter sitting room stop by the chairs. ",
    "turn around and go inside the doorway and then take a left and go to the next doorway then go straight until you are right under the next doorway. ",
    "Walk into the room and take a left. Go down the hallway and enter the room at the end of the room. Stop once you step onto the rug in the ballroom. "
  ],
  "path": [
    "062df9954974450a9eb914da2727062d",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "9cc6191a6e1642f984e54b1a79b83761",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "cfd9511c06b34cd1b89ba36919a4e6b6"
  ],
  "path_id": 1517,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.050722674829319796,
  "num_matches": 1923,
  "direction_num": 7
},{
  "distance": 5.22,
  "heading": 4.763,
  "instructions": [
    "Walk through the kitchen. Turn right around the kitchen island. Exit the kitchen toward the couches. Wait there. ",
    "Go through the kitchen. Pass the stove and turn right and pass the oven . Wait by the brown couches. ",
    "Head past  the counter and turn right at the stoves. Stop just inside the dining area next to the brown chair. "
  ],
  "path": [
    "814d9aba371640e5a70bcb7833bfe08f",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "f032c9ee981a4462914468785f0a4abe",
    "5186e9da9b4248318f4a7ae68d11da15"
  ],
  "path_id": 3451,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.059057188919269366,
  "num_matches": 1585,
  "direction_num": 4
},{
  "distance": 15.83,
  "heading": 3.093,
  "instructions": [
    "Facing the chairs walk forward through the aisle in between the white chair and go right behind the chairs on the right and take a left heading into the reception room off the hallway stopping just inside the doorway in the reception room. ",
    "Walk past folding chairs to building. Walk behind black bench. Wait at threshold of open french doors. ",
    "Turn around and walk past the chairs. Go around the wooden building to the right, and stop in the the doorway to the glass section. "
  ],
  "path": [
    "e79d29ec4b1a4e72b27747c5a6a5c172",
    "88bb47f4806a4c799a95998ed1f7a176",
    "083bda5a16e94813802376df1513dbeb",
    "2f030f62a693408098792b6f026cd88e",
    "fe83a0e1e30640bfa09eeb584727db21",
    "0e83345cd3d942f09ddc91b80911535a",
    "3c476cfa737347bda82af89dd8127ae3"
  ],
  "path_id": 461,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.04124953834710169,
  "num_matches": 1684,
  "direction_num": 7
},{
  "distance": 11.04,
  "heading": 3.103,
  "instructions": [
    "Turn around and walk towards the stairs near the Christmas tree. Next, walk up the entire stairwell. Turn right at the first door at the top of the stairs and wait in the doorway. ",
    "Go up the stairs, at the top of the stairs make a right into the doorway on the right and stop. ",
    "With the fireplace behind you, move forward and right to the base of the stairs leading upwards. Climb the stairs all the way to the top, then stop at the first door to your right with the label \"City Room\". "
  ],
  "path": [
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "41873d3929e64a9a938a5fac3b6bbd79",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "80befc44c6d14348a3f9bda8ba719d70",
    "bec7a60657d6483996aa2f0d03b9d691",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 6127,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04141193257353622,
  "num_matches": 2632,
  "direction_num": 7
},{
  "distance": 6.06,
  "heading": 1.725,
  "instructions": [
    "Walk down the stairs. ",
    "Walk down the hall and turn left. Stop at the top of the stairs. ",
    "Go straight down the hallway then stop at the top base of the stairwell. "
  ],
  "path": [
    "aaa8773c86214e9990d4c3ede3223499",
    "61c5f348dc854631b9754d81d414d7e9",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "0a796daf5b734fbbb52974e2349a6c0e"
  ],
  "path_id": 6630,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.08776532597090751,
  "num_matches": 1714,
  "direction_num": 5
},{
  "distance": 13.66,
  "heading": 4.001,
  "instructions": [
    "Go forward, turn left, head down stairs and keep going straight. Stop when at end of stairs. ",
    "Walk through the open door and down the stair case. And up the stairs on the other side. Sop at the top of the stairs near the door into the bedroom near the painting. ",
    "Turn right and walk towards the stairs. Walk down the stairs until you reach the other side and stop in the middle of the hall way. "
  ],
  "path": [
    "2665dbb7fe3e4f33811e687cc4054393",
    "259d382e92ce4a10bbc8e7d713b4b5ca",
    "80a66a290031459b8d96a077ee2cbf4f",
    "8d4b6c6b93934835a39c391d39f5a537",
    "30ac7a9f6c8d4bc4b27b7b2782f2eb99",
    "7d0855f289224c24b83f2b19b15c1d6d",
    "bbd00fa328db45e19a55bef3b3cb4b23"
  ],
  "path_id": 114,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.044692387292797,
  "num_matches": 1509,
  "direction_num": 8
},{
  "distance": 7.92,
  "heading": 1.789,
  "instructions": [
    "Walk down the path and turn left. Stop outside the glass door. ",
    "Walk towards the pool and take a left on the path. Stop in front of the door to the dining room. ",
    "Turn around and walk down the pathway behind you. Turn left at the end and stop halfway before you reach the house. "
  ],
  "path": [
    "236a4dea3b6e415baa0606e642d48784",
    "3eed2cb0dead4d9eb9bd7030ed437dcf",
    "884d01546f7d45ab977658ff323da87b",
    "b8b37a15b628463d9cfacb168332912b",
    "591d52de25f64bbbb3bc6365669c5a0f",
    "5791bf29c55c4664b970a4d1adcddf06",
    "d2a62238e6a8472381a0111b06f35f72"
  ],
  "path_id": 6971,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.026261381992639252,
  "num_matches": 1526,
  "direction_num": 6
},{
  "distance": 11.75,
  "heading": 2.94,
  "instructions": [
    "Walk around the piano and out the room.  Turn left and go down the stairs leading down.  Stop at the bottom of the stairs, in front of the mirror. ",
    "Pass the piano and go up the steps. Turn left and go down the steps. Wait near the round mirror on the left wall. ",
    "Walk out of the room, into the room with the stairs. Walk to the left of the staircase. Walk down the set of steps and stop on the carpet at the bottom of the steps. "
  ],
  "path": [
    "16a3ffd3d2ee4ce0921004f9872428cd",
    "237606bed97740599e39b32ac6316fe8",
    "c0086b5e4e0b41649f73b5c04bb7dbb7",
    "254f98bd6daa4313b04715ed29a61f88",
    "85599a90376043339b55e424eeb9aeab",
    "c1a3dc19c1154eb79d45f72d4885016d"
  ],
  "path_id": 4223,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.06003155247738829,
  "num_matches": 2355,
  "direction_num": 8
},{
  "distance": 6.12,
  "heading": 6.134,
  "instructions": [
    "Pass the bed and stop next to the couch. ",
    "With your back faced towards the sink, walk forward past the bed. Once you reached the opening into the outdoor area that has a bunch of couches, you've reached your destination. ",
    "Turn right and walk through the bedroom to the patio.  Wait near the patio set with the amazing view. "
  ],
  "path": [
    "13a8c23dab5b473fa8d449a126b949be",
    "a7a41dd2adbf4a69a12d49254f8a14e5",
    "83108d9e987b45c484362f5cda5b1bd1",
    "d0fd62a0342b4cf1ba722c39aca257ce",
    "4b1bbb88b7e444a499ac7c261b4495c1",
    "2f2cac014c7e4877baf8c45690e5f8a4"
  ],
  "path_id": 4131,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.13602367282906538,
  "num_matches": 1510,
  "direction_num": 4
},{
  "distance": 7.08,
  "heading": 3.238,
  "instructions": [
    "Exit the room through the doorway to the left of the mirror on the wall. Continue straight into the next room and stop when you get to the empty table in the middle of the room. ",
    "Enter the room straight ahead and wait next to the table. ",
    "Walk over the red velvet rope and into the room with the large hanging chandelier. Walk over the next velvet rope, and wait beside the table in the center of the room. "
  ],
  "path": [
    "691c4dda744849acb3daefd1bca9a2fb",
    "50a6d809b39f4f19b02c4db72111046b",
    "03f6e7e5c26b45d78feb5c2e3b6601e3",
    "26dedb23c6e949dcbc1aa47b70653ef3",
    "8be5effc17454d3f872ea16b4948015b"
  ],
  "path_id": 3752,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03527715140400313,
  "num_matches": 1895,
  "direction_num": 3
},{
  "distance": 9.88,
  "heading": 3.795,
  "instructions": [
    "Walk towards the fireplace then turn right and proceed to the next room.  Turn right and the dining room and enter the hallway.  Wait near the phone. ",
    "Walk toward the fireplace and to the right of it. Walk into the doorway on the right and stop. ",
    "Walk toward the fireplace and through the doorway to the right of it. Enter the bathroom area and stop outside the women's bathroom. "
  ],
  "path": [
    "b07554ffc3164d45bfe9410a40632261",
    "46e170296a7f4b88b50ebeb7e2a27894",
    "d807887a425a41249a31c69a41adb313",
    "28170cad00aa4938a612db2e82628000",
    "21da82bc068c4d19a1c9168e86c417c2",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6944,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11707420596325482,
  "num_matches": 8413,
  "direction_num": 6
},{
  "distance": 11.4,
  "heading": 0.873,
  "instructions": [
    "Go straight until you pass the chairs on the right. Turn right and then turn left. Wait near the chandelier. ",
    "Go straight and into the room on the right. Stop next to the light on the left. ",
    "Follow the red carpet forward and turn right to follow the roped off area. Turn left to walk through the double doors and wait near the fireplace. "
  ],
  "path": [
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "fd433ad8502149ec849c4c51bb989e4a",
    "248492258fd5435c8276f59f63ddf0ef",
    "e2f7333559be465d94798c1940b2e582",
    "7a3f8f06712a413b9d9b422a448b20bd",
    "3517198fc6744a2eab89d685f8cb93da"
  ],
  "path_id": 6257,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03198189126923482,
  "num_matches": 1922,
  "direction_num": 10
},{
  "distance": 6.48,
  "heading": 1.511,
  "instructions": [
    "Go to the end of the counter, turn left, beside the double chest of drawers turn left, go straight, stop beside the large snail on the floor. ",
    "Take a right and then take a left. Take another left and wait in the huge shower. ",
    "Walk forward and take a left. take the next left and enter the tile with the mosaic. Stop in front of the snail on the ground. "
  ],
  "path": [
    "c32282e053ad450e9187d9d95361b124",
    "f6872e6001054c67a12371a542c7defe",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "3fd2f1d849de4e9f8c07863c845db6b5"
  ],
  "path_id": 1849,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.046403728371921055,
  "num_matches": 2623,
  "direction_num": 9
},{
  "distance": 9.63,
  "heading": 0.646,
  "instructions": [
    "Go down the stairs and turn left. Walk into the kitchen through the open glass door. Stop halfway between the door and the kitchen sink. ",
    "Walk down the stairs at the bottom of the stairs take a left. Walk straight to get to the kitchen inside and wait just inside the door. ",
    "Walk down stairs to landing. Turn left and continue down steps. At bottom of steps turn left and walk toward kitchen. Stop before counter. "
  ],
  "path": [
    "30c97481412946f292272d28af5d00dd",
    "b72bbf5f815e43bca6bf4509fd7c9258",
    "5c1275543c164a4f9bc60b08d8cb5c43",
    "c92b9bd8b885423b8d6d1a7a58d2ca2c",
    "1349a908694c4494999f72c36e52e1bf",
    "4f8154a0785a4edfa6b5c73a4bbcc066",
    "bd5b0fbb5cce42aaac64b219b1a157fd"
  ],
  "path_id": 1384,
  "scan": "XcA2TqTSSAj",
  "source": "R2R",
  "similarity": 0.09889905364151845,
  "num_matches": 1835,
  "direction_num": 9
},{
  "distance": 5.87,
  "heading": 2.296,
  "instructions": [
    "Go in to the large room and towards the stairs Go up the first two stairs. Wait here. ",
    "Walk towards the stairs and climb the stairs halfway up on the first set of stairs. ",
    "Exit bathroom and go straight towards stairs..turn left and go up stairs. Stop on the 4th stair. "
  ],
  "path": [
    "2f20259787124d7e8a85408cd5767c65",
    "a9366b89465a49028782a840a165a7e8",
    "61ff336a2ec442268785b388864ea348",
    "cf33698ad71e4ff48d7ff42e35e3fd83",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "51328414aea04771890766f436b40021"
  ],
  "path_id": 325,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.07095718705690111,
  "num_matches": 1553,
  "direction_num": 5
},{
  "distance": 8.67,
  "heading": 4.955,
  "instructions": [
    "Turn around and walk up the stairs and take a right. Take another right at the fireplace and wait on the third step on the stairs. ",
    "Walk up the stairs and make a sharp turn right past the bear. Walk forward past the fireplace. Walk up to the third step and stop. ",
    "Go up the stairs. Turn right and continue past the chairs to the fireplace. Turn right to go up three stairs. "
  ],
  "path": [
    "fb1d28b8329e4951b803c84c34d187fa",
    "accd06798cf84596ada8f0cbc36af696",
    "7f83a9b5299744cc8bc32be5d94108c0",
    "4c477b124d744b75b561bab5d612bfd8",
    "7f03669f1daf499491770eb857dbe25d",
    "0e8e2c9d09974dab977c1d3868286f12",
    "abdb1b4d143e491f8a9350b2fd869122"
  ],
  "path_id": 1838,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11362711089079217,
  "num_matches": 3993,
  "direction_num": 9
},{
  "distance": 5.13,
  "heading": 2.049,
  "instructions": [
    "leave closet enter bedroom, turn right and go around the bed to the slider. go through slider to balcony and stop. ",
    "Leave the closet and walk past the bed towards the patio on the other side of the bed. Stop on the patio next to the first patio table chair. ",
    "Veer to the right, go past the foot of the bed.  Then veer to the left.  Go on to the balcony.  Stop and wait by the table and chairs. "
  ],
  "path": [
    "11ec36e3d78c43a389366c5159069b0c",
    "8b41e8798d78402f9f36b242972d729b",
    "efe359ee05ea46c587196354c2d1cc96",
    "0a709d588fcd4ae5badd921366074d7a",
    "156af10f63d84956ba5dc4b9fe3b2140",
    "5cd96a7c879547eda2a90077c79bc7f0"
  ],
  "path_id": 1495,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.059290940339808675,
  "num_matches": 2043,
  "direction_num": 6
},{
  "distance": 13.24,
  "heading": 4.657,
  "instructions": [
    "Go between two poles and between all the surrounding tables. There is a white couch in the corner of the room. Go to the coffee table in front of the white couch. ",
    "Leave meeting left across room with many desks and chairs and stop near sofa with pallet coffee table. ",
    "Walk between the tables and across the loft, stand in front of the coffee table by the white couch. "
  ],
  "path": [
    "1d789dc0ab3a48c8aa051f006d8ae874",
    "2b8074f44cbb43e0949091be7cc1a7b1",
    "6855b783e2f34c7981b90ddb5de81bd7",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "12eaa3a3a39e4c9fa5106812cb7da084"
  ],
  "path_id": 2734,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.05960177119768796,
  "num_matches": 1902,
  "direction_num": 1
},{
  "distance": 5.55,
  "heading": 4.679,
  "instructions": [
    "Walk towards the round table with the two chairs and stop in front of the bookcase ladder on the left. ",
    "Turn right and follow the path. Stop next to the desk. ",
    "Walk all the way forward passing everything and stop in front of the big book shelf visible on the left. "
  ],
  "path": [
    "e8e8f20091764538891d2cb74fa358a3",
    "72f26021b757414e9e9e087cbbe0ce20",
    "b4a95ae65e3947759563d94e9cfa135a",
    "8a6f42f92af64cf084c2adfc7397e142",
    "2ff597e4083c4124924fb6529da91e1e",
    "89f0bcf59c3544e18b4bb2a1e678bf33",
    "ccb433bb72fc4f9eb85cf3a7bac78925"
  ],
  "path_id": 4652,
  "scan": "JeFG25nYj2p",
  "source": "R2R",
  "similarity": 0.07044659996762397,
  "num_matches": 1535,
  "direction_num": 5
},{
  "distance": 9.45,
  "heading": 3.145,
  "instructions": [
    "Walk down the three flights of stairs, stop at the third step from the bottom. ",
    "Go downstairs, go left and left again to go down more stairs, at the level take four more steps down and then stop. ",
    "Walk down the steps and make a sharp turn left. Walk down the steps and stop on the third step from the bottom. "
  ],
  "path": [
    "090a8663beeb4ce6aeadfe720ea0c8e9",
    "cb6b9124a9594b4788966d28129cf531",
    "558c07ff6d6d4d268f6c8de7abd76d1d",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "cefe85eb9d1e4592a020547df6107246",
    "cc0682e6d88a44f3bfaeb81e91a79124"
  ],
  "path_id": 6634,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.11019110041790495,
  "num_matches": 2093,
  "direction_num": 9
},{
  "distance": 10.56,
  "heading": 5.636,
  "instructions": [
    "Walk down the hall, past the rug that's on the floor.  When you get to the next spot where you could turn left and right, you need to stop there and wait. ",
    "Move down the long hallway. Stop when you reach the second doorway on you right. ",
    "Go forward down the hallway with the dark wooden floor and on to the rug. stop after the end of the rug. "
  ],
  "path": [
    "aabeeacedf4443808d8479c55116ed18",
    "4b7c3faa94b34318bc00523ec9b9c6a3",
    "4a47eadc434047b8838668980cbb303a",
    "6274ee399dac4c5fb61f8198069b490e",
    "5fa450a5199b41b5b46628e473f20374",
    "ca8f4ab52e7d402a9d796b1f24c0ea64",
    "9c36a2928f3d436181736d628dd0a694"
  ],
  "path_id": 843,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.10667566850462305,
  "num_matches": 1754,
  "direction_num": 8
},{
  "distance": 11.12,
  "heading": 1.408,
  "instructions": [
    "Go into the room with the big blue rug. Go to the foot of the bed. Go through the open door nearest the foot of the bed. Go to the intersection of hallways and stop. ",
    "Turn around and exit out the door on your left between the red chairs. Once out turn right and cross the bedroom. Enter the 2nd to the last door on the right and stop in the hallway facing the stairs ahead. ",
    "Exit dining room to door on the left, walk across large room to first exit on right. stop in hallway with 4 exits. "
  ],
  "path": [
    "e8d145225316479db17c06bd77df5054",
    "5038f4f54ed14bef980e59f9e76ce0de",
    "dafcbb94981f4b719d2cbb741737830b",
    "6f1665f159cf4ba098116113c10f5ee8",
    "9e7bb9838d0e443c89775617be087d76",
    "78ad6e43879c433ea88417b72e61c80f"
  ],
  "path_id": 5220,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.04956161305442233,
  "num_matches": 1859,
  "direction_num": 5
},{
  "distance": 5.28,
  "heading": 5.356,
  "instructions": [
    "Walk past the oval table, straight into the bedroom with the long striped brown and grey rug.  Wait here. ",
    "Stand so the doorway is behind you and walk straight into the doorway on the opposite wall.  Keep going straight and stop just before stepping on the rug in the bedroom. ",
    "Walk past the large sliding door. Walk into the entryway of the bedroom. "
  ],
  "path": [
    "bed1e142845343c5b9695eabad5d170e",
    "5ee3f3c0dac54a1893594c1fde6a427a",
    "88fda52a9c9e4a5cb1774e741ecce8f6",
    "ca77dd4132f044b7b6b999d3795d09d3",
    "1a7fe152f6f34697bdcee712008f84e4",
    "6eddf5877b284e3184ddd6aec1e34101",
    "35b41dcbfcf84f96878f6ca28c70e5af"
  ],
  "path_id": 4165,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.10495788124873039,
  "num_matches": 1972,
  "direction_num": 5
},{
  "distance": 8.29,
  "heading": 1.574,
  "instructions": [
    "Walk out of the bathroom door into the hallway with red wall art. Walk through the entry into the kitchen area. Walk passed the counter tops and refrigerator and continue up to the rustic dining table ahead. ",
    "With the toilet on your left leave the bathroom and hang a slight right in the hallway and a left into the kitchen walking between the counter and the island counter go forward and stop just in front of the bench at the table. ",
    "Leave the bathroom and go into the kitchen. Go forward towards the table.  Stop in front of the wooden table with a bench on one side and three chairs on the other. "
  ],
  "path": [
    "9871b1fb068b495fa3e2ddac2f54cc16",
    "f553a3287fb2438b979f09b09448c7c0",
    "e0d2a4e22abe44d7810d7e448fff6704",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "1b48df86b7a149fa8e90161265def866"
  ],
  "path_id": 400,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.06281709276223887,
  "num_matches": 2013,
  "direction_num": 6
},{
  "distance": 16.61,
  "heading": 5.067,
  "instructions": [
    "Walk straight down hall to the bed room at the end of the hall. Stop when you reach the chair. ",
    "Turn right and go down the hallway towards the bedroom at the end of the hall. Go in the bedroom and wait in front of the bathroom door. ",
    "Walk forward toward the ached hallway. Continue down the hallway and enter the bedroom at the end. Stop next to the arm of the chair in the bedroom. "
  ],
  "path": [
    "6f9eb2058c134830b45d010c01de8e96",
    "eeef7235c2fe462eb3e0481b001537ce",
    "aaa698435aea48b29113314ee362e54b",
    "f51948f5b87546778b9800960f09f87b",
    "4c328fadee7746aaa3bc81984c4bce68",
    "15224ab8675346808c6cb06f06fcaddf",
    "8c90120538ea4dcba0d08f680cce2c26"
  ],
  "path_id": 924,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.07207054538996008,
  "num_matches": 1643,
  "direction_num": 7
},{
  "distance": 11.77,
  "heading": 3.128,
  "instructions": [
    "Turn to the right, and walk down the sidewalk.  Go around the center of it and walk on the grass.  When you're just past the planter, you should stop and wait. ",
    "Walk down the patio stones and passed the circular planter bed. Walk towards potted plants and through the gate towards the next lawn area with a fountain. ",
    "Move towards and around the left side of flowerbed, continuing to move forward until you reach the railing on the right. "
  ],
  "path": [
    "202c0c5fee334297926cca560dfdd9ef",
    "90ca0b4ba53348688017ab8ba661e2c7",
    "59d35dd85e8f4b33954dc51f4d8f0db2",
    "ca9293fce518481282c3bc9bd6230f4c",
    "deade6958e8845448d4594169d435b5c"
  ],
  "path_id": 163,
  "scan": "EDJbREhghzL",
  "source": "R2R",
  "similarity": 0.07136441508919467,
  "num_matches": 2418,
  "direction_num": 10
},{
  "distance": 12.75,
  "heading": 2.896,
  "instructions": [
    "Enter the building and continue straight through the second door. Then veer to the right, passing by the fireplace to your left. Enter the dining room ahead through pocket door opening. ",
    "Walk into the house through the front door and the door just after that until you enter the main part of the house.  Walk to the fireplace with the blue chairs in the 1 o'clock position and onto the carpet to the right in front of the Christmas tree.  Leave the room through the doorway in between the red chair and the yellow chair into the dining room.  Stop behind the first chair at the dining table that you encounter. ",
    "Walk through the front door.  Walk through the door with oval glass.  Walk towards the red sofa.  Go straight across red carpet and into next room.  Wait by table and chairs. "
  ],
  "path": [
    "c2341726267a4f31bff80ac3843462d3",
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 6728,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.045315300610360425,
  "num_matches": 2215,
  "direction_num": 6
},{
  "distance": 8.66,
  "heading": 5.071,
  "instructions": [
    "Go toward the table with the white tablecloth and continue past the first black bench. Take a right and face the doorway. ",
    "Walk past buffet table. Make right at bench. Wait at exit sign. ",
    "Turn right and walk through the living area past the table covered in a white cloth.  Walk towards the long black bench.. Turn right and stand in front of the brown rug. "
  ],
  "path": [
    "f09279e00a4a482a8fa26981999bac00",
    "669fb3436cd44c578b743ab544e25a35",
    "5ec8f0868ac44bbd85851663a777ca9b",
    "dfca24101c684319a572d6f7cc7d16de",
    "7f71bf54a3884deabc7cb90728c7e77d",
    "cb7d4a315dc446459a9bb060475ea9a1"
  ],
  "path_id": 1413,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.06719387749047195,
  "num_matches": 1538,
  "direction_num": 8
},{
  "distance": 7.91,
  "heading": 4.985,
  "instructions": [
    "Exit the bathroom and go to the end of the hall. Turn left and wait in the bedroom next to the stairs. ",
    "Exit the bathroom and the bedroom. Turn right. Take a left and wait in the doorway of the bedroom on the left. ",
    "Leave the bathroom and go down the green hallway. Take a left at the last door on the left. Stop outside of the bedroom door at the top of the stairs. "
  ],
  "path": [
    "69dc547801584e1a9aa129ff36289f52",
    "6249652893364b62b1c30df6c6516a71",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "4531a8cd59c7423e8f938bcd905f7b62"
  ],
  "path_id": 3888,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.0720287958251021,
  "num_matches": 1999,
  "direction_num": 7
},{
  "distance": 9.67,
  "heading": 0.882,
  "instructions": [
    "Exit the bedroom and turn right after leaving. Continue past the room that has the \"Christmas\" sign above it and continue to the door with the \"Office\" sign hanging to the left. Turn ninety degrees to the left and step onto the wooden floor stopping about midway between the carpet behind you and the fireplace in front of you and to the left. ",
    "Exit the bathroom and then the bedroom, walk along the balcony, at the armoire turn left and stop near the blue chair. ",
    "Leave the room and take a right. At the end of the hall take a left. Stop on the left of the first plaid recliner. "
  ],
  "path": [
    "319ddb17492a4fcead1debf39bbafd95",
    "5c10e79b2673419ebf8d0f84582961ab",
    "4650dea829764ab7bb1557f4fcb603f0",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "d101fc142df64f9f8bae9894eb86fb41",
    "12e9fa5962de43698cf9cec57105d287",
    "9766d89c21094c5b872be3a378d4cbad"
  ],
  "path_id": 3779,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09929320211772487,
  "num_matches": 4647,
  "direction_num": 9
},{
  "distance": 11.95,
  "heading": 4.708,
  "instructions": [
    "Walk through the door you are facing. Walk straight across the room and through the doorway straight ahead. Stop once you are inside the large open room. ",
    "With a door opening directly behind you and a door to your right and left, move forward into the room ahead of you. Continue to move forward past the open staircase to your left and pass through the double door opening directly ahead of you into the next room. ",
    "Walk across room with grey carpet and enter room with red carpet. Stop in doorway. "
  ],
  "path": [
    "f60fb82c0b6341e88ac64e0ac7bb0e5e",
    "ffd41f034ca44fe280a59b6a192be618",
    "6d88b250b28f4f28afbcf356f6a33909",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "f5bef118db5b41849ce63cbfcefed938",
    "fadac209cfc04129998323d048a5c908"
  ],
  "path_id": 2991,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.05537800283935294,
  "num_matches": 1962,
  "direction_num": 8
},{
  "distance": 6.14,
  "heading": 3.399,
  "instructions": [
    "With the refrigerator behind you, walk into the room next to the kitchen and stop near the door on the right near the table and chairs with a horse statue on it. ",
    "Turn right and exit the kitchen.  Enter the dining room and stand by the table. ",
    "Go through the archway opposite the silver fridge, go passed the television to the left and step near the circle table and stop. "
  ],
  "path": [
    "33ff25e81c9b4834a37b1bb799c4b26f",
    "2fe0588ff36143689cd41119cd7c785d",
    "a885c9f037fe45cfbf053e98e4e3d205",
    "e58daa54fe36484984da0fc3e209ee39",
    "ac32217f29704340bf467f51b7f15786"
  ],
  "path_id": 6218,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.07496930633384642,
  "num_matches": 1655,
  "direction_num": 3
},{
  "distance": 8.52,
  "heading": 5.569,
  "instructions": [
    "Turn left and go past the light blue chairs then go past the pink chairs. Enter the room using the door on the left and wait near the table and chairs. ",
    "Walk through the den past the Christmas trees and enter the dining room. Wait by the chair. ",
    "Walk through the den past the Christmas trees and enter the dinning room. Wait near the table. "
  ],
  "path": [
    "11d09ac7978b4086b4f343aeb01dedb9",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 5032,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04108898474046323,
  "num_matches": 1680,
  "direction_num": 6
},{
  "distance": 5.34,
  "heading": 4.573,
  "instructions": [
    "Turn towards bathroom door. Exit. Go through doorway. ",
    "Walk forward and go to your left towards the wood door.Go out of the door and into the hallway. In the hallway walk straight into the main reception hall. In the main room stop between the first table and the doorway behind you. ",
    "Walk passed the sink through the entrance of the women's bathroom. Walk down the hall and towards the dining room area. Stop near the open double doors on the left. "
  ],
  "path": [
    "5932ea805ae44802a1d412d5d4ab61af",
    "0c2d645fd3b64fee95d8f447e8efdeaf",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "f72782f4282e476ca82a8d09ad226e01"
  ],
  "path_id": 134,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.07691750551167108,
  "num_matches": 3085,
  "direction_num": 8
},{
  "distance": 12.38,
  "heading": 1.787,
  "instructions": [
    "Turn around and exit the bathroom into the sitting area. Once in the sitting area, turn left and enter the dining room. Once in the dining room turn left and walk alongside the table. At the end, walk straight into the doorway to the kitchen and stop. ",
    "walk out of bathroom towards red chairs, walk in between two red chairs and turn left to walk through doorway, turn left before you reach dining room table and walk straight through doorway, stop before you reach kitchen island. ",
    "Exit the room and walk towards the armchairs.Turn left, and leave the room through the archway towards the dining room. Exit that room and go into the kitchen. Stop in front of the granite counter top. "
  ],
  "path": [
    "69cbdf9fd3b64552b57887b813845cfa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 4656,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04723369996957991,
  "num_matches": 2279,
  "direction_num": 10
},{
  "distance": 8.37,
  "heading": 0.133,
  "instructions": [
    "Walk past the lounge chairs and stop in front of the patio chairs. ",
    "Walk just to the left and go across the front of the sunning beds and wait by the doorway next to the living room/kitchen area. ",
    "Turn to the right and walk by the base of the chairs.  Continue on towards the house.  When you are about 5 feet away from the house, please stop.  Wait. "
  ],
  "path": [
    "6536cc05bf45478aa2aceaa3bc575b61",
    "4848ed4db295441c8722127d3df1c8c1",
    "c75f71faa8b74a8eb875731b3dbe6183",
    "be698bf5eb97439c98ce83c945aba879",
    "7dca42b9f8a04177b4766e6b90a76aef"
  ],
  "path_id": 1855,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.1268061281934371,
  "num_matches": 1830,
  "direction_num": 4
},{
  "distance": 16.6,
  "heading": 0.873,
  "instructions": [
    "Go down the stairs to the level, make a right and go down more stairs, at the bottom level stop. ",
    "Walk towards the stairs and go down the first flight of steps. Turn right and go down the second flight of steps. Stop at the bottom of the stairs. ",
    "Go down the stairs between the two pillars, and go right down the second stair set. Stop at the bottom of the staircases. "
  ],
  "path": [
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 7096,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.033274875524284896,
  "num_matches": 2190,
  "direction_num": 10
},{
  "distance": 11.33,
  "heading": 4.921,
  "instructions": [
    "Walk with the guardrail on your right. Turn left in the doorway next to the elevator. Stop in the doorway. ",
    "Turn right and go down to the end of the hallway. Go through the door to the left of the elevator and stop. ",
    "Walk along balcony with railing on the right, walk towards the elevator.  Turn left beside the fire extinguisher, and stop in the doorway of the bedroom. "
  ],
  "path": [
    "4e900e156c83453495bfdc9348369b9c",
    "5afc855988064b999acb5b3b180e8348",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 6432,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.1106552293618113,
  "num_matches": 5088,
  "direction_num": 8
},{
  "distance": 6.4,
  "heading": 2.86,
  "instructions": [
    "Stand so that the closest door is behind you and walk straight.  Walk past the pool and shrubbery and stop just before entering the doorway on the opposite side from where you started. ",
    "walk forward then stop at the door. ",
    "Walk across the yard and wait in front of the doorway with the flower tapestry. "
  ],
  "path": [
    "d2a62238e6a8472381a0111b06f35f72",
    "fa1f71b06e894ff6a4e2173012ac7a3b",
    "a3dfeebf01d24ad19c009d3527fcb6cc",
    "b893c0ba92f64e9e88698fc4225fad6a",
    "c4c0d2047c27477aa1fbddd567a6ee4a",
    "49e6c905a81c486baa8fec5e6e436ca9",
    "6b0783db762e4593ab5ff5fa7caf57ce"
  ],
  "path_id": 5171,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.033063583535207816,
  "num_matches": 1503,
  "direction_num": 3
},{
  "distance": 8.38,
  "heading": 5.657,
  "instructions": [
    "Walk clockwise along the long table with the bookshelves to your left.  Stop behind the last chair at the other end of the room. ",
    "Walk down the left side of the table. Stop next to the last chair on the left of the table. ",
    "Move down the lefthand side of the very large table, and stop just before you reach the end of the table."
  ],
  "path": [
    "4c793e5198034f3eb52a199745373fb8",
    "d5c6ca3ad0204601b6c9c0280a0e144e",
    "3ad040847d7c48788baf889755ecf33c",
    "e42a8231f4364b629cecd35d58c43635",
    "ceed635a9b804a13a8db5fd5cd755281",
    "4610dfb32d044ad793cf8640a7ede0f4"
  ],
  "path_id": 5475,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.025558732790735516,
  "num_matches": 1623,
  "direction_num": 6
},{
  "distance": 6.89,
  "heading": 4.758,
  "instructions": [
    "Travel up the stairs, turn right and wait in the doorway near the potted plant. ",
    "Go upstairs and wait in the loft area next to the bedrooms. ",
    "Climb the stairs next to you all the way to the top. Then turn right and wait at the entrance to the first room. "
  ],
  "path": [
    "0896e14268a54c1faa6a5648eb8eb63b",
    "959878d8792948b5888684622f4eca36",
    "9ddd0d8326b44a038d3985d96ffbb2a1",
    "0836acc78091475dbba186b98e05792a",
    "ab0f99b210bb4556b7fc18190126480b",
    "85849923dc9e46eda0168f62c0fb43f3",
    "7e23cbe5e28047d49ab4641f530c9f00"
  ],
  "path_id": 3780,
  "scan": "29hnd4uzFmX",
  "source": "R2R",
  "similarity": 0.09423847930082373,
  "num_matches": 1556,
  "direction_num": 2
},{
  "distance": 7.71,
  "heading": 5.133,
  "instructions": [
    "Walk along porch towards the front of the house.  Enter the first door on the left.  Pass the Christmas trees and walk into room ahead with white door.  Wait in hallway next to red carpet. ",
    "Enter the building and walk down the hallway. Stop in the hallway, near the stairs. ",
    "Walk across the porch and left into the house. Walk through the doorway straight ahead and stop. "
  ],
  "path": [
    "a0bdcd8aaee84758b909335ef15eef7b",
    "c3cef9dfbba149ecbf67c4375b52a733",
    "a515a42b3cfa4005affc8b3f14d8ca2d",
    "e5c88ad5db1a4b3a977455b0c161d792",
    "de655166da274d40841f1e5e488ab641",
    "38ad5b94f1f64668a5c2040a541e5ae9"
  ],
  "path_id": 5320,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05938361561139136,
  "num_matches": 1748,
  "direction_num": 5
},{
  "distance": 11.69,
  "heading": 1.291,
  "instructions": [
    "Face the table and chairs, turn left, and walk down the walkway.  Stop at the last urn on the brick walkway. ",
    "Walk along the deck. Stop in front of the second window past the doors. ",
    "Go along the outside walkway past the plants on either side.  Stop at the last set of plants before the awning. "
  ],
  "path": [
    "ca9b27594a42478194e66ccf076fd73a",
    "4e30f38a55414abb9f740d60ad40df7c",
    "8e5ee1e7e6784eed89a6c8579b4fd88b",
    "2ed5407274614845a0c2c8f106b861c0",
    "58a6801fbf32464a8d6fc34db3bc991e",
    "86028d7e79e14e0790334948dc507179"
  ],
  "path_id": 2054,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.043622072625512605,
  "num_matches": 1628,
  "direction_num": 4
},{
  "distance": 12.58,
  "heading": 0.006,
  "instructions": [
    "Move forward, turn left, walk forward through the doorway, turn left and wait near the table. ",
    "Turn around and go to the left of the entry. Follow the hallway and turn left, stopping in front of the table. ",
    "Walk to the base of the two staircases and through the columns.  Turn left on the red carpet and keep walking until you get to the red ropes.  Go past the ropes and stop just before getting to the table with the big chandelier over it and then stop. "
  ],
  "path": [
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "a68b5ae6571e4a66a4727573b88227e4",
    "79878e3ae5364a658d3f7a0a683c3505",
    "ba47cad0e7e748c390f8e7d1e94ccbb4"
  ],
  "path_id": 6937,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05136586080743578,
  "num_matches": 2472,
  "direction_num": 8
},{
  "distance": 11.33,
  "heading": 6.135,
  "instructions": [
    "Turn around and go down the second doorway on the right. Continue down the hall and stop in front of the table. ",
    "Exit the room with the staircase and walk across the room. In front of the door, turn right and into the hallway.Stop near the chairs. ",
    "head near the entrance door then turn right. turn left, then stop at the left side of the table. "
  ],
  "path": [
    "3f75b2d4af4d4afd85666d4c1302008c",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "154cbcc9b744473780da78d787e1ad34",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "259fd84d195d4d9bac4e14bdf953521d"
  ],
  "path_id": 6490,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.044968990148981605,
  "num_matches": 1671,
  "direction_num": 7
},{
  "distance": 12.93,
  "heading": 0.133,
  "instructions": [
    "Walk along the patio passing the chairs. Go straight, and enter the living room. Stop between the couch, and the coffee table on the right. ",
    "Walk past the pool and hot tub, continuing forward past the lounge chairs. Enter the house and wait near the sofa. ",
    "Walk past the recliners and straight ahead into the building. Stop by the couch. "
  ],
  "path": [
    "6536cc05bf45478aa2aceaa3bc575b61",
    "4848ed4db295441c8722127d3df1c8c1",
    "c75f71faa8b74a8eb875731b3dbe6183",
    "be698bf5eb97439c98ce83c945aba879",
    "7dca42b9f8a04177b4766e6b90a76aef",
    "6b5e5f6e0e77495eb9333b0a741116f9"
  ],
  "path_id": 3909,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.11340646304740228,
  "num_matches": 1976,
  "direction_num": 7
},{
  "distance": 14.92,
  "heading": 1.401,
  "instructions": [
    "Move slightly to the right around the table. Walk forward. Walk forward. Walk slightly to the left around the table and walk forward. ",
    "Walk past all the round tables and stop to the left of the last one. ",
    "Walk to the end of the patio, towards the gazebo and wait by the last table. "
  ],
  "path": [
    "7601d3e4875e4985aa22aa0ac1605578",
    "00187e6e9d5c41608a232fadb522677e",
    "84bd5fd3ffa04bc8a7810851a04ad9be",
    "f0ab74c8a4a44abfba942f946364510c",
    "bf454a84e687425db55a946493d2ba72",
    "d5183baffb764292a1ce414243f30ef6",
    "684c5856cff5465a8ab3c35b6ffa355c"
  ],
  "path_id": 2901,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.048233504057706975,
  "num_matches": 1549,
  "direction_num": 8
},{
  "distance": 9.85,
  "heading": 3.11,
  "instructions": [
    "Exit the bathroom, walk past the fireplace and through the door. Wait inside the bathroom. ",
    "Exit the bathroom and go towards the left.  Go through the pocket doors and enter the bedroom. Turn to the left sharply and stand in the entrance to the bathroom . ",
    "Leave the bathroom, and go left. Leave the sitting room, and enter the bedroom. Go into the bathroom in this bedroom. Stop in front of the sink. "
  ],
  "path": [
    "03a24b8a20e44c4897ad0c0ae672363f",
    "c533d0a4d31442048cedb9a05c762ac9",
    "61e6284b6ef541e59a87efa918514255",
    "b3ea270a560d4fc784e7c7d4ca0e2248",
    "5bc65c559e2c4edc92ac6e9832d28ab1",
    "0a447b165b724cc8a73b00aafb9f8997",
    "f8190b68f53e40268771352a91bab873"
  ],
  "path_id": 4042,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06396371569585439,
  "num_matches": 1707,
  "direction_num": 5
},{
  "distance": 6.8,
  "heading": 5.686,
  "instructions": [
    "Go down the stairs. Stop once you reach the level and stand at the bottom of the stairs. ",
    "Go down the stairs then stop. ",
    "Go all the way down the stairs then wait. "
  ],
  "path": [
    "b3b697d0fd2d41f29a861e8411c732bd",
    "85849923dc9e46eda0168f62c0fb43f3",
    "ab0f99b210bb4556b7fc18190126480b",
    "0836acc78091475dbba186b98e05792a",
    "9ddd0d8326b44a038d3985d96ffbb2a1",
    "959878d8792948b5888684622f4eca36",
    "0896e14268a54c1faa6a5648eb8eb63b"
  ],
  "path_id": 3370,
  "scan": "29hnd4uzFmX",
  "source": "R2R",
  "similarity": 0.09890122005928122,
  "num_matches": 1624,
  "direction_num": 3
},{
  "distance": 11.57,
  "heading": 1.952,
  "instructions": [
    "Go through the door into a hall down a red carpet.  When you get to another doorway with a striped chair and mirror on either side, stop. ",
    "Go on floor runner and turn left. Go through the entrance way and wait by the striped chair. ",
    "Turn left out of the doorway and follow the red carpet runner through the hallway. Enter the next room and walk until just past the stairs and stop. "
  ],
  "path": [
    "9c288661e4934fb49e4e861cf2b51c57",
    "79878e3ae5364a658d3f7a0a683c3505",
    "a68b5ae6571e4a66a4727573b88227e4",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "56cf724d00bd469c8c4b80ad9ffa68dd"
  ],
  "path_id": 3278,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04004106882699974,
  "num_matches": 1550,
  "direction_num": 4
},{
  "distance": 8.17,
  "heading": 0.288,
  "instructions": [
    "Walk past the pool and wait in the corner next to the door. ",
    "Walk to the left of the pool. Walk past the glass door and stop by the plant. ",
    "Go to the left of the pool and walk towards the double glass doors straight ahead.  Stop next to the wall with the triangle and circle openings. "
  ],
  "path": [
    "8c77db8279a84ad382a298afaa6d6adf",
    "1157d0f379f04c5ba4ad1b40bdd32e64",
    "d7fd6e3ab372450b8f38600aea06b680",
    "4838fa0d949e4cd3905f5e1ba665c59b",
    "626241dbd7334a45868a1092a3e195af",
    "f51ad0a5eae14774abac510880e1f364"
  ],
  "path_id": 7024,
  "scan": "82sE5b5pLXE",
  "source": "R2R",
  "similarity": 0.07520010507744883,
  "num_matches": 1831,
  "direction_num": 6
},{
  "distance": 7.86,
  "heading": 0.089,
  "instructions": [
    "Walk through the entryway, and go into the hallway straight ahead. Enter the bedroom through the door on the left. Stop in the doorway. ",
    "Walk past the fireplace and past the stairs.  Go into the second room to the left of the fire extinguisher and stop after stepping in the room. ",
    "Turn left and walk past the stairs. Once you pass the stairs enter the door on the left in front of you and stop. The door should say frontier above it. "
  ],
  "path": [
    "9766d89c21094c5b872be3a378d4cbad",
    "0e8e2c9d09974dab977c1d3868286f12",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 5549,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10661077772835278,
  "num_matches": 3270,
  "direction_num": 8
},{
  "distance": 7.16,
  "heading": 1.916,
  "instructions": [
    "Go straight until you get to an exit sign then turn right and go into the room. Turn left and go out the balcony. Wait there. ",
    "Go down the hallway away from the wooden posts, turn right into the wooden doorway archway, step into the bedroom, then turn left and step into the glass doorway to the outside and stop. ",
    "Walk down the hall towards the door with the \"exit\" sign over it.  Turn right into the bedroom.  At the foot of the bed turn left and go to the deck.  Stop in the doorway of the deck and the bedroom. "
  ],
  "path": [
    "d3038501401941f8afe4e9e2df5eda73",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "eeb46aee1c014c8b99009457a45838e6",
    "7c10509acee1485ebbaf50f1effb907e",
    "c94a99a685884c29b5f4857fb70298e0",
    "2effe4b38a0e4a6f87aeecd1a10f12c6"
  ],
  "path_id": 3970,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08455181283999823,
  "num_matches": 2165,
  "direction_num": 10
},{
  "distance": 13.35,
  "heading": 0.803,
  "instructions": [
    "Go left to go into the room with crowd control ropes. Walk to the top of the staircase. ",
    "Exit the room into the room on the left, turn right and then left and go to the top of the stairs and stop. ",
    "Exit the room through the doors to the left of the fireplace. Wait at the top of the stairs. "
  ],
  "path": [
    "30ed651265324e9d827338bb558b97c6",
    "3517198fc6744a2eab89d685f8cb93da",
    "7a3f8f06712a413b9d9b422a448b20bd",
    "e2f7333559be465d94798c1940b2e582",
    "248492258fd5435c8276f59f63ddf0ef",
    "dd6b2993f882400ab51f9e8c38148b7a"
  ],
  "path_id": 3747,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.025633667832047822,
  "num_matches": 1615,
  "direction_num": 5
},{
  "distance": 6.44,
  "heading": 2.765,
  "instructions": [
    "Turn slightly right and enter the doorway. Turn right and exit the room via the farthest doorway to you left. Stay there. ",
    "Go up the steps to the chest of drawers. Turn right and go to the doorway to the left of the sink. ",
    "Turn to face the doorway to the right.\r\nWalk straight.\r\nGo up one step and pass throught the doorway.\r\nTurn to the right.\r\nWalk to the door.\r\nStop in the doorway. "
  ],
  "path": [
    "97db9c9bd9824a3ca623db620331ea66",
    "3fd2f1d849de4e9f8c07863c845db6b5",
    "a8cb8984630b456a96923ef0d7c3aeb3",
    "fdf0fc24f7c549ccbb78e972c8024fa9",
    "138252ad9fab4ae1a86997fc363e6ac7"
  ],
  "path_id": 1937,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.08764049945484106,
  "num_matches": 6539,
  "direction_num": 8
},{
  "distance": 8.03,
  "heading": 1.383,
  "instructions": [
    "Go straight into the kitchen and then turn left. Go straight until you get to the round table with chairs that has a horse statue on it and wait there. ",
    "Walk into the kitchen. Make a left in front of the island. Walk past the area rug on the floor. Wait at the dining table. ",
    "Turn left and enter the kitchen. When you reach the island, turn left. Walk towards the kitchen table. Stop to the right of the table just before you reach the wood door. "
  ],
  "path": [
    "7025038ba12d4a63a40c866489226fbe",
    "f4032225a0c6462ba02f728d031c2638",
    "e3eeb7b8deed4a2fa0000daec3538b75",
    "a885c9f037fe45cfbf053e98e4e3d205",
    "e58daa54fe36484984da0fc3e209ee39",
    "ac32217f29704340bf467f51b7f15786"
  ],
  "path_id": 2598,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.08192663137468503,
  "num_matches": 2108,
  "direction_num": 9
},{
  "distance": 9.66,
  "heading": 5.887,
  "instructions": [
    "Turn around to where there is a handicapped bathroom to your left. Head down the floral carpet. Continue down the carpet until you get to a door with an exit sign about it. Go through that door in front of you. Once you go through the doorway you will be outside and you are at your destination. ",
    "Go down hallway towards EXIT sign. Exit room through doorway and wait. ",
    "Make a left down at the narrow hall beside the office and walk straight to the exit door. Go out the door and wait. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "a5f4a041a13145a09a4c6603e966b83e"
  ],
  "path_id": 1135,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0707231703063629,
  "num_matches": 3179,
  "direction_num": 8
},{
  "distance": 10.28,
  "heading": 4.486,
  "instructions": [
    "Walk down the balcony and enter the house through the green door. walk down the hall and enter the bedroom through the second door on the right. Stop next to the door in the bedroom. ",
    "Walk to the end of the patio and enter the door on your right. Walk to the second room on the right. Walk into the bedroom. ",
    "Go through the green door to the left of the bedroom. Go past the door on the right and the picture on the wall. Enter the bedroom with the quilted blanket. "
  ],
  "path": [
    "c9e0bc6b556b440284042049c1f7a3e7",
    "a5f4a041a13145a09a4c6603e966b83e",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "ae97478ce1c84d5588244906fe089558",
    "7f39d79ddfec4b6e9c98e51576d59ab1"
  ],
  "path_id": 1673,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.087214666891262,
  "num_matches": 4187,
  "direction_num": 8
},{
  "distance": 10.21,
  "heading": 1.07,
  "instructions": [
    "Walk through the open double entry doors to the home. Turn left and walk through the first arched door with an statue bust near the doorway. Walk into the hallway. ",
    "Enter the building, take the first left and stop in the first doorway. ",
    "Turn right and enter the building. Turn left and enter the closest and leftmost doorway. Wait there. "
  ],
  "path": [
    "062df9954974450a9eb914da2727062d",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "9cc6191a6e1642f984e54b1a79b83761",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656"
  ],
  "path_id": 1266,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.05204009445746125,
  "num_matches": 1742,
  "direction_num": 5
},{
  "distance": 11.01,
  "heading": 3.795,
  "instructions": [
    "Walk through the kitchen past the bar stools.  When you get to the dining table, walk toward the long white couch.  Stop in front of the dark pillows on the end closest to you. ",
    "Orient yourself so when you go forward, you'll pass by with the kitchen island on your right, then move forward towards the fireplace in the distance. Once you move onto the carpet, stop and move slightly left to get even with the corner of the table. ",
    "Go left and walk straight passed the bar and into the living room. Walk to the corner of the long white couch on your left and stop. "
  ],
  "path": [
    "415d5d09a188445993f2a8b451d48e91",
    "df0ddfb1212245bbbf95a6c94ed19b6c",
    "a56b95f00285452db9a95545aed7b5b7",
    "a39174aaa3fc4dff9b37f30cc03ab21b",
    "b8ec757801244836bf17dcb1622c3022",
    "2063eaa6e4b64fb5bca5cf30886f30cd",
    "dfa0373deb9d4e5db88b76c95dc0d6a9"
  ],
  "path_id": 7226,
  "scan": "sKLMLpTHeUy",
  "source": "R2R",
  "similarity": 0.08498416334630375,
  "num_matches": 1690,
  "direction_num": 9
},{
  "distance": 6.54,
  "heading": 2.975,
  "instructions": [
    "Walk through the doorway, turn left and stop in front of the marble counter. ",
    "Walk through the doorway and walk across to the dining room. Enter through the doorway to the kitchen and wait there. ",
    "Exit the door and turn left. Pass the dining table and enter the door leading to the kitchen. Stand in front of the very first counter and stop there. "
  ],
  "path": [
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 2762,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04991957952133689,
  "num_matches": 1671,
  "direction_num": 2
},{
  "distance": 11.38,
  "heading": 4.918,
  "instructions": [
    "Walk straight down the carpeted hallway.  Stay right, until you reach a hardwood floor. Walk next to the green leather chair.  Wait here. ",
    "Walk down the hall and to the right and stop in front of the chair. ",
    "Turn right and go down the long hallway. Go right at the end of the hallway and stop by the first black chair. "
  ],
  "path": [
    "a3c3ba2217b84f62ac4d891d0d029bdb",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "a0aeade23ab74a5f93544047c19718e8",
    "61fbdce455e0426db9e95c4d86e8e028"
  ],
  "path_id": 6747,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08222610140010106,
  "num_matches": 2617,
  "direction_num": 8
},{
  "distance": 5.96,
  "heading": 2.596,
  "instructions": [
    "Walk past the bookshelves and turn left. Turn left and stop in front of the chair. ",
    "Walk towards the bookshelft to your right, and walk all the way around it...Taking two lefts. Stop in front of the chair thats next to the window. ",
    "Go straight around this path of bookshelves, making two hard lefts and stopping at the large shelf in between two windows. "
  ],
  "path": [
    "128f2cd37ef241cea64bc179a8be82ae",
    "6c47cd8bd2664281bec3740c473946f8",
    "dc3170aacd3f40f2ac2f5b726bd75b88",
    "43f8894f1a9446599a6c89732aa3f2dc",
    "7b19d99c586f456c8095502d78d0f6f8",
    "1818ffc4d0eb47cfa726a12d3cfefee3",
    "1cf9bfa7442841e9b5edc64590d0e879"
  ],
  "path_id": 7093,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04171422085060699,
  "num_matches": 2194,
  "direction_num": 8
},{
  "distance": 11.46,
  "heading": 1.757,
  "instructions": [
    "Walk down the hallway toward the office, go to the front door, wait at the top of the stairs to the left of the front door. ",
    "Leave the bedroom and go down the hallway to the right. take a right and go towards teh bear and go down the first two stairs and stop. ",
    "Go down the hall along the railing, to the left of the door and past the back door and stand at the top of the stairs. "
  ],
  "path": [
    "4693d9db2430418ab6e73e48a1969140",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "d101fc142df64f9f8bae9894eb86fb41",
    "12e9fa5962de43698cf9cec57105d287",
    "a1b101eeb3804e828253cc562cec8615",
    "4c477b124d744b75b561bab5d612bfd8",
    "7f83a9b5299744cc8bc32be5d94108c0"
  ],
  "path_id": 958,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05650839125367362,
  "num_matches": 2869,
  "direction_num": 10
},{
  "distance": 11.19,
  "heading": 0.024,
  "instructions": [
    "Exit the sitting area through the second set of doors on the right. Walk down the hall and wait in the room to the left, next to the wardrobe. ",
    "Walk around the two chairs to the right and step over the rope barrier. Walk down the hallway to the right and wait in the sitting room near the round table. ",
    "Enter the right room next to the fire extinguisher and stop at the stanchions. "
  ],
  "path": [
    "adcc15e35b9441139036aeefda56e0a4",
    "248492258fd5435c8276f59f63ddf0ef",
    "c55fa077761c4154af4b26da88eee80d",
    "744eba592017466eab0da528e0cfdf7c",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "cd680b57443748fcae2de7c8e39970ad",
    "4307032328c04a388a3e6ae2897aa44a"
  ],
  "path_id": 1756,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038480728603187915,
  "num_matches": 2126,
  "direction_num": 7
},{
  "distance": 11.62,
  "heading": 2.575,
  "instructions": [
    "Head straight through the doorway into the area with the large table. Enter the first arched pathway on the left into the study/library and stop. ",
    "Walk away from the bed through the door across the hall. Walk between the round and rectangle tables. Move through the first arch to the left of the doorway. Stop before you step on the rug. ",
    "Walk straight through the door and then make a slight left and continue until you're in the room filled with books. "
  ],
  "path": [
    "c1a600332bb245b19d8174c0790d6fd6",
    "9c36a2928f3d436181736d628dd0a694",
    "59163d8ecd3a41038c79bad8d0b51d7e",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "a5f4055ab7134ffcbbe8b33150552301",
    "af9ff2224e1d4b7babae5c082ebba917",
    "b1265fece0604be79853a0ce270d7c45"
  ],
  "path_id": 7116,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.09232319259845988,
  "num_matches": 1811,
  "direction_num": 5
},{
  "distance": 6.91,
  "heading": 4.635,
  "instructions": [
    "Walk through the doors and past the bed. Stop right before the black stairs. ",
    "Turn around and go inside. Walk past the bed and couch. Stop at the bottom of the stairs. ",
    "Go through the open door on the right. Keep walking straight then stop at the steps. "
  ],
  "path": [
    "cf1e2fed4ab24fe4818c1a92c8567786",
    "234597e72c5f4c79a88e94ccc7979b4a",
    "e0dc27df8b2d4484bde0f97284d4cdf7",
    "285b697fed754f86a09602c93628cfb4",
    "4fe4474e9bf9429ea92d202bdea4dce5",
    "f923d8ec1f32400c864837ba572fe199"
  ],
  "path_id": 6458,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09960212200355363,
  "num_matches": 1867,
  "direction_num": 5
},{
  "distance": 9.44,
  "heading": 4.845,
  "instructions": [
    "Exit the bedroom and turn left Follow the corridor and stop before reaching the fireplace. Wait there. ",
    "Turn approximately 90 degrees to the right. Move forward. Turn slightly to the right. Wait at the edge of the carpeted walk way. ",
    "Turn around and walk down the hallway to the left. Stop at the end of the hallway when you reach the wood floor. "
  ],
  "path": [
    "eeb46aee1c014c8b99009457a45838e6",
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "a0aeade23ab74a5f93544047c19718e8"
  ],
  "path_id": 4232,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08973444317291641,
  "num_matches": 2374,
  "direction_num": 6
},{
  "distance": 17.09,
  "heading": 3.854,
  "instructions": [
    "Walk through the two columns. Walked forward towards the roped off area. Stop in front of the table with the two large candlesticks. ",
    "Walk between the two columns. Walk past the altar on the right. Wait at the wall mural of Daniel on the right. ",
    "Walk down the aisle and wait near the altar. "
  ],
  "path": [
    "97e40a397edf4dfbae3894c998508284",
    "3e18ef6d21744a9f884a6b148c0d63ac",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "91b89c02a03d48c891bee19a49350f8c",
    "67e8a588a25d4a808d523bc54bec8483",
    "4f54063fb8464b8ca7e08147f2a4ec3e",
    "9ef6399314c94a93abeec2d6054f4658"
  ],
  "path_id": 5344,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07968460844166189,
  "num_matches": 7884,
  "direction_num": 6
},{
  "distance": 5.65,
  "heading": 5.356,
  "instructions": [
    "Walk straight and then after you exit the room turn left and use the door to go outside. Wait there. ",
    "Go straight through the way passed the outside doors leading to the hot-tub on the left, turn left into the archway on the right, take a step through and stop. ",
    "Walk past the fancy vessel sink and enter the bedroom.  Stand just outside the front door of the bedroom. "
  ],
  "path": [
    "bed1e142845343c5b9695eabad5d170e",
    "5ee3f3c0dac54a1893594c1fde6a427a",
    "88fda52a9c9e4a5cb1774e741ecce8f6",
    "ca77dd4132f044b7b6b999d3795d09d3",
    "9a896fadb819490089bf51005088f464",
    "6b0783db762e4593ab5ff5fa7caf57ce"
  ],
  "path_id": 5282,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.08635073194754372,
  "num_matches": 1512,
  "direction_num": 7
},{
  "distance": 8.09,
  "heading": 1.193,
  "instructions": [
    "Turn right. Walk past couch through doorway. Walk down stairs into kitchen and stop. ",
    "Walk away from the table tennis table. Go down the stairs through the doorway on the right and  stop at the bottom of the stairs. ",
    "Walk across main office to doorway on the right. Walk down the stairs and stop at bottom. "
  ],
  "path": [
    "60e9c84ab617491594f5c2950cc6f3ee",
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562",
    "8ae0426af8824849ba75a6147325c30c"
  ],
  "path_id": 1898,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.08654349877082222,
  "num_matches": 2117,
  "direction_num": 7
},{
  "distance": 12.78,
  "heading": 3.272,
  "instructions": [
    "Facing the fireplace, exit the room via the opening on the wall to your left and ahead of you.Continue down the hallway to your right and exit the building through the door straight ahead of you. ",
    "Go to the left onto the carpeted area.  Continue down the carpeting, with the railing on your right, all the way to the end where there is a door.  Go through the door, stopping just after you exit the building. ",
    "Turn left and then turn right and go down the hallway. Exit the house using the door with the Exit sign on top of the door. Wait there in the porch. "
  ],
  "path": [
    "a1b101eeb3804e828253cc562cec8615",
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "2de02abf8e2e4c99b62d6f2224ed8aa6",
    "d7fe7622c7fd4d87820e180e6a095e33",
    "a5f4a041a13145a09a4c6603e966b83e"
  ],
  "path_id": 4758,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06220623414587305,
  "num_matches": 3255,
  "direction_num": 10
},{
  "distance": 13.13,
  "heading": 5.828,
  "instructions": [
    "Turn 180 degrees and walk up and away from the staircase. Turn toward the fireplace on the right and walk through the doorway to the left of the fireplace. Walk down the hallway. Turn left into the first doorway on the left side of the hallway. Walk into the doorway. Wait by the lamp. ",
    "Go up the stairs turn right and go into the hallway on the left of the fireplace. Turn left into the room and wait near the bed. ",
    "Continue up the stairs, take the left hallway into the bedroom. Stop and wait near the nightstand. "
  ],
  "path": [
    "d4b19206bd8b4771b11a4dbda6cb9bff",
    "28e6276f6b1a44aab5c15e875a4c3a5e",
    "9af627d79c5a44539e3e58a58ab6f534",
    "7deb7519052e480a933602dc9e37bd2d",
    "1b6ad918388b4528bf0b511db7fd6279",
    "d5693cccdffa464d92381eff5fdb96a7",
    "ffcdf5557c684ebf81f6ab3dcef17325"
  ],
  "path_id": 5222,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06377042934875211,
  "num_matches": 2928,
  "direction_num": 9
},{
  "distance": 16.48,
  "heading": 0.081,
  "instructions": [
    "Go across the room with the banquet table and wait in the doorway, that is facing another large room. ",
    "Wait at the last doorway on the right. ",
    "Go straight and pass all the chairs then turn right and wait by the door that is farthest to the left. "
  ],
  "path": [
    "966a5fa6c049457c8ddafb05f6063443",
    "2335251f91a843c3ae05e1fec482438a",
    "ec1fb8a79e2f4a46a7e758dd00834caf",
    "852a2ee396184da494b42dea29a8b467",
    "53608606748f45c5a69723f062f1baa3",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 2591,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.056925154719756316,
  "num_matches": 1901,
  "direction_num": 4
},{
  "distance": 11.41,
  "heading": 4.81,
  "instructions": [
    "Turn around and walk across the long black rug. At the other side, exit out the door to your left. Walk outside and stop to the left of the blue chairs facing the outdoors. ",
    "Walk into the TV room. Exit onto the balcony. Stop next to the first gray armchair. ",
    "Walk past the movie posters, through the theater room and wait outside on the balcony. "
  ],
  "path": [
    "8316e9313299447bb1f574aaf8cbec73",
    "1a9b8e0293ba40dcbd23d31757203903",
    "7168e3659bcc40de8bfde578bb1fbeb3",
    "ddbcae25c7b84d26808cf0efac5e10de",
    "055056e12afe42578c6f429bc07159d2",
    "948f0480392442e5ab57af15142ec623",
    "2e45e672ce644ca58fc3a28e926e8987"
  ],
  "path_id": 3869,
  "scan": "b8cTxDM8gDG",
  "source": "R2R",
  "similarity": 0.060825389290549106,
  "num_matches": 1584,
  "direction_num": 3
},{
  "distance": 12.39,
  "heading": 3.082,
  "instructions": [
    "Walk toward the leather chair and turn right. Walk into the kitchen and turn left. Walk past the refrigerator and turn right and stop. ",
    "When you are in the hall in front of the front door make a slight right, and go into the living room. Once you are in the living room make another slight right and go to the kitchen. Now to the refrigerator and walk out of the kitchen, make a right and wait. ",
    "Go ahead into the living room and kitchen area. Go through the kitchen and take the first right past the fridge, stopping in the hallway. "
  ],
  "path": [
    "b6018ae2d13248f7a12edbf31f70b04d",
    "01b439d39a8f412fa1837be7afb45254",
    "f032c9ee981a4462914468785f0a4abe",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "ca75317572dc44509427cf7b2caecda6"
  ],
  "path_id": 6689,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.048552090589845845,
  "num_matches": 1603,
  "direction_num": 9
},{
  "distance": 12.13,
  "heading": 3.099,
  "instructions": [
    "Turn right in front of the fireplace. Walk around the roped off chairs. Stop in front of the stairway. ",
    "Turn around and walk towards the fireplace. Once you reach the fireplace, turn right and exit the room. Once out turn left and walk to the top of the stairs and stop. ",
    "Walk through the doorway next to the black wardrobe. Follow the path when it turns left. Then turn right where the path does. Then stop at the top of the stairs on the left. "
  ],
  "path": [
    "c03d15601e3d49d2875de7dd3776e237",
    "4f505ab96ae5409782db6ae4fe9fc724",
    "8113cb01c8d944a1af5f2dfc7f008b0c",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a"
  ],
  "path_id": 5760,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.036943540507252154,
  "num_matches": 2590,
  "direction_num": 7
},{
  "distance": 5.81,
  "heading": 0.964,
  "instructions": [
    "Go all the way down the stairs. Wait at the bottom of the stairs. ",
    "Walk down the stairs and wait at the bottom. ",
    "Turn to the right until you are looking down the stairs.  Walk down the stairs until you reach the bottom of the staircase.  Now, walk towards the painting that is in front of you.  Stop when you are standing directly in front of the painting. "
  ],
  "path": [
    "a62b78b98e414ae38ff01d404942ea6c",
    "6c776704f4dd44f985b0bf2d441dfb92",
    "e31bd661d403497ea15d4398dd336795",
    "df71c020d73c4eacb3e06d46cf1c3815",
    "6b24c7c2fd9e4849b75eedd5298958d7",
    "565aa4a845ba446481601ca648d03807",
    "c798bb077d24453292903021021e1c23"
  ],
  "path_id": 4011,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.13357885938186456,
  "num_matches": 1901,
  "direction_num": 6
},{
  "distance": 8.2,
  "heading": 3.172,
  "instructions": [
    "Go out the bathroom door Go out the bedroom via the door on the right. Go straight through the door directly ahead to the next room. Stop at the couch. ",
    "Leave the bathroom and go out of the bedroom and walk across to the bedroom across the hall. In the room stop next to the couch across from the bed. ",
    "Turn right. Walk towards bed. Turn right, walk out door. Walk through two doorways. Stop in front of couch on the left. "
  ],
  "path": [
    "c20f8e6497d14696b2cecf24ed288470",
    "4f1ecaca2cc744b0beb75e146bc8ecc7",
    "62994d72dab246fbb839f3699b9cacd6",
    "aaa8773c86214e9990d4c3ede3223499",
    "223b4ced68cd4688b6612a2795409490",
    "1c7bbe372fcf48beb113ee844b3ae43f",
    "3772d953cd264ebb9ff730bde0bf842c"
  ],
  "path_id": 1640,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.0528403923780554,
  "num_matches": 1853,
  "direction_num": 6
},{
  "distance": 14.52,
  "heading": 2.319,
  "instructions": [
    "Turn right and walk around the table, then walk through the sitting area and enter the foyer. Stop on the landing near the bottom of the stairs. ",
    "Turn around and walk past the long table. Turn right and exit the room. Cross through the sitting area straight ahead. Once out of the sitting area. Walk to the bottom on the stairs to your left and stop. ",
    "Go along the table, make a right passed the table, go through the archway, then go through another bigger archway, take a few steps up the stairs and then stop. "
  ],
  "path": [
    "019eb9153bc6402fb99b1dcfa8bcf303",
    "29a1f267ef234fc6ac2e2554351c2620",
    "d3a672591d4246c598abf0c6d585e178",
    "150763c717894adc8ccbbbe640fa67ef",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f"
  ],
  "path_id": 2229,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.025697810892209134,
  "num_matches": 1616,
  "direction_num": 6
},{
  "distance": 14.24,
  "heading": 2.239,
  "instructions": [
    "Walk towards the stair case, and continue walking till you reach the doorway directly left the vase with the flowers on it. Stop right under the doorway. ",
    "Go straight toward the stairs then turn right. After you pass the stairs turn sharp left. Turn right and go into the double doors. Wait at the entrance. ",
    "Head towards the staircase and turn right. Go past the stairs.  Stop at the archway by the vase. "
  ],
  "path": [
    "60399cb6fd9d42a7a364f155fd152361",
    "d193970cbeac4faeae3b9bfee5c35125",
    "6c160b1ba8564c09ab8491590266f7f1",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 6142,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.061828949443838106,
  "num_matches": 2250,
  "direction_num": 10
},{
  "distance": 8.87,
  "heading": 1.713,
  "instructions": [
    "Go through the doorway next to the couch. Go down the stairs and walk behind the easel. ",
    "Walk past the loveseat and go down he stairs. Take a right and stop next to the unicycle in the corner. ",
    "Walk straight towards the doorway nearest the sofa.\r\nGo down the five steps.\r\nTurn 45 degrees to the right.\r\nWalk in front of the easle.\r\nTurn right after the easle.\r\nWalk forward.\r\nStop at the wall. "
  ],
  "path": [
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562",
    "8ae0426af8824849ba75a6147325c30c",
    "6e31c6927a6948a7a32918d626028b8d"
  ],
  "path_id": 1544,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07956158319757538,
  "num_matches": 1880,
  "direction_num": 10
},{
  "distance": 15.68,
  "heading": 3.674,
  "instructions": [
    "Walk [ast the fireplace in the living room.  and turn right and go down the hallway.  When you get to the marble stairs, go up them.  Turn to the right and go up 2 stairs on the red carpet.  Then wait. ",
    "Walk to the hall then turn left, at the end of the hall turn right. Walk to the stairs then stop. ",
    "Go past the fire place and the coffee table through the doors and down the hallway, up the marble stairs and stop on the first stair of the wooden staircase with the red stair runner. "
  ],
  "path": [
    "35299a16cf1e447da4c15c443929c27a",
    "ba47cad0e7e748c390f8e7d1e94ccbb4",
    "79878e3ae5364a658d3f7a0a683c3505",
    "a68b5ae6571e4a66a4727573b88227e4",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "3c9615b3193a4e71ae932ea45fef8dde"
  ],
  "path_id": 773,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03355524669668962,
  "num_matches": 1681,
  "direction_num": 7
},{
  "distance": 10.31,
  "heading": 4.308,
  "instructions": [
    "Go left and wait beside the pianos. ",
    "Go across the room to the left of the big hallway with the grey division to the right, go passed the red stairs on the left, and stop between the stage on the right and the red chair on the right. ",
    "Walk forward, stop at the table covered with a white cloth. "
  ],
  "path": [
    "718fd0815e6d475589ded3064273ed83",
    "1cd4f0434b674da68cd767be462c3e0a",
    "89559bf340b349139dc344bf2df9738e",
    "fefc6d6091ec4a3cb4000d35af5aad9c",
    "6a854b67fc22440eb123d9e712ddd4e9"
  ],
  "path_id": 7055,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07603714925613278,
  "num_matches": 4104,
  "direction_num": 7
},{
  "distance": 11.34,
  "heading": 2.668,
  "instructions": [
    "Walk past bottom of stairs. Make right on carpet runner. Make left through archway. Wait at open bathroom door. ",
    "Walk past the stairs and turn right. Take the first left and wait at the intersection of the other hallway. ",
    "Walk around the staircase and then go through the hallway on the right and turn left at the first door. Then wait next to the bathroom. "
  ],
  "path": [
    "bd0a7e319efd4fd98e373a3d2a025566",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "6c160b1ba8564c09ab8491590266f7f1",
    "d193970cbeac4faeae3b9bfee5c35125",
    "60399cb6fd9d42a7a364f155fd152361"
  ],
  "path_id": 1094,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06035812414702144,
  "num_matches": 1771,
  "direction_num": 8
},{
  "distance": 9.51,
  "heading": 0.006,
  "instructions": [
    "Turn around and exit the foyer. Enter the room on the left and wait in front of the fireplace. ",
    "Go between the two stairs and down three steps. Go past the grandfather clock and pass through the open doorway on your left. Stop and wait just inside the room. ",
    "Walk forward, turn left, enter the room to the right side, and wait near the fireplace. "
  ],
  "path": [
    "1b07d95cb6784bbebbc116ed20469d65",
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 4053,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.0668365815283669,
  "num_matches": 3108,
  "direction_num": 7
},{
  "distance": 9.49,
  "heading": 6.066,
  "instructions": [
    "Go indoors. Go straight toward the fireplace. When you get to the fireplace turn left. Wait in that hallway. ",
    "Enter the building and walk through the dining room. Walk past the flat screen on the left and enter the hallway. Wait near the phone. ",
    "Enter the building.  Walk next to the bar and the wall with the television hanging on it.  The bar and the television will be on your left as you walk.  Take the first door on your left and stop in front of the bathroom door. "
  ],
  "path": [
    "0e83345cd3d942f09ddc91b80911535a",
    "3c476cfa737347bda82af89dd8127ae3",
    "be0eda30886b4aa882f8ba0b213da958",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6199,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09271777628525721,
  "num_matches": 3953,
  "direction_num": 6
},{
  "distance": 13.12,
  "heading": 3.581,
  "instructions": [
    "Walk forward toward the doorway, and wait at the top of the staircase. ",
    "Turn around and go to the large archway. At the arches, continue to the front door and stop. ",
    "Turn left and walk past the really long table. Stand near the front entrance doors. "
  ],
  "path": [
    "397cae1de3b74644804196b838fd3c8a",
    "2d21aec2e48b4797ad0367e96fd316f4",
    "82ee7783a95b4beeb1b8c518107c9ae2",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "aadc2f85a2a742d7ba9a388dd6f4c9cf",
    "2b4b62ead49b4f14a013f85816012a12"
  ],
  "path_id": 4791,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.07953242989303665,
  "num_matches": 1725,
  "direction_num": 3
},{
  "distance": 8.22,
  "heading": 5.004,
  "instructions": [
    "Exit the bedroom through the hallway door. Proceed through the hallway to its end, then turn left. Enter the room and wait by the bathroom door. ",
    "Turn left and exit the room. Go straight until you get to a large door with a wreath on the left. Turn left and wait there. ",
    "Go through the door directly in front of you, take a right and go down the hallway. Stop in front of the garden room. "
  ],
  "path": [
    "e57db85f00a9481787bd9c3c98453f27",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "6249652893364b62b1c30df6c6516a71",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 6837,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09209503547508613,
  "num_matches": 2141,
  "direction_num": 7
},{
  "distance": 11.51,
  "heading": 2.804,
  "instructions": [
    "Go stand on the blue dot in the hallway. ",
    "walk through to the hall turn left in hall and enter main room. Turn slight right and enter dining room, stop facing table. ",
    "Head straight towards wooden door and exit room. Turn left into large room with rug. Take a wide right out of the space and wait right before you reach the darker rug in which the table is on. ",
    "Walk through the door way into the hall,Turn left, walk passed the piano on the right and turn right. Stop on the carpet in the dining room. "
  ],
  "path": [
    "377785e3a8ec4ce7bff6de3035f6fcd5",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "cfd9511c06b34cd1b89ba36919a4e6b6",
    "c645fc0e7e2a488fbed3580e98bd041e",
    "8b22751d94034268b26b9960c1d28e4e"
  ],
  "path_id": 823,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0475293641365623,
  "num_matches": 1798,
  "direction_num": 10
},{
  "distance": 11.52,
  "heading": 3.103,
  "instructions": [
    "Walk through the sitting area and turn left. Then walk through the dinning room. Then walk into the kitchen. Stand near the counter top. ",
    "walk away from the green chairs towards the red chairs, turn left once you walk past the red chairs, turn left before you pass the dining table, walk through another doorway, sop when you reach the kitchen counter. ",
    "Walk between the red chairs toward chritmas tree. Turn left and walk though the opening toward the dinning room. Walk along the left hand wall of the dinning room and into the kitchen.  Walk the end of the counter with a bunch of bananas on the right. "
  ],
  "path": [
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 2309,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.047698176377610604,
  "num_matches": 2369,
  "direction_num": 8
},{
  "distance": 12.46,
  "heading": 1.401,
  "instructions": [
    "Walk straight past the first two round tables. Stand next to the second column. ",
    "Go straight towards the table then keep going straight to the next set of tables and go to the left side of them and stop at the second one in the row. ",
    "Go to the right of the round table and stop to the left of the next round table. "
  ],
  "path": [
    "7601d3e4875e4985aa22aa0ac1605578",
    "00187e6e9d5c41608a232fadb522677e",
    "84bd5fd3ffa04bc8a7810851a04ad9be",
    "f0ab74c8a4a44abfba942f946364510c",
    "bf454a84e687425db55a946493d2ba72",
    "d5183baffb764292a1ce414243f30ef6",
    "00d3e13abe73496aa6e655afe913ce59"
  ],
  "path_id": 1609,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.05173110337467836,
  "num_matches": 1636,
  "direction_num": 8
},{
  "distance": 5.08,
  "heading": 3.626,
  "instructions": [
    "Go through the glass doors on the left, past the bed. Stop in the hallway. ",
    "Walk across the bed into the hallway and wait in the middle of the hallway. ",
    "Walk straight off of the balcony and into the hallway, and stop in the middle of the floor between the bedroom door and the balcony doors. "
  ],
  "path": [
    "601b90857afe424abcfb6291cbb534ff",
    "ef1bed677e2545629b7b68cf4d181d18",
    "96ba4272d14444f7a40b1f7c633f2024",
    "74be0bce40ab4a599a7172c8bef59304",
    "09be981423a3442998bd724cbbdf9b2b"
  ],
  "path_id": 1040,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.06675805995139673,
  "num_matches": 1537,
  "direction_num": 3
},{
  "distance": 5.26,
  "heading": 2.17,
  "instructions": [
    "Walk along the balcony and down some stairs, and wait at the first landing. ",
    "Walk forward and go down the stairs. Stop on the second stair past the landing. ",
    "With the nearest bookshelves to your left, go forward until you reach the stairs leading downwards to your right. Go down those stairs to the first landing, then go one more step on the second flight of stairs to your right. "
  ],
  "path": [
    "f8f15aaf58354ce1b990df2ab33381bb",
    "0e6e6b0332d745178dd37fc1d4a710a2",
    "bfd3e9defa8742118917a4a5cc9190a3",
    "9b253c8eec6c40528ee7fbfc011316a1",
    "5ca7bfc500ec4d928285e61efee2dde5",
    "3beab818935e4ed8aefd2d4d080130fa",
    "3a256f31181143e9844d11ca49211aa4"
  ],
  "path_id": 2533,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04624057883657335,
  "num_matches": 2328,
  "direction_num": 10
},{
  "distance": 5.34,
  "heading": 1.474,
  "instructions": [
    "Walk forward past he living room, into the dining room. Stop in the doorway to the bedroom. ",
    "Turn around and walk into the bedroom. Wait near the bed. ",
    "Walk through the sitting room past the picture of the mermaid.  Stop right after the open door. "
  ],
  "path": [
    "08c774f20c984008882da2b8547850eb",
    "5e9f4f8654574e699480e90ecdd150c8",
    "b185432bf33645aca813ac2a961b4140",
    "77a1a11978b04e9cbf74914c98578ab8",
    "10c252c90fa24ef3b698c6f54d984c5c",
    "0f37bd0737e349de9d536263a4bdd60d",
    "e34dcf54d26a4a95869cc8a0c01cd2be"
  ],
  "path_id": 6380,
  "scan": "17DRP5sb8fy",
  "source": "R2R",
  "similarity": 0.10508145294022798,
  "num_matches": 1597,
  "direction_num": 4
},{
  "distance": 9.37,
  "heading": 6.267,
  "instructions": [
    "Turn around and walk out of the room. Turn left and follow the wood railing to the end and then turn right. Stop at the bottom of the stairs. ",
    "Walk out the doors and turn left. Walk down the hall and turn right. Stop at the bottom of the stairs. ",
    "Leave the room, and go left. Walk down the hall, and take a right at the elevator. Stop in front of the stairs. "
  ],
  "path": [
    "f6ac6ccfda544d34aa5c89ab1915e5d0",
    "f0501ef281ab486eac400af37a580e19",
    "ba692fd9ec524282935a608d975374e3",
    "9bbc936210084a00ad05856e0f5a3364",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "c69af2f0e57b485886e0f4667b2209a5"
  ],
  "path_id": 5900,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.10161903789416143,
  "num_matches": 4307,
  "direction_num": 8
},{
  "distance": 13.27,
  "heading": 5.82,
  "instructions": [
    "Go into the front door, and walk along the left side of the room until you reach a doorway on the right side of the wall. Go into the hallway and walk straight ahead. Stop at the bathroom door. ",
    "Enter the house, walk past the front counter, turn left, and enter the bathroom. ",
    "Walk into the house through the french doors.Walk past the bar and television. Turn left into the first doorway. This is the women's bathroom. Wait by the door. "
  ],
  "path": [
    "c63c6df5237e4943af24e74af8bec007",
    "3c476cfa737347bda82af89dd8127ae3",
    "be0eda30886b4aa882f8ba0b213da958",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50",
    "761e41fbabfd4f1c80c3ab77df6732ce",
    "635e26ebc0594a23b1159bb0c6d15cc8"
  ],
  "path_id": 3167,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12767521777487165,
  "num_matches": 6760,
  "direction_num": 7
},{
  "distance": 11.04,
  "heading": 5.961,
  "instructions": [
    "Turn around and walk past the dining room and enter the bath room on your left.  Wait near the closet doors. ",
    "Turn hard right and walk towards the balcony area. Walk across and under the balcony. Enter the doorway left of the stairs. Wait there. ",
    "Turn around and walk into the middle room behind you with the long black table and the large painting of sailboats. Walk to the other side of the room towards the steps past the long black table. Once you reach the steps, turn left and walk forward into the small red and white hallway ahead. Stop once you enter the hallway. "
  ],
  "path": [
    "38a021bef7634782b42c0583f84c6b8e",
    "9f7f95239ff04f7581f1cf9a4b5a9eaf",
    "da041807b0184761af4e74df5006b95e",
    "c3a25551d0e74186ab736e502f621f9e",
    "7025038ba12d4a63a40c866489226fbe",
    "a9366b89465a49028782a840a165a7e8",
    "2f20259787124d7e8a85408cd5767c65"
  ],
  "path_id": 5864,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06460921463830388,
  "num_matches": 1999,
  "direction_num": 9
},{
  "distance": 7.35,
  "heading": 4.057,
  "instructions": [
    "Go past the couch and down the hallway.  Stop right when you get to the kitchen.  Wait there. ",
    "Leave the porch and make a right then walk down the hall and wait in the entryway of the kitchen. ",
    "Walk forward, around the black leather chair on the left. Continue forward past the dining table and wait at the entrance to the kitchen. "
  ],
  "path": [
    "b363819714f2441795ff02a1a0e8bef5",
    "59f23812d07140bea7bb9680c6efbe7d",
    "2063eaa6e4b64fb5bca5cf30886f30cd",
    "b8ec757801244836bf17dcb1622c3022",
    "a39174aaa3fc4dff9b37f30cc03ab21b"
  ],
  "path_id": 1925,
  "scan": "sKLMLpTHeUy",
  "source": "R2R",
  "similarity": 0.10469159707824631,
  "num_matches": 1910,
  "direction_num": 9
},{
  "distance": 8.36,
  "heading": 2.968,
  "instructions": [
    "Walk through the front entrance of the house. Keep walking straight and then turn left once in the main living room and wait once in the smaller living room. ",
    "Go inside through the front door. Continue straight through the door with the oval window. Turn left immediately into the living area. Stop next to the chair with the flower pattern. ",
    "Walk straight and enter the 2 large wooden doors and enter the house. Once inside the house, turn into the first room on your left and stop. "
  ],
  "path": [
    "fa22eae3a3bd4af98424def01751d2f6",
    "c2341726267a4f31bff80ac3843462d3",
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "50e0cf4daca44c7a9e2a6f6475650ca3"
  ],
  "path_id": 3361,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.047289397044830435,
  "num_matches": 1588,
  "direction_num": 6
},{
  "distance": 6.97,
  "heading": 3.173,
  "instructions": [
    "Go straight into the next room. Go Passed the fireplace and the bear and  and enter the entryway on the left. Then stop. ",
    "From the entrance go straight ahead and turn left from the fireplace. Stop there where the carpeted path begins. ",
    "Enter the room and turn left at the fireplace. Wait in the hallway by the cabinet. "
  ],
  "path": [
    "18b3ba6951f643c89caceda38f7c5404",
    "fc9b08fa1b5b486380466b40b1d633f6",
    "93ed5a7cfa504750bee1c7266e67d147",
    "a1b101eeb3804e828253cc562cec8615",
    "12e9fa5962de43698cf9cec57105d287"
  ],
  "path_id": 6692,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.048432637189994146,
  "num_matches": 1501,
  "direction_num": 5
},{
  "distance": 10.51,
  "heading": 5.756,
  "instructions": [
    "Go down the stairs and take a left. Walk across to the second set of stairs and walk up two stairs and stop on the second stair from the bottom. ",
    "walk down the stairs. turn left at the bottom of the staircase. walk towards the next staircase, up two steps, and stop. ",
    "Walk downstairs, past the table and wait on the second step of the stairs to the left. "
  ],
  "path": [
    "bfa1a9e0fc4a4fe7b493a3f8e94ba39a",
    "67bdb0abccef4560a113496af2447678",
    "1404100e3d1f4c0a9cf90805f87c9f7d",
    "29964e63ab0b4b79bc6dc9cd772cce8d",
    "82aa04ad31f640f09a9d7aa4a6fd224e",
    "505e4b7e84284f5da963ff84b8bac44c"
  ],
  "path_id": 1178,
  "scan": "VFuaQ6m2Qom",
  "source": "R2R",
  "similarity": 0.07866152941619874,
  "num_matches": 1706,
  "direction_num": 8
},{
  "distance": 9.99,
  "heading": 2.561,
  "instructions": [
    "Walk toward ping pong table. Walk to the right of the ping pong table. Stop by the white bucket. ",
    "Walk towards the projector screen. Go between the tables and stop where the lines on the floor intersect. ",
    "When you are behind the desk by the hallway go right and into the room with the projection screen. Now walk between the ping pong table and desk and wait by the small desk. "
  ],
  "path": [
    "96c723cbe63d489295a0cc3a99438f08",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "114842471cc14a44b2f284c943281413",
    "a25a1fe848e044a99a0033878cd108bb",
    "2ed7a969a2d94eeb992c4f49d59cf0d7"
  ],
  "path_id": 7142,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.0591060021257761,
  "num_matches": 1603,
  "direction_num": 3
},{
  "distance": 9.76,
  "heading": 2.45,
  "instructions": [
    "Walk down the hall. Stop outside of the second door on your right. ",
    "Walk down the hallway on the carpet and keep going straight after the carpet ends.  Stop in front of the last door on the left. ",
    "Turn right and walk down the hallway with the carpet. Continue walking past the first doorway. Stop in front of the doorway with double doors. "
  ],
  "path": [
    "9c36a2928f3d436181736d628dd0a694",
    "ca8f4ab52e7d402a9d796b1f24c0ea64",
    "5fa450a5199b41b5b46628e473f20374",
    "6274ee399dac4c5fb61f8198069b490e",
    "4a47eadc434047b8838668980cbb303a",
    "4b7c3faa94b34318bc00523ec9b9c6a3"
  ],
  "path_id": 6215,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.10265042723441085,
  "num_matches": 1517,
  "direction_num": 8
},{
  "distance": 11.49,
  "heading": 3.748,
  "instructions": [
    "Walk towards the red arm chair. Walk between the red arms chairs and head to the dining room with the chandelier. Make a left and walk to the kitchen island. ",
    "Walk past the fireplace, between the pink chairs. Walk through the dinning room and stop in the kitchen next to the barstools. ",
    "With the Christmas tree to your right, walk towards the red chair and into the dining room.  Walk down the length of the dining room and into the kitchen at the other end of the table.  Stop just after stepping into the kitchen. "
  ],
  "path": [
    "124c7635126f4fefaf3c57742dbe1193",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "c407e34577aa4724b7e5d447a5d859d1",
    "a6ba3f53b7964464b23341896d3c75fa",
    "79a8fc21a50f44eea6b47b77771f6d6a"
  ],
  "path_id": 4295,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04878500164026005,
  "num_matches": 2432,
  "direction_num": 6
},{
  "distance": 7.99,
  "heading": 6.244,
  "instructions": [
    "Walk straight to open front door of house. Stop in entryway. ",
    "Walk forwards and enter the house. Stop just inside the house, past the door. ",
    "Walk up the steps and continue on straight, following the stone path. Once past the bench, wait by the door in the entry of the house. "
  ],
  "path": [
    "701293ca052c452c8454a11cf5f140f5",
    "d6316b40b9c8413386ef184e5a5382ab",
    "19ae938a01884f31bb5b758b5a8feb83",
    "b1e41a74f03a4ceeabd6a6da3dc557b2",
    "b0a3ea6e7efb429eab0d0ede3174f906",
    "add7a68256564d1b85b560fb614beedd",
    "34276b7c9d6e491885f36dd1d286e477"
  ],
  "path_id": 2225,
  "scan": "PX4nDJXEHrG",
  "source": "R2R",
  "similarity": 0.10390577943400366,
  "num_matches": 1894,
  "direction_num": 5
},{
  "distance": 7.28,
  "heading": 6.028,
  "instructions": [
    "Walk next to the pool with the pool on your left hand side.  When you get to the bar with the sink in it, turn right and stop by the L-shaped table with the single wooden chair. ",
    "Turn towards your left and walk along the edge of the pool. Once you reach the other side of the room turn right. Head towards the desk and then stop behind the desk facing the 3 steps. ",
    "Cross the patio and wait at the far end of the steps. "
  ],
  "path": [
    "e775ea81e83c45719de5a1577f8f7e39",
    "9b2b12257e9a4c5d9f99f141769e9301",
    "4739d48c61a04deab15db1eb2c906a96",
    "c460d0f6ea8a4458a576efb07d043b39",
    "e37d923ec8284523b5c9ebdb35800a3a"
  ],
  "path_id": 2915,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.049888754119827385,
  "num_matches": 2022,
  "direction_num": 6
},{
  "distance": 14.76,
  "heading": 3.088,
  "instructions": [
    "Exit the office and then exit the sitting area. Wait in the hallway between the two doorways. ",
    "Go the the left of the table and through the doorway on the left, once in the room turn left and go through the middle doorway on the left side of the room, take a few steps through the doorway and stop. ",
    "Go out the door on the left then go out the second door on the left and wait there in the hallway. "
  ],
  "path": [
    "b2c2abdd75de4ea6b203f890bf89cfb0",
    "7a45313ee05048f2bfa610ac81986e1c",
    "52131a7696fc47f4bffd1c0cfd57a454",
    "93848517830e4376a3d3576c16e3685f",
    "8906c7b18ea149a786d9f2cb83bd2f16",
    "994e59a2e5cb469eb29c7ff68c6d49c2",
    "bde29f48ab814943baf4a7193d143d6e"
  ],
  "path_id": 2588,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0866044268105829,
  "num_matches": 4552,
  "direction_num": 6
},{
  "distance": 7.08,
  "heading": 4.968,
  "instructions": [
    "Walk towards the stairs, go up the stairs, and wait. ",
    "Exit the kitchen and go up the stairs on the right. Wait at the top of the stairs. ",
    "Walk up the stairs and wait at the top of the stairs. "
  ],
  "path": [
    "50629d10507840cba1ff155045d3f76b",
    "fea7a9db41944d76b258036b046d13aa",
    "673ae67937804c42b3c22e93efb5d069",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "c4fc538718cc4918884d2040ce523a5f",
    "9001b330086e4aa69799729560e6dca0",
    "3532b1e7ea1646848b710936d4696a5d"
  ],
  "path_id": 2708,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.06992789080884868,
  "num_matches": 1740,
  "direction_num": 2
},{
  "distance": 8.23,
  "heading": 0.238,
  "instructions": [
    "Walk around the table down the length of the room.  Stop behind the first chair that faces the window with the bookcase behind you. ",
    "Walk through the study area past the many bookshelves against the walls along the large table. Walk towards the stair well and turn around the end of the table towards the bookshelf on the opposite side of the room. ",
    "walk across the library with the table on your left.  Then turn to the left and walk to the other side of the table. Wait at the corner of the table. "
  ],
  "path": [
    "7515999894aa42ffa9ce63c8cabe246c",
    "c4e9e99398d84df5bf0150c484ebcd01",
    "84291807bc3a4c9ea9f5d7f7ef53704c",
    "cf726b6c0144425282245b34fc4efdca",
    "87e385b82c704a29855826d3cf4f79a0",
    "4610dfb32d044ad793cf8640a7ede0f4"
  ],
  "path_id": 1731,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.043406084863834925,
  "num_matches": 2285,
  "direction_num": 6
},{
  "distance": 11.68,
  "heading": 0.892,
  "instructions": [
    "Walk to the left of the table and chairs. Walk toward the dining room table and chairs and stop. ",
    "Go straight through the room opposite the staircase and passed the table on the right, go to the right side of the room and step near the circle table, to the left of the circle table and stop. ",
    "Turn around and walk all the way down past the dining table. At the other end of the table, turn right and walk towards the small table with 4 chairs in the corner. Stop once you reach the table. "
  ],
  "path": [
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "4fca698177d14f40a2008174193dcfb5",
    "0907c60c53f7431aaedabbf388069a7f",
    "4a3c031b6787433fb02da9d40a359c68",
    "38a021bef7634782b42c0583f84c6b8e"
  ],
  "path_id": 5773,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.05913434091246529,
  "num_matches": 1782,
  "direction_num": 9
},{
  "distance": 7.88,
  "heading": 2.877,
  "instructions": [
    "go into the bedroom. then turn right and go into the hallway. ",
    "Exit bathroom, walk past the closet and exit the bedroom, go straight, and stop by the dressing cabinet. ",
    "Turn around until you face the door. Move next to the sink, then angle slightly right and move to the open door frame. When you're standing in it, angle slightly right again and move toward the bed. Turn to the right, and move towards the first open door you see, moving into it. Make another slight right, continuing towards the open white door you see and moving straight through the door. Stop and wait halfway to the next door, just before the mirror and dresser. "
  ],
  "path": [
    "dfa2911542f5487681e50e6fa1d42f87",
    "1e05b7a24e664d3f98f3498d911bc48a",
    "c20f8e6497d14696b2cecf24ed288470",
    "4f1ecaca2cc744b0beb75e146bc8ecc7",
    "62994d72dab246fbb839f3699b9cacd6",
    "aaa8773c86214e9990d4c3ede3223499",
    "223b4ced68cd4688b6612a2795409490"
  ],
  "path_id": 349,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.042466468684819306,
  "num_matches": 1630,
  "direction_num": 10
},{
  "distance": 9.83,
  "heading": 4.59,
  "instructions": [
    "Walk past the oil based heater and into the dining room. Walk to the right of the dining room table and up the stairs. Stop on the fourth step. ",
    "Turn left and walk through the sitting room.  Enter the dining room, then walk to the stairs and stop on the middle set of stairs. ",
    "Turn around and go through the doorway between the chairs. Keep Going straight and through another doorway. Descend the stairs. "
  ],
  "path": [
    "ce06069f651f49d19d05fde4a7e231b5",
    "c4b53f73a3734bc7a5b51747e5d1d5f7",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "51328414aea04771890766f436b40021"
  ],
  "path_id": 2845,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0635750459645971,
  "num_matches": 1759,
  "direction_num": 4
},{
  "distance": 16.45,
  "heading": 4.623,
  "instructions": [
    "Walk past plant. Walk past lucite chairs. Walk past wood-framed window. Wait at wooden pallet table. ",
    "Turn around and walk behind the table.  Turn to the right and walk by the white shelf and then turn to the left and walk down the middle of the room.  Stop when you come to the coffee table and white couch with the green pillows.  Wait. ",
    "Turn around, walk to the left of the long table. Take a slight right, continue through the desks. Stop at the coffee table. "
  ],
  "path": [
    "86958e49dad94db090a8dd520b4994a3",
    "d4ecb79c2639408c845166b646262ece",
    "6855b783e2f34c7981b90ddb5de81bd7",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "12eaa3a3a39e4c9fa5106812cb7da084"
  ],
  "path_id": 1721,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.050633924038700116,
  "num_matches": 1815,
  "direction_num": 8
},{
  "distance": 5.28,
  "heading": 5.237,
  "instructions": [
    "Leave the porch and go inside and make a right towards the bed. Go to the left corner of the bed then make a left. Stop at the clothes rack. ",
    "Turn and walk through the doorway. Walk towards the bed. Turn left and walk towards the bathroom. Stop in front of the robes hanging in the closet. ",
    "Enter the bedroom and walk around the bed into the closet. Stop in the closet. "
  ],
  "path": [
    "96478d4e66104792b0481887c85255a8",
    "1dc09ae6cd914f67b9234869e5e11104",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "efe359ee05ea46c587196354c2d1cc96",
    "8b41e8798d78402f9f36b242972d729b",
    "11ec36e3d78c43a389366c5159069b0c"
  ],
  "path_id": 1951,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.0756167799990222,
  "num_matches": 3299,
  "direction_num": 7
},{
  "distance": 12.24,
  "heading": 5.718,
  "instructions": [
    "Walk past the Christmas tree out of the room and go left at the base of the stairs.  Stand under the ceiling fan and go into the doorway to the dining room between the red and yellow chairs.  Stop in front of the first chair you reach in the dining room. ",
    "Exit the room though the opening to the right of the fireplace. Continue forward an to the left to pass through the pocket door opening in the opposite corner ahead of you. Stop next to the dining table with twelve chairs around it. ",
    "Walk past the red couch and out the door. Walk through the living room and past the two red chairs. Stop after you walk into the dining room. "
  ],
  "path": [
    "8bc03fde666a466893e069325db4a807",
    "77a6b37bf22f49afae1a9d30d736a00b",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 6914,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04156976041959553,
  "num_matches": 2268,
  "direction_num": 7
},{
  "distance": 6.15,
  "heading": 3.409,
  "instructions": [
    "With the double doors directly to your right and the window directly behind you, move forward past the fireplace on your right until you pass the rope barrier and are standing on the carpeted pathway. ",
    "Walk forward past the fireplace. Step onto the red rug ahead, and stop. ",
    "Go to the fireplace. Stand on the red carpet. "
  ],
  "path": [
    "21e7a431303c4b4e9e41e90bdafc3bec",
    "1bcdf4d037c249bf80d837856ed65779",
    "fddd2a92c75a4e4baedcdf0659e9dad1",
    "ba47cad0e7e748c390f8e7d1e94ccbb4",
    "79ee9be0827a4de19da5b3e475e3ae0a"
  ],
  "path_id": 3624,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.07214572065339431,
  "num_matches": 3063,
  "direction_num": 6
},{
  "distance": 10.33,
  "heading": 1.511,
  "instructions": [
    "Exit the room. Go down the stairs and wait there. ",
    "Exit the room, go downstairs and stop at the bottom of the stairs. ",
    "Exit the bedroom and go down the stairs.  Stop at the bottom of the stairs. "
  ],
  "path": [
    "8388153c198e4e4fb75cd8d0fd96d8a2",
    "5f4fd3bd58144211a8617caa5570e40c",
    "c4fc538718cc4918884d2040ce523a5f",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "673ae67937804c42b3c22e93efb5d069",
    "fea7a9db41944d76b258036b046d13aa",
    "32fb55017460457cbe0b8d1790a54786"
  ],
  "path_id": 4217,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.04931655225610036,
  "num_matches": 1626,
  "direction_num": 3
},{
  "distance": 6.1,
  "heading": 2.682,
  "instructions": [
    "Walk out the door in front of you. Then walk out the door to your right and exit the bathroom. Walk into the bedroom and walk to the other side of the bed. Stop while looking out the window over the table and chairs and the ocean. ",
    "Go straight through the door and turn right through the door. Then go straight towards the window and passed the bed. ",
    "Go through the brown door to the white door. Then go through the white door past the foot of the bed.The stand between the side of the bed and the window. "
  ],
  "path": [
    "40c3d461ced54be485f5d6144952f2de",
    "5c3fa398480741ff9d996b26596e647c",
    "45ee2d428b7c42a98afe21f68a8fa298",
    "8b41e8798d78402f9f36b242972d729b",
    "efe359ee05ea46c587196354c2d1cc96",
    "0a709d588fcd4ae5badd921366074d7a",
    "156af10f63d84956ba5dc4b9fe3b2140"
  ],
  "path_id": 3001,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.06469666050928642,
  "num_matches": 2161,
  "direction_num": 6
},{
  "distance": 16.78,
  "heading": 2.693,
  "instructions": [
    "Turn around and walk to the bottom of the stairs. At the bottom, turn left and then enter the door to your left, right before the white chairs. ",
    "Walk down stairs and turn left and walk toward closet door and stop. ",
    "Go down the stairs. U turn left and go into the room on the right. Wait at the entrance. "
  ],
  "path": [
    "bb2ed22637c342ba8acb80a377f234f9",
    "ea8c31ffae82450f87d19ca1ac4d01b7",
    "10b11d5c0cb7449baca31324b6a371bb",
    "ed46f2e3d89d4f2ea2ec7b14affef69d",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 5807,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.045652035327025775,
  "num_matches": 2381,
  "direction_num": 8
},{
  "distance": 18.79,
  "heading": 5.723,
  "instructions": [
    "Walk through the hall into the next room and left around the chairs. Walk through the doorway and right around the desk. Walk through the doorway to the left of the chairs and stop. ",
    "Walk through the open door. Walk past the animal tusks on the table to the left. Walk through the open door to the left of the ship in the glass case. Walk past the curtained windows on the left. Walk through the open door between the burgundy chairs. Wait at the threshold of the door. ",
    "Head out through the main seating area and use the doorway to the far left to pass straight into the bedroom. Wait near the clothed tabled. "
  ],
  "path": [
    "be255b95116f48599c036544957334ec",
    "764cb58a8d31461892ca6bdc675c14df",
    "6e1e3e8662774c8b9906d3c0a3b1ed3f",
    "93848517830e4376a3d3576c16e3685f",
    "52131a7696fc47f4bffd1c0cfd57a454",
    "bcf71cd8fa804d5abff84ad22a552450",
    "dafcbb94981f4b719d2cbb741737830b"
  ],
  "path_id": 5892,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.051515238846187826,
  "num_matches": 2491,
  "direction_num": 10
},{
  "distance": 11.33,
  "heading": 2.86,
  "instructions": [
    "Go straight through the kitchen and then turn right into the common area, go straight to the room by the stairs, wait by the desk. ",
    "Go through the kitchen around and past the counter and left past the dining table, and wait at the doorway to the office. ",
    "Leave the room with the bar and walk straight into the kitchen. Make a right at the kitchen counter and leave the kitchen. Make a slight left in the dining area and wait in the office by the stairs. "
  ],
  "path": [
    "e58daa54fe36484984da0fc3e209ee39",
    "a885c9f037fe45cfbf053e98e4e3d205",
    "e3eeb7b8deed4a2fa0000daec3538b75",
    "f4032225a0c6462ba02f728d031c2638",
    "7025038ba12d4a63a40c866489226fbe",
    "f5df82be55df4d13af8d03695bad0163",
    "1316450be64b472c9f84f6f71a991757"
  ],
  "path_id": 742,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0635574959595263,
  "num_matches": 1832,
  "direction_num": 9
},{
  "distance": 12.66,
  "heading": 6.058,
  "instructions": [
    "Enter the building and walk through the dining area. Wait in the doorway under the mounted deer head. ",
    "Walk straight into the house. Turn left and go past the table and chairs until you get to a fireplace. Go into the room that is to the right of the fireplace. ",
    "Walk inside past the two pillars.  In the room with the tables, walk left until you see the fireplace.  Go through the door to the right of the fireplace and stop when you are standing under the mounted deer head. "
  ],
  "path": [
    "2936d8831e8a41ca98980ff2fd83e00a",
    "74c229ab7552402fbd3d6a6bcc35e569",
    "218bbf19f35641d2b7928da523fe44e2",
    "a67abce0a4444fbf93c0203954e1da6d",
    "305629bf76c04f19b7d099d0dabc2574",
    "de49de6069de407195ab646f74a4d796",
    "2e061585204b4ba686fd66f746243127"
  ],
  "path_id": 4269,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06320632474283679,
  "num_matches": 4689,
  "direction_num": 7
},{
  "distance": 5.87,
  "heading": 2.971,
  "instructions": [
    "After you walk inside the building make a right and go to the stairs, and wait on the second step. ",
    "Go through the doorway away from the outside area, make a right toward the Christmas tree, take two steps up onto the staircase and then stop. ",
    "Go straight ahead and turn right, stopping a few steps up the stairwell. "
  ],
  "path": [
    "eb2c8a7d6d044e9e9d2326cbe48e437f",
    "0acbbb92572f437faef8da9b991412f6",
    "35aade4482c04c1385cbb19c25bd1d7e",
    "41873d3929e64a9a938a5fac3b6bbd79",
    "61aa57f78ebf40dd9bc04e27b1a4c80f"
  ],
  "path_id": 7131,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.050665686585732186,
  "num_matches": 1610,
  "direction_num": 4
},{
  "distance": 14.61,
  "heading": 0.993,
  "instructions": [
    "Enter the house and angle right, walking close to the chairs on the right side. Continue past the staircase and turn right. Wait in the doorway with the double doors. ",
    "Facing the large open staircase, go into the room and veer to the right of the staircase, going through the third arched double door opening on the right. ",
    "Go inside, turn slight right and start going forward along the left wall, go into the second to last archway then stop. "
  ],
  "path": [
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "9cc6191a6e1642f984e54b1a79b83761",
    "d35b945333f5413a9f5586b794cd2680",
    "3d8ad75bfd9148c29e199b69d68d30d4",
    "f5bef118db5b41849ce63cbfcefed938",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "8d01d3df74ea481bb82fd00f4ae6bae7"
  ],
  "path_id": 3838,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10095394340648965,
  "num_matches": 5434,
  "direction_num": 9
},{
  "distance": 12.21,
  "heading": 3.166,
  "instructions": [
    "Go down the stairs. Turn right and go straight until you get to a room with a black table and a fireplace. Wait near the fireplace. ",
    "Go between the two columns and then turn right. Go through the double doors and proceed down the hallway. At the end enter the room to the right, go under the velvet rope and stand in front of the fireplace. Wait there. ",
    "Head away from front door down a flight of 3 stairs, Turn right. Follow hallway down through 2 sets of doors. Stop just before the ropes. On the right side step over the rope and just before the fireplace. "
  ],
  "path": [
    "f4810f2f18cb497389628bd8738ba036",
    "813bb8880cdf4a24b48d97af1b4443a2",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "807009de2d6c43bf857a9250dc76f8be",
    "057976101e4f4f04b99391f81aa9c1b8",
    "50a6d809b39f4f19b02c4db72111046b"
  ],
  "path_id": 5172,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04544648914690319,
  "num_matches": 1938,
  "direction_num": 10
},{
  "distance": 12.91,
  "heading": 3.347,
  "instructions": [
    "Walk into great room. Walk past dining table and chairs. Walk past bar. Walk through open french doors. Wait outside doors. ",
    "Enter the dining area, and then move forward to the backyard, and wait by the door. ",
    "Walk out of the sitting room and go forward into the dining hall. In the dining hall go around the table to the right and walk straight out of the doors. Once you walk out of the doors onto the patio stop parallel to the wooden bench on your left. "
  ],
  "path": [
    "8d1f61d5e90e43deb38eb12af08ebf1b",
    "777f43a3702841698d8da94900ba8a2d",
    "96331f871893432f8bf3206ad2205cdd",
    "576196703bb14f4f99fe187d8bebafec",
    "3c476cfa737347bda82af89dd8127ae3",
    "0e83345cd3d942f09ddc91b80911535a"
  ],
  "path_id": 509,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08898753868299951,
  "num_matches": 5766,
  "direction_num": 7
},{
  "distance": 13.18,
  "heading": 4.81,
  "instructions": [
    "Go to the statue. Go to the bottom of the stairs. Enter the room on the left. Go to the first white chair. ",
    "Go down the stairs and turn left. Wait near the black table. ",
    "Pass the knights on the left and continue down the wooden stairs. Turn to the left and enter the doorway. Wait near the glass coffee table. "
  ],
  "path": [
    "d0ab03fe8b9d441bb6cbd0621903bd0d",
    "c05ffc986dd04970aeb52d5b15a20ad4",
    "ce72b075950f44ecbf6f44abd6106e08",
    "7d9e8e6508884b1c8c9fedf59d70729e",
    "81a50ecde0ab42cd81e0cf23a2529675",
    "f745a3bf638a40dd85e29ce98d8c2aba",
    "913aefa5733c425eb79de9f5e225cd0e"
  ],
  "path_id": 2007,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.037297412041299216,
  "num_matches": 1516,
  "direction_num": 6
},{
  "distance": 9.79,
  "heading": 5.887,
  "instructions": [
    "Head toward the stairs, pass the fireplace then the stairs then continue straight until you get to a door that leads into the room. Wait at the entrance. ",
    "Walk straight all the way passing the staircase on the right to enter the very first room next to the fire extinguisher on the wall. Enter the bedroom door and stop there. ",
    "Turn left and walk past the staircase. Keep heading straight and enter the doorway straight ahead beside the elevator. Stop at the door looking in at the bed and zebra chair. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "9766d89c21094c5b872be3a378d4cbad",
    "0e8e2c9d09974dab977c1d3868286f12",
    "c69af2f0e57b485886e0f4667b2209a5",
    "70d67ed19aa34e34845d32ca74a1d711",
    "22f85dac33524c6889f80fa7e76a6790",
    "be8ffeba688d499b982fa36b58f0cef1"
  ],
  "path_id": 2922,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09710061002294774,
  "num_matches": 3974,
  "direction_num": 7
},{
  "distance": 7.56,
  "heading": 0.979,
  "instructions": [
    "Continue up the stairs. Go straight through the doorway and into the bedroom.  Turn to the left and go past the chair.  Go out the doorway to the rooftop.  Walk through the door and then stop.  Wait. ",
    "Enter the bedroom door to the left of the red artwork, continue left, and leave the bedroom onto the balcony. ",
    "Walk up the stairs and go straight into the bedroom at the top of the stairs. Take a left, and walk out onto the balcony. Stop once you are on the balcony. "
  ],
  "path": [
    "9a7dbaeae4f049f09e3e7472d11e796e",
    "3a9381248af24e2795095eda5bee2270",
    "85b4d3014af0457e9bb0827ea6e18925",
    "20216703be7341b89b57ea2165e6a9bb",
    "b3191aeb9a224993b6dd549b8d6a732b",
    "39a03200d75141b79e1f306fcca75c46"
  ],
  "path_id": 340,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.11512507437111297,
  "num_matches": 1519,
  "direction_num": 7
},{
  "distance": 13.64,
  "heading": 2.958,
  "instructions": [
    "Turn and around and take a right turn to go between the benches. Turn left passed the pillar and stop at the end of the first bench on the right. ",
    "Walk a bit forward, and turn right at the very first empty space between the benches. Keep walking forward passing the pole, and stop in front of the bench that have maroon cushions on them. ",
    "Turn around and walk forward. Turn right to go down the aisle between the seats. Once you reach the other end, turn left and stop at the end of the seat against the wall. "
  ],
  "path": [
    "308f9ac247e047f8acfaa347bf292cf7",
    "32b26022662440e4a2bd82f59e53d34a",
    "32e8651e5eb940c7bff34e65a4f4cbbd",
    "13350d0001004a9cb366910df03c2532",
    "522196670f2e4e5783391c7b1255cb8b"
  ],
  "path_id": 4467,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.07535473870437248,
  "num_matches": 4432,
  "direction_num": 10
},{
  "distance": 16.88,
  "heading": 3.245,
  "instructions": [
    "Exit room through the middle double doors.  Walk across room and take the first door on the left. Continue straight through hallway stop on rug inside door. ",
    "Exit the room through the double doors, pass through the corridor and enter the hallway to the far left. Proceed through the hallway. Wait by the doorway. ",
    "Turn left and exit the room out the wood doors. Go across the next room and enter the door to the far left. Walk forward and stop when you reach the large rug. "
  ],
  "path": [
    "0026d80fc3c84d91bd088b831d230738",
    "fadac209cfc04129998323d048a5c908",
    "f5bef118db5b41849ce63cbfcefed938",
    "0cb7f98845aa4939a1125d430acb7183",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "cfd9511c06b34cd1b89ba36919a4e6b6"
  ],
  "path_id": 6205,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06785311997751105,
  "num_matches": 3118,
  "direction_num": 6
},{
  "distance": 10.71,
  "heading": 1.511,
  "instructions": [
    "After you leave the bedroom walk down the stairs in front of you and slightly to the left. When you are at the landing make a left and wait in the entryway of the dinning area. ",
    "Walk out of the room and across the hall. Walk down the stairs and turn left. Stop in front of the glass doors. ",
    "Go through the open door on the right and go down the stairs. Turn the first left corner and stop. "
  ],
  "path": [
    "8388153c198e4e4fb75cd8d0fd96d8a2",
    "5f4fd3bd58144211a8617caa5570e40c",
    "c4fc538718cc4918884d2040ce523a5f",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "673ae67937804c42b3c22e93efb5d069",
    "fea7a9db41944d76b258036b046d13aa",
    "8f5a767771964a56b3708d5415c446b2"
  ],
  "path_id": 6522,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.049425668927546865,
  "num_matches": 1507,
  "direction_num": 8
},{
  "distance": 7.85,
  "heading": 5.083,
  "instructions": [
    "Pass the Christmas tree, the light blue chairs, and the red chairs then pass the other Christmas tree and turn left and stand by the large table with chairs. ",
    "When you are standing in front of the small table with the brochures turn so you see chairs on the left and a Christmas tree on the right. Now walk past the blue chairs and into the area with the reddish pink chairs and gold chairs. Next work through that entryway so you are in front of a dinning table and wait. ",
    "walk straight across living room into dining room. Stop before dinning table and chairs. "
  ],
  "path": [
    "8928b554a7004ef9855170e584781f31",
    "267a7e2459054db7952fc1e3e45e98fa",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "150763c717894adc8ccbbbe640fa67ef",
    "b411496c1f7b403981f0c2f24995309c"
  ],
  "path_id": 2053,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04274787108328275,
  "num_matches": 1721,
  "direction_num": 5
},{
  "distance": 11.74,
  "heading": 4.176,
  "instructions": [
    "Walk out the double doors into the large open room. Go straight across the room and enter the doorway straight across. Once you enter the next room, stop when you reach the rug. ",
    "Walk straight across the open room with the staircase and through the door straight ahead of you. Stop just inside the next room, just before you step on the red rug. ",
    "Go straight until you get to the room with the large light blue carpet. Continue straight and go into the room next to it with the large pink carpet. Wait there. "
  ],
  "path": [
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "f12b7ffe7f9e4ece9bd927edf6b52b71",
    "1ad73ac43096496f9b6084071d1d944f",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "0b4d4c11e012429e8dd6013502094ef3"
  ],
  "path_id": 4022,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.10587717811078878,
  "num_matches": 4253,
  "direction_num": 6
},{
  "distance": 13.51,
  "heading": 2.969,
  "instructions": [
    "Walk down hallway to large entry way, walk into right hand entry and stop at fireplace. ",
    "Turn and enter the doorway on your left. Go down the short hallway and enter the room with the large stairway in it. Across the room, there will be two doors. Go into the one on the right, closest to the window. Take one step into the room and wait. ",
    "Stand with the ropes to your left and behind you and walk straight into the next room.  Walk past the marble columns and go through the doorway of the right, closest to the windows.  Stop after passing through this doorway and are near the fireplace. "
  ],
  "path": [
    "057976101e4f4f04b99391f81aa9c1b8",
    "807009de2d6c43bf857a9250dc76f8be",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "ba5080db55e84e4f9a9c02a4549e7448",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 2987,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.042372866365109535,
  "num_matches": 1979,
  "direction_num": 9
},{
  "distance": 9.47,
  "heading": 1.146,
  "instructions": [
    "Exit the room, walk past the stairway and the fireplace, then turn left. Proceed through the doorway and wait by the door. ",
    "Leave the bathroom and walk straight out and past the staircase.  Turn left at the fireplace and start to walk outside, passing the bear.  Step in the first doorway near the blue stuffed chair and stop. ",
    "Exit the bedroom and go straight towards the blue chair, turn left after and around the black bear, step into the near front doorway and stop. "
  ],
  "path": [
    "5ca14589a7c4407b9333c3dc02d9c9a5",
    "c69af2f0e57b485886e0f4667b2209a5",
    "7f03669f1daf499491770eb857dbe25d",
    "4c477b124d744b75b561bab5d612bfd8",
    "93ed5a7cfa504750bee1c7266e67d147",
    "fc9b08fa1b5b486380466b40b1d633f6"
  ],
  "path_id": 6492,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05705507079128438,
  "num_matches": 2044,
  "direction_num": 8
},{
  "distance": 12.05,
  "heading": 5.734,
  "instructions": [
    "Turn left and go past the light blue chairs. Turn left and go up the stairs. Wait at the top. ",
    "Turn around and walk past the chairs. Turn left and go up the stairs. Wait at the top of the stairs. ",
    "Leave the sitting area, and go to the left. Go up the stairs, and stop at the top of the stairs. "
  ],
  "path": [
    "8d6772b59ad247debb77bf51b0ae00cb",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 4522,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.047045764699332485,
  "num_matches": 2795,
  "direction_num": 6
},{
  "distance": 11.54,
  "heading": 1.556,
  "instructions": [
    "Go up the stairs on your left and then go into the second room on your left. Wait there in the laundry room. ",
    "Walk all the way up to the top of the stairs. Head straight, and turn left at the second room that is a laundry room. Enter inside the laundry room, and stop there. ",
    "Go up all of the stairs, and then go towards a framed picture of a ship, but turn left when you see a laundry room. "
  ],
  "path": [
    "7234d14e0a884f35a6a02e21985b8273",
    "cc0682e6d88a44f3bfaeb81e91a79124",
    "cefe85eb9d1e4592a020547df6107246",
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "087bf4ad4a0b4a17afc2d6c173eceff3",
    "3851376d4f84494ebdc080b34ddc0f5e"
  ],
  "path_id": 2383,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09094199002963681,
  "num_matches": 2004,
  "direction_num": 6
},{
  "distance": 14.58,
  "heading": 6.261,
  "instructions": [
    "Turn around and go past the two chairs.  Jump the rope.  And then go straight on down the runner rug.  Turn left at the marble staircase and go to the top of that.  Then wait. ",
    "Turn toward the exit past the ropes.  Walk out of the exit doors down the red carpet.  Stop facing the stairs. ",
    "Walk past round mirror. Make hard left at rectangular mirror. Walk past fire extinguisher. Wait at top of marble stairs. "
  ],
  "path": [
    "2a06614b13484a04bf20880b0da3650e",
    "e25b3ee74de846c18029e06899faf471",
    "057976101e4f4f04b99391f81aa9c1b8",
    "807009de2d6c43bf857a9250dc76f8be",
    "56cf724d00bd469c8c4b80ad9ffa68dd",
    "3f75b2d4af4d4afd85666d4c1302008c"
  ],
  "path_id": 1340,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03276866033109202,
  "num_matches": 1579,
  "direction_num": 9
},{
  "distance": 14.14,
  "heading": 0.133,
  "instructions": [
    "Go down the stairs and then wait in the middle. ",
    "walk down the stairs, turn right and walk down those stairs, stop in the middle of the red tile at the bottom. ",
    "Go down the stairs, and at the landing go right. Continue down the stairs to the next landing. Stop on the landing. "
  ],
  "path": [
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 3366,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04372004537242404,
  "num_matches": 2866,
  "direction_num": 7
},{
  "distance": 7.72,
  "heading": 1.639,
  "instructions": [
    "Walk out of the bedroom into the hallway. Turn the corner and walk down the stairwell ahead. Continue down the stairs to the lower floor of the home. Walk towards the glass doors leading out to the patio area. ",
    "Leave the bedroom and go down the stairs on the left in your 11 o'clock position.  At the bottom of the stairs, turn left into the kitchen area.  Stop just after stepping into the kitchen area. ",
    "Exit bedroom and descend stairs, wait at stair landing. "
  ],
  "path": [
    "5b821a3b87cd4ed3a7c4414199a0a740",
    "5f4fd3bd58144211a8617caa5570e40c",
    "c4fc538718cc4918884d2040ce523a5f",
    "e0c61a2e0f9244cd8534e9ed8be96322",
    "673ae67937804c42b3c22e93efb5d069",
    "fea7a9db41944d76b258036b046d13aa",
    "8f5a767771964a56b3708d5415c446b2"
  ],
  "path_id": 5511,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.0657829454024109,
  "num_matches": 1610,
  "direction_num": 6
},{
  "distance": 9.62,
  "heading": 5.603,
  "instructions": [
    "Walk up the stone stairwell to the top. Walk through the glass doors at the top of the stairwell. ",
    "Walk up the stairs, turn left open the door and wait by it. ",
    "Go to the third step\r\nGo to the sixth step\r\nGo to the ninth step\r\nGo to the twelfth step\r\nGo up three steps\r\nGo to the doors. "
  ],
  "path": [
    "67bdb0abccef4560a113496af2447678",
    "bfa1a9e0fc4a4fe7b493a3f8e94ba39a",
    "ece8adfc0c1f40c4a55d2404f0130396",
    "661de8ab47bc46d89c2424fdec1ab9c6",
    "490cdc47322b4907810cb18194de7469",
    "54d172eea1274b8aabd7f625254f7dcd",
    "b6ab88125f984cda94011fef788e23d0"
  ],
  "path_id": 49,
  "scan": "VFuaQ6m2Qom",
  "source": "R2R",
  "similarity": 0.07141926798387736,
  "num_matches": 1779,
  "direction_num": 1
},{
  "distance": 5.67,
  "heading": 5.887,
  "instructions": [
    "Leave the room where the office is and make a right. Go down the hall and go to the doorway to the bedroom at the end of the hall. Wait in the doorway of the bedroom. ",
    "Start in the hallway. Walk forward. Turn left into the bedroom. Stop in the bedroom. ",
    "Walk down the narrow hallway with the handicapped bathroom on the left. Take a left into the bedroom.  Stop in the bedroom in the doorway. "
  ],
  "path": [
    "12e9fa5962de43698cf9cec57105d287",
    "d101fc142df64f9f8bae9894eb86fb41",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 919,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.1177004746313282,
  "num_matches": 4044,
  "direction_num": 7
},{
  "distance": 6.77,
  "heading": 0.034,
  "instructions": [
    "Walk forward, going through the door with horizontal glass. ",
    "Turn around and walk through the front door. Stop just inside the door. ",
    "Walk down the path and into the building and stop. "
  ],
  "path": [
    "d6316b40b9c8413386ef184e5a5382ab",
    "19ae938a01884f31bb5b758b5a8feb83",
    "b1e41a74f03a4ceeabd6a6da3dc557b2",
    "b0a3ea6e7efb429eab0d0ede3174f906",
    "add7a68256564d1b85b560fb614beedd",
    "34276b7c9d6e491885f36dd1d286e477"
  ],
  "path_id": 6686,
  "scan": "PX4nDJXEHrG",
  "source": "R2R",
  "similarity": 0.09877672022631516,
  "num_matches": 1574,
  "direction_num": 2
},{
  "distance": 6.9,
  "heading": 5.356,
  "instructions": [
    "Walk to the left of the mirror, through the door, and outside through the door to the left. Stop when you get to the plants on the right, next to the pool. ",
    "Exit the shower room and go through the door directly ahead. Turn left and go through the door to the outside. Stop by the first flowerbed and wait there. ",
    "Walk forward past vanity. Turn left and exit through door. Stop at pool. "
  ],
  "path": [
    "bed1e142845343c5b9695eabad5d170e",
    "5ee3f3c0dac54a1893594c1fde6a427a",
    "88fda52a9c9e4a5cb1774e741ecce8f6",
    "ca77dd4132f044b7b6b999d3795d09d3",
    "9a896fadb819490089bf51005088f464",
    "6b0783db762e4593ab5ff5fa7caf57ce",
    "ce09a3da7596439c8685be5f408afb81"
  ],
  "path_id": 4373,
  "scan": "VVfe2KiqLaN",
  "source": "R2R",
  "similarity": 0.07736640032034958,
  "num_matches": 1568,
  "direction_num": 7
},{
  "distance": 9.07,
  "heading": 3.443,
  "instructions": [
    "Exit bedroom, make a right, then a left walk toward door and  exit. Wait after exiting door. ",
    "Exit bedroom and walk towards tapestry on the right.  Take a left into the master suite and head outside.  Wait on the balcony. ",
    "Exit the bedroom and turn right. Walk through the double glass doors and turn left. Enter the master suite and continue forward, walking through the double doors. Wait on the balcony. "
  ],
  "path": [
    "d6eb5e0d9fad4df5a2ec9b04606e8053",
    "4531a8cd59c7423e8f938bcd905f7b62",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792",
    "a515a42b3cfa4005affc8b3f14d8ca2d",
    "6a15f715d61843b2a84845d392ec0b72"
  ],
  "path_id": 5769,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05390641910538496,
  "num_matches": 1902,
  "direction_num": 8
},{
  "distance": 7.73,
  "heading": 3.866,
  "instructions": [
    "Leave the bedroom, and take a left. Enter the bedroom on the left. Stop in the doorway to the bedroom. ",
    "Exit the bedroom and go into the carpeted hallway.  Turn hard left and walk straight.  Make a left into the room in front of treasure chest.  Wait here. ",
    "Exit the bedroom and turn left. Then enter the doorway on the left and wait near the nightstand. "
  ],
  "path": [
    "223e143862134f51b3e794c840d495c4",
    "7f39d79ddfec4b6e9c98e51576d59ab1",
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab"
  ],
  "path_id": 7021,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12351376292863687,
  "num_matches": 5018,
  "direction_num": 7
},{
  "distance": 6.42,
  "heading": 1.769,
  "instructions": [
    "Go down the stairs, turn left at the landing and go down the stairs again to the very bottom. ",
    "Go down the stairs. Make a left and go down more stairs. Stop at the tan chair beneath the painting. ",
    "Walk down the wooden flight of stairs with the paintings on the wall. Stop at the bottom of the stairs facing the armchair and checkerboard side table below. "
  ],
  "path": [
    "bace700b94f743d1bedc82b611604dee",
    "2468abd2ba7b4e8a9222d3e318c6ad7f",
    "564ec6d404cb4349a21a05e0b4bc5fc8",
    "aa6ef1806b414e5ab49db9a45595c8cc",
    "0d24c66abcef47fa898d9c239e6a3de9",
    "e94cd6b986b5456990723fa8d9612759",
    "118169c7cc3f488e88a237f10cad437b"
  ],
  "path_id": 1214,
  "scan": "EDJbREhghzL",
  "source": "R2R",
  "similarity": 0.041954703323851435,
  "num_matches": 1566,
  "direction_num": 7
},{
  "distance": 8.1,
  "heading": 0.892,
  "instructions": [
    "Walk forward and turn left at the second corner to enter a room full of books with shelf. Walk forward towards a door leading to another room, and stop there. ",
    "Turn around and cross the table. Then turn left to enter the library and turn right to head into the second room. Stop near the table. ",
    "Turn around away from stairs. Go forward and take first left. Go forward and go through doorway. Stop at doorway. "
  ],
  "path": [
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "c4b53f73a3734bc7a5b51747e5d1d5f7",
    "9b3beab962d040428acc300ff7a9326f"
  ],
  "path_id": 4463,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.062343479752993675,
  "num_matches": 1515,
  "direction_num": 9
},{
  "distance": 13.93,
  "heading": 3.297,
  "instructions": [
    "Turn around and walk out the door and into the hallway. In the hallway turn right and enter the large dining room. Turn left and exit the room through the middle of the big doors and stop when you reach the blue rug. ",
    "Walk down hall, turn right at intersection into dining room. Turn left and walk into huge sitting room. Wait in center of room. ",
    "face two doors walk through doorway on the left towards old bathroom, turn right before bathroom walk towards carpet, turn left at table and walk through giant doorway and stop when you reach the carpet. "
  ],
  "path": [
    "ba3207f81c55467fa7e6760f6232fb07",
    "60399cb6fd9d42a7a364f155fd152361",
    "babbef7305e34152950788aa9cb363cc",
    "faddc614417b4861b4cd05176a35b947",
    "8b22751d94034268b26b9960c1d28e4e",
    "c645fc0e7e2a488fbed3580e98bd041e"
  ],
  "path_id": 4636,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0623432693225821,
  "num_matches": 3080,
  "direction_num": 10
},{
  "distance": 5.22,
  "heading": 6.26,
  "instructions": [
    "Go to the oven. Turn left and go to the refrigerator. ",
    "Stand in front of the silver refrigerator. ",
    "Go into the kitchen and wait by the fridge. "
  ],
  "path": [
    "5186e9da9b4248318f4a7ae68d11da15",
    "f032c9ee981a4462914468785f0a4abe",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f"
  ],
  "path_id": 3049,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.05920311298851026,
  "num_matches": 1593,
  "direction_num": 1
},{
  "distance": 10.05,
  "heading": 0.822,
  "instructions": [
    "Enter the house through both doors pass the teal chairs. When you get to the wreath turn left into the bathroom and stop by the sink. ",
    "Turn around and enter the house. Head past the blue chairs. When you are behind the red chair on the left, turn and enter the bathroom to the left. Stop inside the bathroom right in front of the sink facing the sink and mirror. ",
    "Enter house, walk across living room, turn left into bathroom. Stop at sink. "
  ],
  "path": [
    "595344b8d6a7471691be526b8b9d685f",
    "0acbbb92572f437faef8da9b991412f6",
    "35aade4482c04c1385cbb19c25bd1d7e",
    "091c189689a74ae3908ba76361e0cae0",
    "7a489c31ceb14eca8783e4f1d8dc1c41",
    "b6169d6b759547769509b4d781a8bff6",
    "69cbdf9fd3b64552b57887b813845cfa"
  ],
  "path_id": 2201,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04127785641945266,
  "num_matches": 1690,
  "direction_num": 6
},{
  "distance": 5.63,
  "heading": 4.925,
  "instructions": [
    "Go down the aisle of the church through the Nave towards the altar.  Stop between the second row of pews to the front. Wait there. ",
    "Walk to the front of the church aisle and stop when you get to the row of the second pews from the front. ",
    "Walk down the aisle toward the front.  Wait at the second row of pews. "
  ],
  "path": [
    "006933a75f764c5485cf284bea0ded0b",
    "d841f7b710f9470796d55561f8f524db",
    "01c80b5f8fbd4c969ee0bc03f1ec7a6c",
    "82ea5baa30f945fe98f6cad3064af847"
  ],
  "path_id": 4260,
  "scan": "YmJkqBEsHnH",
  "source": "R2R",
  "similarity": 0.08542410880543283,
  "num_matches": 1795,
  "direction_num": 3
},{
  "distance": 7.28,
  "heading": 3.062,
  "instructions": [
    "Exit the room and stop in the bedroom doorway, near the exit. ",
    "Exit the bathroom to the room. Turn left and exit the room using the door on the left. Turn right and go into the room next door on the right. Wait at the entrance. ",
    "Exit the bathroom and bedroom. Go right, and down the hall. Take the last right into the bedroom. Stop in the doorway to the bedroom. "
  ],
  "path": [
    "aaaee36fbfc94d26be1a858fceaa91dd",
    "e968c229f17d4600a704d6197473c5a4",
    "f0501ef281ab486eac400af37a580e19",
    "4e900e156c83453495bfdc9348369b9c",
    "1e013670f0ba4c9494734cedf464e11a"
  ],
  "path_id": 5100,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09455873380950122,
  "num_matches": 3453,
  "direction_num": 7
},{
  "distance": 6.61,
  "heading": 5.914,
  "instructions": [
    "Walk out of bedroom and turn left. Walk down to end of hall. Turn left into bedroom. Walk to bathroom and wait there. ",
    "Exit the bedroom and go to your left. Go into the next bedroom on your left. Stand in the entrance to the bathroom. ",
    "Turn around approximately 90 degrees, then move toward the wooden support pillar in front of you. Hang a slight left and move into the open wooden door frame. Turn slightly left and move into the bathroom. After you've entered, turn right and wait in front of the open shower curtain, facing it. "
  ],
  "path": [
    "ae97478ce1c84d5588244906fe089558",
    "6ce94e45a7eb4196a91c19d28f8f696e",
    "4650dea829764ab7bb1557f4fcb603f0",
    "5c10e79b2673419ebf8d0f84582961ab",
    "319ddb17492a4fcead1debf39bbafd95"
  ],
  "path_id": 1066,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.11138997336991274,
  "num_matches": 3572,
  "direction_num": 8
},{
  "distance": 11.89,
  "heading": 3.837,
  "instructions": [
    "Go down the stairs and turn right, heading towards the large doorway in between the two sides of the stairwell. Stop upon entering the room with the fireplace. ",
    "Walk down the stairs and make a right.  Walk across the room between the two grey couches.  Walk thought the large open doorway with mirrors to the left and right side of it.  Stop when you enter the room with the piano. ",
    "Walk down the staircase and towards the flower centerpiece in the lobby.  Continue past the table, and walk into the room with hardwood floors.  Wait behind the white couch. "
  ],
  "path": [
    "52d0bc7591a34dae8557db931cfabca6",
    "505e4b7e84284f5da963ff84b8bac44c",
    "82aa04ad31f640f09a9d7aa4a6fd224e",
    "fa60177899f4443c920a4f7c86f25643",
    "ad6d632f2967414abfcc9aedbc12c1cb",
    "e2191119aba24d3d9326ff49c302f1f8"
  ],
  "path_id": 6769,
  "scan": "VFuaQ6m2Qom",
  "source": "R2R",
  "similarity": 0.06526454094125297,
  "num_matches": 1520,
  "direction_num": 10
},{
  "distance": 6.44,
  "heading": 0.936,
  "instructions": [
    "Turn around and walk to to the right of the table before going through the right doorway next to the tea cart. Stop next to the first chair by the Christmas tree. ",
    "Go straight passed the table and go in the door on the right. Stop in front of the Christmas Tree. ",
    "Turn around, go through the entrance at the end of the table on the right, stop just in the doorway of the room at the first yellow chair. "
  ],
  "path": [
    "a6ba3f53b7964464b23341896d3c75fa",
    "c407e34577aa4724b7e5d447a5d859d1",
    "9f68b19f50d14f5d8371447f73c3a2e3",
    "150763c717894adc8ccbbbe640fa67ef",
    "7f21726e1efe494592c3278ce33cd622"
  ],
  "path_id": 7150,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.05237100561354262,
  "num_matches": 1930,
  "direction_num": 5
},{
  "distance": 11.81,
  "heading": 1.45,
  "instructions": [
    "Walk down corridor and turn right at second desk. Walk over and stand beside white dresser. ",
    "Walk through the office past the work tables. Go to the right and stop next to the white bookshelf outside the conference room. ",
    "Walk past desks. Walk past green floor vase. Wait at white bookshelf. "
  ],
  "path": [
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "caada625c5b4460da34bd695539db791",
    "77b24e884d9f47599994c1ade95f0b89",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "334f156071b34579ae4772f623b03429",
    "4ebc0f4d023c482ca72e8129ca042c13",
    "6855b783e2f34c7981b90ddb5de81bd7"
  ],
  "path_id": 313,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.06832003119154646,
  "num_matches": 2307,
  "direction_num": 6
},{
  "distance": 7.17,
  "heading": 3.341,
  "instructions": [
    "Walk up the stairs and turn right. Walk up the stairs and stop in the doorway on the left. ",
    "Go up the stairs. Step out of the exit doors on the left. Stop once you are outside. ",
    "Go up the stairs. Turn left and go out the glass doors on the left. Wait there. "
  ],
  "path": [
    "e0d208d8f64d48d59aa8a971c3892e29",
    "abfdc492f81e4b8e87837b26cde983a8",
    "ea33c2a8e88742e19afe11c54680c7e2",
    "accd06798cf84596ada8f0cbc36af696",
    "7f83a9b5299744cc8bc32be5d94108c0",
    "a09817a4c04d49d1b8f2badabb7692ae",
    "fc9b08fa1b5b486380466b40b1d633f6"
  ],
  "path_id": 5674,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.046902361959622836,
  "num_matches": 1853,
  "direction_num": 5
},{
  "distance": 15.22,
  "heading": 6.19,
  "instructions": [
    "Turn around and walk through the hallway between the windows. Walk down the steps and turn slightly right. Walk across the room and enter the middle doorway. Wait there. ",
    "Exit the room. Go straight into the room and turn right. Go into the door in the center and wait in the hallway. ",
    "Walk through the narrow doorway between the two glass pane windows. Continue into the next room with a large floor rug and arm chairs around the room. Walk past the couch in the middle and past the music box. Walk through the arched window door in the middle of the wall ahead and stop in the hallway. "
  ],
  "path": [
    "5e65c1a2439f4594b4a433c805221c05",
    "be255b95116f48599c036544957334ec",
    "764cb58a8d31461892ca6bdc675c14df",
    "9f6684e165434894a5185bb5c3e2c275",
    "8e0a04db99fd4c61a9f669d2e6e421a8",
    "994e59a2e5cb469eb29c7ff68c6d49c2",
    "bde29f48ab814943baf4a7193d143d6e"
  ],
  "path_id": 5380,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.06988964765390189,
  "num_matches": 2752,
  "direction_num": 6
},{
  "distance": 13.78,
  "heading": 5.094,
  "instructions": [
    "Walk up the stairs and through the middle of the room past the desks and chairs. Stop by the ping pong table. ",
    "Walk across main work room. Stop at ping pong table. ",
    "Walk forward through the middle of the room. Stop near the ping pong table. "
  ],
  "path": [
    "9a0c4ca175e74e0aa31c73c3c82519dd",
    "cd504d23d03944a8bef4e4d8c4975cdc",
    "caada625c5b4460da34bd695539db791",
    "77b24e884d9f47599994c1ade95f0b89",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "334f156071b34579ae4772f623b03429",
    "6944cb3d349a424899b2ed5b4c972763"
  ],
  "path_id": 5092,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.057179859828550304,
  "num_matches": 1792,
  "direction_num": 2
},{
  "distance": 9.62,
  "heading": 4.75,
  "instructions": [
    "Go through the entryway to the right and continue passed the couch to the other entryway. Then turn right again and go into the next room stopping in front of the chair. ",
    "Go right into the doorway. keep going into the next doorway by the pink chair. Keep going towards the right until you come to a room with a blue carpet. ",
    "enter room with christmas tree, walk across room between two chairs turn right at stairs and enter sitting room, stop on circle rug. "
  ],
  "path": [
    "b411496c1f7b403981f0c2f24995309c",
    "150763c717894adc8ccbbbe640fa67ef",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "267a7e2459054db7952fc1e3e45e98fa",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "50e0cf4daca44c7a9e2a6f6475650ca3"
  ],
  "path_id": 2073,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04548573947010625,
  "num_matches": 2143,
  "direction_num": 6
},{
  "distance": 6.03,
  "heading": 3.812,
  "instructions": [
    "Turn to your left and go across the room to the other side of the bed. Stop at the foot of the bed with the table to your right. ",
    "Exit the bathroom then turn left. Go past the bed and wait near the small round table with the chairs. ",
    "walk away from bathroom straight past bed,turn left to walk past foot of bed stop at the wood barrier. "
  ],
  "path": [
    "87e7b6f2006541a9abe57fba18294a0c",
    "8078fc4f547a4a9cb1a6bb036cc18dc9",
    "cb070d66db084a79b553310df69ed31d",
    "560d4bedd6714e57b4acfe27bbc4a01b",
    "b0a4ed482e7b4f8eb499f3a999f65933"
  ],
  "path_id": 4576,
  "scan": "Pm6F8kyY3z2",
  "source": "R2R",
  "similarity": 0.051064252014727654,
  "num_matches": 1954,
  "direction_num": 8
},{
  "distance": 14.84,
  "heading": 2.667,
  "instructions": [
    "Cross the pink carpet and go through the first door on the left. Exit the building through the middle set of doors on the left and stop on the veranda halfway to the steps. ",
    "Walk into the room on the left. Walk out the door on the left and wait on the porch. ",
    "Turn slightly left and enter the doorway closest to you on the right. Walk towards the blue carpet and turn slightly left again. Enter the middle doorway going outside. Wait there. "
  ],
  "path": [
    "266e6bf3657149d8a116533e34e6ebf8",
    "0b4d4c11e012429e8dd6013502094ef3",
    "4e9e9f69704e4a55a0d48117bb06a343",
    "1ad73ac43096496f9b6084071d1d944f",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 1645,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07591869680263537,
  "num_matches": 3572,
  "direction_num": 8
},{
  "distance": 6.49,
  "heading": 3.531,
  "instructions": [
    "Walk across kitchen towards stove. Turn hard left at the edge of the counter. walk towards table and chairs and stop before them. ",
    "Facing the sink walk forward between the counter on your let and the island counter on your right and take a  eft past the end of the counter into the dining room and walk towards the dining room table stopping next to the second pillar on your right. ",
    "Walk straight, then turn left and exit the kitchen. Walk toward the dining table and chairs. Stop and wait by the chairs. "
  ],
  "path": [
    "847b1be0f7fc42f2b4c4452cea609ba6",
    "8679745ae3664caaa179ae3f77fac576",
    "22ada32fdb2d40e78406cb0f9cff149b",
    "09319257828f47e6828352078f34d855",
    "ca2a1110dcfa4449a6cd735d6cfb9402",
    "d2040fe496a245c3bae20b84ce63083a"
  ],
  "path_id": 610,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.06005409221775145,
  "num_matches": 1660,
  "direction_num": 10
},{
  "distance": 9.66,
  "heading": 5.749,
  "instructions": [
    "Go up the last few stairs and turn right. Go up the next two flights of stairs and wait. ",
    "Walk up the rest of the stairs, then continue up the next set of stairs.  Stop at the top of the stairs near the potted plant. ",
    "Go up the stairs then turn right and go up the other stairs on the right then turn right and go up the other stairs on the right and stop at the top of the stairs. "
  ],
  "path": [
    "50a28bec19bd4ad5ab3c97f58554599a",
    "484070b0ecd942cc882f77f5fee5ca9a",
    "558c07ff6d6d4d268f6c8de7abd76d1d",
    "cb6b9124a9594b4788966d28129cf531",
    "090a8663beeb4ce6aeadfe720ea0c8e9",
    "4d76fa50a0e743e695fb048b4a7766d5",
    "35b1214591eb4a43a3f85d63973d43a5"
  ],
  "path_id": 3522,
  "scan": "pRbA3pwrgk9",
  "source": "R2R",
  "similarity": 0.09808552270724126,
  "num_matches": 1783,
  "direction_num": 5
},{
  "distance": 6.15,
  "heading": 2.258,
  "instructions": [
    "Go down the stairs, past the Christmas tree on your right, and wiat facing the room with the fireplaplace. ",
    "Walk down the stairs, when you reach the bottom stop at the christmas tree. ",
    "Turn around and go down the stairs. Walk forward and stop in front of the CHristmas Tree. "
  ],
  "path": [
    "bec7a60657d6483996aa2f0d03b9d691",
    "80befc44c6d14348a3f9bda8ba719d70",
    "024edcc6db70425aaa54f5596b0ebda8",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "41873d3929e64a9a938a5fac3b6bbd79"
  ],
  "path_id": 286,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04184867207819885,
  "num_matches": 2097,
  "direction_num": 6
},{
  "distance": 8.16,
  "heading": 3.008,
  "instructions": [
    "Go up the stairs, stop two steps to the top. ",
    "Come up steps to landing, turn left and continue up steps. Stop at the top of the stairs gazing at beautiful chandelier. ",
    "Turn around and walk up the stairs. Wait at the top of the stairs. "
  ],
  "path": [
    "e87f560e1b5a497487526e64db42f8c8",
    "fd263d778b534f798d0e1ae48886e5f3",
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 3806,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03993596353642128,
  "num_matches": 1976,
  "direction_num": 1
},{
  "distance": 10.89,
  "heading": 3.162,
  "instructions": [
    "Walk through the double doors and turn left. Continue through another set of double doors. Wait in front of the circle railing in front of the stairs and between the large columns. ",
    "Follow red carpet, turn right at chandileir, wait at top of stairs. ",
    "Walk away from the semi circle of chairs through the doorway, follow the red carpet to the left, pass the fire extinguisher on your left and follow the red carpet until there is a staircase on your right. Stop at the top. "
  ],
  "path": [
    "9b23d010ac534ef190be38b9ab781a99",
    "bacce49c6f02481aaa803430d8699cee",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "744eba592017466eab0da528e0cfdf7c",
    "c55fa077761c4154af4b26da88eee80d",
    "5be145994f974347850a48cecd04cdcd",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 2735,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.038137144082028375,
  "num_matches": 1945,
  "direction_num": 5
},{
  "distance": 8.28,
  "heading": 3.341,
  "instructions": [
    "Go down the stairs and take a left. In the sitting room take another left and go into the changing room. Stop in the doorway of the changing room. ",
    "Walk down the stairs and make a left then make a left in the sitting room. Go straight back to the doorway of a small room and wait. ",
    "Go down the stairs and turn left. Turn left again to go through the doorway to the room with the white covered chairs. "
  ],
  "path": [
    "e0d208d8f64d48d59aa8a971c3892e29",
    "b99113566bdc4b3e8937225e42421488",
    "8d27cd9bb3884465a9c48ad38fde69fd",
    "28170cad00aa4938a612db2e82628000",
    "d807887a425a41249a31c69a41adb313",
    "46e170296a7f4b88b50ebeb7e2a27894"
  ],
  "path_id": 1527,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.09287224859730192,
  "num_matches": 5826,
  "direction_num": 10
},{
  "distance": 13.47,
  "heading": 6.143,
  "instructions": [
    "Go straight and pass the chairs and the large mirror on the right then turn right and head toward the stairs. Wait on the second step to the top. ",
    "Walk forward, past the sitting area and follow the red carpet into the next room. Following the red carpet, turn right and then left. Wait at the top of the stairs on the right. ",
    "Go into the next room with the lit chandelier. Go to the top of the staircase in that room. "
  ],
  "path": [
    "8f2fdc0067f64a15b2efec9cc0b773e5",
    "f0244e1e73e34c6997e25f07e9b42328",
    "e2f7333559be465d94798c1940b2e582",
    "248492258fd5435c8276f59f63ddf0ef",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 3678,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.034195467978156625,
  "num_matches": 2087,
  "direction_num": 8
},{
  "distance": 10.47,
  "heading": 4.947,
  "instructions": [
    "Head out of the bedroom and turn right going past the railing.  Go left through the double doors and stop in front of the bed. ",
    "Exit the bedroom from the door nearby behind, then turn right and go down the hallway. Enter the set of double doors on the left leading to the bad and open balcony. ",
    "Leave the bedroom and turn right in the hall. Turn left through the french doors after the railing. Walk to the foot of the bed and stop. "
  ],
  "path": [
    "fa437e33b5414c09a3e524ffbc183502",
    "7d4994043088423aa682052ece9719b0",
    "9a99ebf7c9e947229e4546d8b30040b9",
    "f3d04dad3ca84d0c91d16f4d8970bb50",
    "74be0bce40ab4a599a7172c8bef59304",
    "96ba4272d14444f7a40b1f7c633f2024",
    "ef1bed677e2545629b7b68cf4d181d18"
  ],
  "path_id": 7169,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.06159216468464225,
  "num_matches": 1681,
  "direction_num": 8
},{
  "distance": 8.29,
  "heading": 1.774,
  "instructions": [
    "Go left along the bookcases, and stop when there is the second beam on the railing to the right. ",
    "walk down long walkway with books on your left and banister on your right, stop in front of section of old blue books. ",
    "Turn left and do down the walk way with the book shelves on your left. Walk just past the second pole going to the ceiling from the hand rail and wait next to the book shelf with the 5 shelves of blue books. "
  ],
  "path": [
    "dc3170aacd3f40f2ac2f5b726bd75b88",
    "6c47cd8bd2664281bec3740c473946f8",
    "128f2cd37ef241cea64bc179a8be82ae",
    "b1242fb861d84f088b13240a5fe3ccb1",
    "759c8882206a456fb163093de8c0abcc",
    "4dbad4e837894372bf2dcefe5fa85cde",
    "be686c9f317c40469fa7d4b638023726"
  ],
  "path_id": 4457,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.03796772979313529,
  "num_matches": 1761,
  "direction_num": 9
},{
  "distance": 9.13,
  "heading": 2.86,
  "instructions": [
    "Walk straight into the kitchen. Go through the kitchen until you get to the fridge. Before you get to the fridge turn right. U turn left and go into the hallway. Wait there. ",
    "Turn left to enter the kitchen walking toward the fridge. Turn right to exit kitchen and make immediate left. Stop at first doorway and turn left to enter bathroom. ",
    "Walk into the kitchen and turn right at the end of the island. Walk out of the kitchen and make a sharp turn left. Stop just inside the bathroom. "
  ],
  "path": [
    "e58daa54fe36484984da0fc3e209ee39",
    "a885c9f037fe45cfbf053e98e4e3d205",
    "e3eeb7b8deed4a2fa0000daec3538b75",
    "f4032225a0c6462ba02f728d031c2638",
    "7025038ba12d4a63a40c866489226fbe",
    "a9366b89465a49028782a840a165a7e8",
    "2f20259787124d7e8a85408cd5767c65"
  ],
  "path_id": 5685,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.07315333741643847,
  "num_matches": 1966,
  "direction_num": 9
},{
  "distance": 9.72,
  "heading": 0.164,
  "instructions": [
    "Exit bedroom, make a left, walk toward next bedroom and stop at door. ",
    "Turn right and exit the room. Once out, turn left and walk down the hallway. Once you pass the 2 brown chairs on your left, turn left and enter the door and stop. ",
    "Stepping between the couch and the bed heading toward the open door. At doorway make a left and your next immediate left across from the bathroom stopping just inside of doorway. "
  ],
  "path": [
    "ca38c3e0cbcf4a4992d79889e5793cb7",
    "2754c89e3b2645d598ace5d7878f5d13",
    "980150b99a2946a0894c33df8fb616d2",
    "e5c5d8fa1ad94d97bcdb74e69e938ea0",
    "de68d1221d1749b392aff06c48512cf0",
    "99fa48d974fa43988f369b0e5766b36e"
  ],
  "path_id": 5501,
  "scan": "1LXtFkjw3qL",
  "source": "R2R",
  "similarity": 0.1018638204255104,
  "num_matches": 3722,
  "direction_num": 8
},{
  "distance": 11.48,
  "heading": 4.524,
  "instructions": [
    "Turn left ninety degrees.  There is a large table in front of you.  Walk towards the table.  Stop before you get to the rug.  Turn thirty degrees to your right.  Walk towards the doorway.  Stop in front of the food warming station.  Turn twenty degrees to your left.  Walk straight until the doorway is on your right.  Turn ninety degrees so that you are facing the open doorway.  Walk through the doorway.  Stop when you are halfway down the hall.  There is a large staircase in front of you. ",
    "Walk across room to exit at double doors. Wait at door to bathroom. ",
    "Turn left and walk through the dining room. Go through the double doors and wait in the hallway. "
  ],
  "path": [
    "c645fc0e7e2a488fbed3580e98bd041e",
    "8b22751d94034268b26b9960c1d28e4e",
    "faddc614417b4861b4cd05176a35b947",
    "babbef7305e34152950788aa9cb363cc",
    "60399cb6fd9d42a7a364f155fd152361"
  ],
  "path_id": 4608,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.053637108499062655,
  "num_matches": 2322,
  "direction_num": 9
},{
  "distance": 9.53,
  "heading": 2.733,
  "instructions": [
    "Turn and enter the living room area. Go past the table and sofas and stop in the foyer in front of the front door. ",
    "Turn around and exit the room. Walk around the sofa and enter the hallway. Wait by the side table. ",
    "Exit the room through the doorway nearest you, and continue into the adjacent room, exiting the room via the exit to your left. "
  ],
  "path": [
    "181c56d99ddd42ba8d4be09dbb135381",
    "dc9eb48ee3324792889cc391d6d4098c",
    "84928b00abef4a8489bcaa2ce410d1e5",
    "370411a65c3d4dc8bd475805ad0f4195",
    "f53ff13e8a954c67bda9a46f3e2e88b8",
    "8b8c58d65b3049ef8a844f237096b06d",
    "1d8256878b534440b5ba54b31bfb210b"
  ],
  "path_id": 6809,
  "scan": "S9hNv5qa7GM",
  "source": "R2R",
  "similarity": 0.07071368059575371,
  "num_matches": 1674,
  "direction_num": 2
},{
  "distance": 14.58,
  "heading": 3.819,
  "instructions": [
    "Turn around and go by the pillars. Keep going straight and then turn left and go by the fan. ",
    "Walk between the tall marble pillars. Follow the walkway to the left then head towards the metal floor fan towards the right. Stop before the floor fan. ",
    "Go through the pillars to your right  Turn left to  walk through the room to the left of the four chairs. Stop once you are left of the chairs. "
  ],
  "path": [
    "15d5b6a9851746e79e53e7451e1b2528",
    "3e18ef6d21744a9f884a6b148c0d63ac",
    "502ebb6c5a214d6394d2bb294d7e2886",
    "91b89c02a03d48c891bee19a49350f8c",
    "2094de1e2c934d9ca603a405739df547",
    "3c88cda1e8444d1e8687e05a16856c16"
  ],
  "path_id": 6660,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.09333387672378747,
  "num_matches": 7538,
  "direction_num": 10
},{
  "distance": 8.42,
  "heading": 2.975,
  "instructions": [
    "Go past the pink chairs and the light blue chairs and go into the room on the right and wait by the chair with the flowers. ",
    "Go into the room filled with lounge chairs and then go through the big archway, take a right into another archway, take a step into the room and wait. ",
    "Turn around and walk straight, in between the two pink chairs. Take a right after the blue chair on the right. Walk into the sitting room and wait by the first chair on your right. "
  ],
  "path": [
    "150763c717894adc8ccbbbe640fa67ef",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "267a7e2459054db7952fc1e3e45e98fa",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "50e0cf4daca44c7a9e2a6f6475650ca3"
  ],
  "path_id": 2789,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.0409904256444573,
  "num_matches": 1566,
  "direction_num": 7
},{
  "distance": 10.47,
  "heading": 3.636,
  "instructions": [
    "walk away from the chair, past the bed and through the doorway, turn right in the hallway continue straight walk through the doorway on the left, enter the bedroom and stop on the carpet. ",
    "Go to the bedroom with the large leather headboard and floral rug. ",
    "Turn right and exit out the double doors. Once out turn right and walk along the railing and turn into the first door on your left. Stop once you are in the door looking at the large wood cabinet. "
  ],
  "path": [
    "ef1bed677e2545629b7b68cf4d181d18",
    "96ba4272d14444f7a40b1f7c633f2024",
    "74be0bce40ab4a599a7172c8bef59304",
    "f3d04dad3ca84d0c91d16f4d8970bb50",
    "9a99ebf7c9e947229e4546d8b30040b9",
    "7d4994043088423aa682052ece9719b0",
    "fa437e33b5414c09a3e524ffbc183502"
  ],
  "path_id": 2350,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.06530109501521698,
  "num_matches": 1796,
  "direction_num": 7
},{
  "distance": 5.46,
  "heading": 3.295,
  "instructions": [
    "Walk into the building and turn right. Walk down the steps. Stop on the second step from the top. ",
    "Walk through the doors an turn right. Stand at the top of the stairs. ",
    "Enter the house and veer right. Go down the stairs. Stop on the second stair from the top. "
  ],
  "path": [
    "9c499278de0249879d9aaa4e6c15c5c4",
    "08b7967373ca471e8b00cc96a3e8e2c1",
    "124bc48ce96a4c9a8986a915dc9f93eb",
    "18b3ba6951f643c89caceda38f7c5404",
    "a09817a4c04d49d1b8f2badabb7692ae",
    "7f83a9b5299744cc8bc32be5d94108c0"
  ],
  "path_id": 6959,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.04915135054127862,
  "num_matches": 1863,
  "direction_num": 5
},{
  "distance": 13.19,
  "heading": 3.008,
  "instructions": [
    "Walk down the stairs and turn into the second door on the left. Stop next to the fireplace. ",
    "Walk down the stairs, turn left, enter the doorway on the right side of the grandfather clock. Wait near the fireplace. ",
    "Walk down the stairs to the bottom, then turn left.  Walk past the  clock and enter the room on the left. Stand next to the fireplace. "
  ],
  "path": [
    "e87f560e1b5a497487526e64db42f8c8",
    "3c9615b3193a4e71ae932ea45fef8dde",
    "3f75b2d4af4d4afd85666d4c1302008c",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "b4e027328a1b492e85e269df23fef364"
  ],
  "path_id": 4017,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.044772086079224865,
  "num_matches": 2183,
  "direction_num": 9
},{
  "distance": 7.28,
  "heading": 4.886,
  "instructions": [
    "Go left out of the bathroom the go in the first door on the left down the hallway. Go right into the bathroom and stand in the doorway. ",
    "Exit the room and keep walking. Turn left entering another room. Make a slight right turn near the bed and stop in front of the toilet bowl. ",
    "Go into the hallway and then go left, then go into the first room on your left, next turn right and stop in the doorway to the bathroom. "
  ],
  "path": [
    "1e013670f0ba4c9494734cedf464e11a",
    "4e900e156c83453495bfdc9348369b9c",
    "f0501ef281ab486eac400af37a580e19",
    "e968c229f17d4600a704d6197473c5a4",
    "aaaee36fbfc94d26be1a858fceaa91dd"
  ],
  "path_id": 1032,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.08065596674237105,
  "num_matches": 3089,
  "direction_num": 9
},{
  "distance": 20.79,
  "heading": 5.498,
  "instructions": [
    "Walk straight all the way down until you get to the third window from the left. Wait there. ",
    "Turn slightly right and walk across the carpeted room. Wait by the third window of four counting left to right,. ",
    "Go straight through room the right side. Stop at the second window from the right on the wall straight ahead. "
  ],
  "path": [
    "b551670325194c5daf5a1a230d164734",
    "d923642e556045c793d530b609504b14",
    "52474bda7e7043e1be591bea75e3b3ff",
    "266d088e5b444c7ab90cec89ead1a8a0",
    "585d35a46dd644daad1a135634207b99",
    "53608606748f45c5a69723f062f1baa3",
    "266e6bf3657149d8a116533e34e6ebf8"
  ],
  "path_id": 5909,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.04363039640768159,
  "num_matches": 1727,
  "direction_num": 10
},{
  "distance": 6.16,
  "heading": 4.579,
  "instructions": [
    "Walk past the bed and toward the desk and table. Stop just outside the bathroom. ",
    "Go past the curtains in front of the bed and past the minibar. Turn right and stop at the door to the bathroom. ",
    "Go straight passed the bed and turn left passed the desk. turn left again and stop in front of the door. "
  ],
  "path": [
    "1dd50bf3662244b68314b8400ebb66b6",
    "087babe565fd471381ae7adbf938f5fc",
    "0a709d588fcd4ae5badd921366074d7a",
    "7a920bf869fd41099e44a0829f818361",
    "71f79f342cde467ba037a196c4e04f6a",
    "6ca411a8612d4a569362c6231dcf1b68"
  ],
  "path_id": 6028,
  "scan": "HxpKQynjfin",
  "source": "R2R",
  "similarity": 0.06687798989246373,
  "num_matches": 2083,
  "direction_num": 7
},{
  "distance": 5.71,
  "heading": 0.857,
  "instructions": [
    "Exit the room. Turn right. Turn right again to go into the room next door. Wait at the entrance. ",
    "Exit the bedroom, turn right and then take a sharp right into the brown doorway and stop. ",
    "Exit bathroom, make a right, make a other right and enter bedroom and wait. "
  ],
  "path": [
    "8e649a3c097141978c621893e8b2ed9f",
    "22f85dac33524c6889f80fa7e76a6790",
    "cf4babf2d24a44418351494fa1cb5ebf",
    "9224c582bc934d6ab146f7e624b0bab7",
    "5ca14589a7c4407b9333c3dc02d9c9a5"
  ],
  "path_id": 5730,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12380999967954946,
  "num_matches": 3632,
  "direction_num": 6
},{
  "distance": 12.28,
  "heading": 2.615,
  "instructions": [
    "Turn around and walk past the table. Wait in front of the large double doors at the end of the table. ",
    "Turn around and go across the room to the large wooden entry way on the opposite side. ",
    "Turn around 160 degrees. Walk straight across the room past the dining table. When you get just past the end of the table, turn slight right, then a quick slight left and continue straight until you are standing in the center of the doorway. "
  ],
  "path": [
    "76869bdceadf4abf9d834fc7c9bbf2f5",
    "37ff2e51c319423fb5ea58a67b13f388",
    "74e7d3ed76fe40b8a0d2ea19aaf4196c",
    "630f0ee6e8db4d518e31d932d2c5ea4c",
    "8b22751d94034268b26b9960c1d28e4e"
  ],
  "path_id": 4485,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.11665085431647046,
  "num_matches": 5281,
  "direction_num": 7
},{
  "distance": 15.32,
  "heading": 1.791,
  "instructions": [
    "Turn left and walk toward the opposite wall. Enter the doorway on the far left of the wall. Wait there. ",
    "Walk in front of, and past the stairs. Turn into the last doorway on your right. Stop in the hall with a door on your right and left. ",
    "Facing the side of the open staircase, go through the opening on the opposite wall from you and almost all the way to the left.Stop when you reach the four way intersection halfway between the room you just departed and the room ahead. "
  ],
  "path": [
    "8d01d3df74ea481bb82fd00f4ae6bae7",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "f5bef118db5b41849ce63cbfcefed938",
    "0cb7f98845aa4939a1125d430acb7183",
    "73de1f780b804c92a2441ac92c442c49",
    "b6bcf908137f4b2d83d66e5fe6c35656"
  ],
  "path_id": 3565,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07631625316510403,
  "num_matches": 3226,
  "direction_num": 7
},{
  "distance": 8.1,
  "heading": 3.355,
  "instructions": [
    "Walk past the tables in the center of the room. Wait at the stair landing to the left of the gold table lamp on the right. ",
    "Walk straight past the table and chairs. Go straight until you get to a statue on the left. Wait there. ",
    "Leave the library, and go down the stairs. Stop on the first step. "
  ],
  "path": [
    "3ad040847d7c48788baf889755ecf33c",
    "e42a8231f4364b629cecd35d58c43635",
    "ceed635a9b804a13a8db5fd5cd755281",
    "4610dfb32d044ad793cf8640a7ede0f4",
    "c09569d9a442483ab65364b18a438d1a",
    "082f6f6ac7c241669643586b39ce562b",
    "f324c5a2e85c4957ae6b9073581f3452"
  ],
  "path_id": 5641,
  "scan": "D7G3Y4RVNrH",
  "source": "R2R",
  "similarity": 0.04156998199659577,
  "num_matches": 1611,
  "direction_num": 8
},{
  "distance": 8.36,
  "heading": 5.524,
  "instructions": [
    "Go straight and pass the pink chairs then pass the light blue chairs and turn slightly left. Go into the door that is left of the colorful lamp and wait by the rocking chair with the flowers. ",
    "Turn around and exit the room through the large entry way on the left side of the room. Once out turn right and enter the room with the red couch. Enter the room and stop right in front of the fireplace. ",
    "Walk and make a left turn. Then turn right to enter a room with purple and white sofas adjacent to each other. Stop at the white patterned chair. near the fireplace. "
  ],
  "path": [
    "7f21726e1efe494592c3278ce33cd622",
    "59b190857cfe47f691bf0d866f1e5aeb",
    "267a7e2459054db7952fc1e3e45e98fa",
    "11d09ac7978b4086b4f343aeb01dedb9",
    "50e0cf4daca44c7a9e2a6f6475650ca3"
  ],
  "path_id": 2210,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.04603672728250201,
  "num_matches": 1740,
  "direction_num": 8
},{
  "distance": 13.23,
  "heading": 1.787,
  "instructions": [
    "Walk out of the bathroom into the living room area. Walk past the blue and red arm chairs. Walk up to the staircase beside the Christmas tree. Walk up the stairs to the top of the staircase. ",
    "Leave the bathroom and turn right.  Walk past the blue chairs and up the stairs by the Christmas tree.  Stop at the very top of the stairs. ",
    "Exit the bathroom. Turn right and go straight past the light blue chairs and the Christmas three on the left. Go up the stairs and wait at the top. "
  ],
  "path": [
    "69cbdf9fd3b64552b57887b813845cfa",
    "b6169d6b759547769509b4d781a8bff6",
    "124c7635126f4fefaf3c57742dbe1193",
    "61aa57f78ebf40dd9bc04e27b1a4c80f",
    "024edcc6db70425aaa54f5596b0ebda8",
    "f17bd928d5c84ebbb4d2d8806682f4af",
    "be3d7ae0352d481191e4c9e351e71b08"
  ],
  "path_id": 5553,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.038342927869381885,
  "num_matches": 2267,
  "direction_num": 7
},{
  "distance": 5.5,
  "heading": 4.451,
  "instructions": [
    "Enter bedroom. Walk into bathroom on left. Stop at sink. ",
    "Walk into the bedroom that is right of the tapestry.  Walk past the bed and walk into the bathroom.  Stop after passing through the doorway. ",
    "Go through the door with the plaque reading \"Sunset Room\", then turn left and go into the bathroom ahead and to your left. "
  ],
  "path": [
    "6249652893364b62b1c30df6c6516a71",
    "aaa8773c86214e9990d4c3ede3223499",
    "62994d72dab246fbb839f3699b9cacd6",
    "4f1ecaca2cc744b0beb75e146bc8ecc7",
    "c20f8e6497d14696b2cecf24ed288470",
    "1e05b7a24e664d3f98f3498d911bc48a"
  ],
  "path_id": 3176,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.059551725620043565,
  "num_matches": 1946,
  "direction_num": 5
},{
  "distance": 5.42,
  "heading": 1.004,
  "instructions": [
    "Exit the bathroom. Walk past the bed and exit the room using the glass sliding doors to the balcony. Wait there. ",
    "Exit the bathroom and head outside through the glass door in the bedroom.  Wait on balcony. ",
    "Leave the bathroom and walk straight past the foot of the bed and onto the patio.  Stop after stepping onto the patio. "
  ],
  "path": [
    "9d965dc650ea4edb84cbfe672d10befc",
    "797892fe2c154f389c03ff6e055eca25",
    "d0b8e8e2ffa645f39d418a32c6cfb695",
    "b3191aeb9a224993b6dd549b8d6a732b",
    "39a03200d75141b79e1f306fcca75c46"
  ],
  "path_id": 5842,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.1358275279538689,
  "num_matches": 1658,
  "direction_num": 3
},{
  "distance": 16.02,
  "heading": 0.874,
  "instructions": [
    "Climb the stairs and stop at the blue dot. ",
    "Go up the step.Take a left to the left of the table. Go towards couch and stop. ",
    "Walk upstairs, turn right, walk all the way across the dining room into the next room and wait in the small seating area by the rug. ",
    "At the top of these stairs walk straight past the large dining table and into the seating area located at the end of the room. "
  ],
  "path": [
    "ed2d5dadd1994487a5815fb8126bf80f",
    "2b4b62ead49b4f14a013f85816012a12",
    "4ad533e309ca4c61856c953afb7876b6",
    "5fe381d0097f4d0e8124dfbbee82e54f",
    "ce5df3235866447d95c4667d72528984",
    "21dd8e71dae64f378401cb0eba702b7d",
    "ae6753634fdb45d4aba7bd2973273c17"
  ],
  "path_id": 724,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.06672845613558627,
  "num_matches": 1618,
  "direction_num": 6
},{
  "distance": 9.87,
  "heading": 5.339,
  "instructions": [
    "Walk straight and wait just outside the front door. ",
    "Walk forward down the porch. Stop in front of the main entrance. ",
    "Walk forward until you get to the main entrance. Wait there. "
  ],
  "path": [
    "4ab710f16a804ee7b525322add24f9bb",
    "e40a12cfb5bc4f4dab071ec7458d378c",
    "7b8e2f039e884764bd1ad6cbc13d9bd0",
    "1aba6e328b4d4211900d8296b88f6127",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 7254,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.055294845676997696,
  "num_matches": 1998,
  "direction_num": 4
},{
  "distance": 13.74,
  "heading": 5.176,
  "instructions": [
    "Walk outside and past the four chairs on the deck.  When you get to the table, turn left and stop in the doorway of the room with the fur rug. ",
    "Go outside and walk to the left of the pool. Turn into the last room on the left. It's the room with a glass desk and two gray rugs. Stop in the doorway. ",
    "Go out onto the patio and walk past the pool. Enter the office through the door on the far left. Stop in the doorway. "
  ],
  "path": [
    "dbfa6331cdc2481ca6c104ead7344e72",
    "3eb5a1587c244eebba6d63748a57b9ad",
    "aa5bf4cd5d0448bf8be5f5dbc0b53fe3",
    "c75f71faa8b74a8eb875731b3dbe6183",
    "4848ed4db295441c8722127d3df1c8c1",
    "6536cc05bf45478aa2aceaa3bc575b61",
    "6a2ce6dc04294e55af92a617d00fc4aa"
  ],
  "path_id": 3408,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.08796139007876067,
  "num_matches": 1754,
  "direction_num": 6
},{
  "distance": 7.3,
  "heading": 4.629,
  "instructions": [
    "leave sitting room, jump the ropes and stop at top of stairs looking toward chandelier. ",
    "Walk out of the sitting area and go the stairs. Go down one stair to the second from the top and stop. ",
    "Go around the table and head towards stairs that lead down. Walk a little forward towards the chandelier and wait at the stairs before going down. "
  ],
  "path": [
    "aea65d3bc7c34d019bf5bc3b0b27fab4",
    "adcc15e35b9441139036aeefda56e0a4",
    "fd433ad8502149ec849c4c51bb989e4a",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 297,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.05440311393465112,
  "num_matches": 2689,
  "direction_num": 6
},{
  "distance": 9.86,
  "heading": 3.09,
  "instructions": [
    "Walk left between couch and chair to kitchen, turn left and walk around counter, go right past the refrigerator, wait there. ",
    "Walk straight toward the kitchen. Stand near the fridge. ",
    "Walk towards the refrigerator. Stop to the left of the refrigerator. "
  ],
  "path": [
    "550d66ef28114bef8525d3a2d6db9cd2",
    "5186e9da9b4248318f4a7ae68d11da15",
    "f032c9ee981a4462914468785f0a4abe",
    "62e602fc5b85463dbd8f48ba625d05ef",
    "1e951fdbfd9d45bbaf935da945f5425c",
    "814d9aba371640e5a70bcb7833bfe08f",
    "ca75317572dc44509427cf7b2caecda6"
  ],
  "path_id": 5122,
  "scan": "8WUmhLawc2A",
  "source": "R2R",
  "similarity": 0.057284881012887,
  "num_matches": 1958,
  "direction_num": 7
},{
  "distance": 12.87,
  "heading": 3.892,
  "instructions": [
    "Walk straight, take a sharp right turn and continue down the corridor before making a slight right turn to the top of the steps. ",
    "Walk past the fireplace, turn right and walk into the next room.  Walk to the middle of the room and turn right and walk to the edge of the stairs. ",
    "Pass the fireplace on your right. Take a right. Go down the hall. Cross the room and go to the top of the stairs. "
  ],
  "path": [
    "3cc9bafe56fb420eadcf448799df8546",
    "cd680b57443748fcae2de7c8e39970ad",
    "f53e378ee8fa4edc8cbf2ffcb4a99899",
    "744eba592017466eab0da528e0cfdf7c",
    "c55fa077761c4154af4b26da88eee80d",
    "5be145994f974347850a48cecd04cdcd",
    "79aedad1206b4eea9c4b639ea2182eb7"
  ],
  "path_id": 6511,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03607595355163541,
  "num_matches": 1844,
  "direction_num": 10
},{
  "distance": 12.09,
  "heading": 0.212,
  "instructions": [
    "Walk to the right of the fireplace and go into the first room after stepping on the blue carpet.  Walk through the bedroom and past the green counter top.  Walk through the door to the bedroom on the left.  Stop after stepping into this second bedroom. ",
    "Walk to the right of the fireplace and into the first room on the right. Wait in the doorway to second bedroom. ",
    "Go straight and slightly right to go into the hallway. Turn right and go into the room. Turn left and go into the room next door. Wait near the wardrobe. "
  ],
  "path": [
    "527e84fb77e44497b62e5b8b2a41fd53",
    "61fbdce455e0426db9e95c4d86e8e028",
    "a0aeade23ab74a5f93544047c19718e8",
    "cc7f149e59eb47fd8bde336f2bf3391d",
    "7c8bb5c8b95941359d5f20d3b4f7eca1",
    "eb9ebc006f78472b92fa252c47715a3a",
    "b533c9d2c25b4b10afa49cb37910ccda"
  ],
  "path_id": 5794,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05216942163687925,
  "num_matches": 1808,
  "direction_num": 9
},{
  "distance": 6.18,
  "heading": 2.977,
  "instructions": [
    "exit bedroom to hallway, turn left and go straight down hall to open door, stop in doorway facing christmas tree. ",
    "Turn left and go down the hall. Go through the door at the end of the hall and stop in the doorway. ",
    "Exit the bedroom and move down the hallway, past the fire extinguisher and Christmas tree. Continue forward and stop in the doorway that is marked Master Suite. "
  ],
  "path": [
    "62994d72dab246fbb839f3699b9cacd6",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641"
  ],
  "path_id": 334,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.10650896837793442,
  "num_matches": 2506,
  "direction_num": 8
},{
  "distance": 9.28,
  "heading": 3.171,
  "instructions": [
    "Walk to the top of the stairs. Walk down the stairs and make a sharp turn right. Walk down the stairs and stop at the bottom of the stairs. ",
    "Leave bedroom and walk towards stairs. turn left and go down stairs, at landing turn right and continue down stairs, stop at the bottom of stairs. ",
    "Leave the bedroom and walk past the bike to the stairs.  Go down the stairs and stop at the bottom. "
  ],
  "path": [
    "164618f724c64b43934cb95b11c89593",
    "be1a38f2bec74de79395d0a938234d38",
    "63333423642f49caac4871521e93cc45",
    "5965958b0a55454d88d45f21d97bc3fc",
    "51328414aea04771890766f436b40021",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57"
  ],
  "path_id": 1555,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0699950539882936,
  "num_matches": 1746,
  "direction_num": 10
},{
  "distance": 6.47,
  "heading": 2.296,
  "instructions": [
    "Go to the bottom of the staircase in the dining room. Go into the office. ",
    "Walk across the room, past the stairs and wait in the office, by the desk. ",
    "Step outside of the room and walk through the doorway on the opposite side past the stairs.  Stop after stepping into the office. "
  ],
  "path": [
    "2f20259787124d7e8a85408cd5767c65",
    "a9366b89465a49028782a840a165a7e8",
    "61ff336a2ec442268785b388864ea348",
    "cf33698ad71e4ff48d7ff42e35e3fd83",
    "f5df82be55df4d13af8d03695bad0163",
    "1316450be64b472c9f84f6f71a991757"
  ],
  "path_id": 5735,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06974840585055533,
  "num_matches": 1601,
  "direction_num": 2
},{
  "distance": 9.07,
  "heading": 1.223,
  "instructions": [
    "Walk past outdoor chairs on the right. Enter the home through the open door. Make a left in front of the round foyer table. Wait in the dining room door threshold. ",
    "Go straight into the house using the large door and walk toward the round table. Turn left when you get to the table and wait at the entrance of the room on the left. ",
    "Go inside the house through the black archway, then turn left into the ornate archway and then stop. "
  ],
  "path": [
    "9ceaad509b004eb5a15bc5d39089aeca",
    "a408da1db2024ee0b2ef470e3a85153d",
    "ca9b27594a42478194e66ccf076fd73a",
    "817592f1e67c4869b8490ff6ae8af258",
    "21289201617a47c6b3795f640566ba6e",
    "7cc396bac34f4fd3a468f0668e11bd25"
  ],
  "path_id": 3930,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.04171504693443021,
  "num_matches": 1535,
  "direction_num": 7
},{
  "distance": 9.41,
  "heading": 3.581,
  "instructions": [
    "walk through the dining room with the table on your right, continue past a doorway on your left, a table on your right and stop in between the faucet and marble cylinder on your left. ",
    "Turn around and walk to the other end of the room. ",
    "Go straight until you pass the extra large table with chairs then stop by the fake sink. "
  ],
  "path": [
    "397cae1de3b74644804196b838fd3c8a",
    "2d21aec2e48b4797ad0367e96fd316f4",
    "82ee7783a95b4beeb1b8c518107c9ae2",
    "262ffaa0bb8a409ebf26df9e9f2f5146",
    "aadc2f85a2a742d7ba9a388dd6f4c9cf"
  ],
  "path_id": 2181,
  "scan": "2n8kARJN3HM",
  "source": "R2R",
  "similarity": 0.0854353685144251,
  "num_matches": 1584,
  "direction_num": 6
},{
  "distance": 5.75,
  "heading": 2.156,
  "instructions": [
    "Walk out the double white doors to your left. Once in the hallway turn right and stop once you reach the 2nd rug. ",
    "Walk into the hallway and turn right. Walk past the Christmas tree and down the all. Stop in front of the doors. ",
    "Walk through the open french doors. Make a right at the area rug. Walk past the Christmas tree on the left. Wait at the wreath on the door to the left. "
  ],
  "path": [
    "88f5ba9d06ac4413b1a3908af6544308",
    "0a796daf5b734fbbb52974e2349a6c0e",
    "27a601b205344b9dbe17e9f7afb07c87",
    "78320616d9c54b66bccceaf17ace30cf",
    "61c5f348dc854631b9754d81d414d7e9"
  ],
  "path_id": 3270,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09460296305645684,
  "num_matches": 1921,
  "direction_num": 9
},{
  "distance": 6.82,
  "heading": 6.008,
  "instructions": [
    "Facing the circle mirror on the wall go left through the double brown doors, make a right and go just passed the roped off area and stop. ",
    "Walk down the red carpet that passes the mirror on the right. Take a left when you pass through the doorway, and continue to walk on the carpet and stop in front of the pillar. ",
    "With the fireplace on your right, walk down the red carpet toward the two oval backed chairs.  When you get to the corner turn right and walk to the area where another red carpet intersects.  Stop in the middle of that red carpet.  There is a small square red carpet next to you there. "
  ],
  "path": [
    "3517198fc6744a2eab89d685f8cb93da",
    "7a3f8f06712a413b9d9b422a448b20bd",
    "e2f7333559be465d94798c1940b2e582",
    "248492258fd5435c8276f59f63ddf0ef",
    "5be145994f974347850a48cecd04cdcd"
  ],
  "path_id": 6179,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03427534014813092,
  "num_matches": 1703,
  "direction_num": 8
},{
  "distance": 15.21,
  "heading": 4.703,
  "instructions": [
    "Leave this room and go stand on the blue marker. ",
    "Walk forward with the sink at your back. Go into the bedroom, and take a left into the hallway. In the hallway go straight and go up the stairs. Stop at the top of the stairs nest to the bathroom door. ",
    "Leave the washroom and enter the bedroom turn hard left and walk into the hallway. Continue straight down the hallway and up the stairs. Take a few steps then stop by the open door on the right. ",
    "Turn right and exit the room. Turn left and walk along the hallway with the red carpet. Walk up the stairs and wait there. "
  ],
  "path": [
    "cdb10f20690943c9bc4af7602fec2914",
    "8c90120538ea4dcba0d08f680cce2c26",
    "15224ab8675346808c6cb06f06fcaddf",
    "4c328fadee7746aaa3bc81984c4bce68",
    "f51948f5b87546778b9800960f09f87b",
    "aaa698435aea48b29113314ee362e54b",
    "eeef7235c2fe462eb3e0481b001537ce"
  ],
  "path_id": 766,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.06887357774309649,
  "num_matches": 1508,
  "direction_num": 9
},{
  "distance": 11.08,
  "heading": 1.708,
  "instructions": [
    "Turn around and walk all the way down alongside the table you were beside to the other end. Stop in front of the 2 wooden chairs at the other end. ",
    "Face right and walk past the altar. Turn right and walk across the church until you reach the stone wall. Turn at a 45 degree angle, walk to the chairs, and stop. ",
    "Walk past the three chairs on the left and turn right. Walk past the altar and stop by the chairs on the right. "
  ],
  "path": [
    "986ea075ba794e549d8c0b7401487f9e",
    "6c6bf7ed2811477cac4123a4be1ac981",
    "084ee8230aac42918476f2b67585fe01",
    "a061bf8e69e74a92b02d4ad45e0d7ab0",
    "934734efa498455bbbabb9e0cc8e342d"
  ],
  "path_id": 4809,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.05939537246031386,
  "num_matches": 4299,
  "direction_num": 9
},{
  "distance": 15.4,
  "heading": 3.006,
  "instructions": [
    "Walk out the door left of the second fire place, then ascend the stairs to the right and wait on the top step between the winding stair cases. ",
    "Walk forward throuhg the sitting room passing the fireplace with the sitting area on your left to exit the room. Out of the room take a right and go  up the marble stairs. Stop on the top of the marble stairs next tot he left pillar. ",
    "Go straight and turn right. You can see near pillars and upstairs. "
  ],
  "path": [
    "e5bf751e9d7a4cb19e3d68c3fb881c29",
    "597c742850c14dcebd17081484195bee",
    "19c60ba074144f09ba124adef82ef7fa",
    "b4e027328a1b492e85e269df23fef364",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "3f75b2d4af4d4afd85666d4c1302008c"
  ],
  "path_id": 1218,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04217867790712524,
  "num_matches": 2434,
  "direction_num": 8
},{
  "distance": 8.82,
  "heading": 3.288,
  "instructions": [
    "Cross the room walking next to the the table-tennis table, with the table-tennis table on your left.  Stop when you get next to the wooden crate past the end of the table-tennis table. ",
    "Go past the pinball table and the wooden storage bins. Stop at the wooden conference table with the four yellow chairs. ",
    "Walk across work room to table with yellow chairs. Stop at the yellow chairs. "
  ],
  "path": [
    "85541431cbaf4053af5fde8bcebc4d92",
    "7856a3d706f7400bbdbd8410d40f832b",
    "adbe4f1c6ccd4dfbb3752685700e412a",
    "6305bc16b5c342fea87e0a5ede50f960",
    "9c90566989cb4f9f80b711d1a9876e1a"
  ],
  "path_id": 2807,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.05599035602673086,
  "num_matches": 1510,
  "direction_num": 3
},{
  "distance": 7.47,
  "heading": 0.826,
  "instructions": [
    "Go down the stairs and towards the table. Turn left through the doorway. Walk towards the TV and stop at the couch. ",
    "Go down the stairs and turn left through the doorway behind the dining table. Stop between the coffee table and the pale blue loveseat. ",
    "Go down the stairs. Turn left just past the naked woman statue. Stop between the blue sofa and the table. "
  ],
  "path": [
    "1527831f765e40c1b5210e52248427f7",
    "51328414aea04771890766f436b40021",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "b03eb3aa3b6e4c5abb5e78830372ff89"
  ],
  "path_id": 6470,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.0758185570089098,
  "num_matches": 2067,
  "direction_num": 9
},{
  "distance": 16.25,
  "heading": 4.866,
  "instructions": [
    "Leave the salon by going under the red velvet rope and exit through the door on the left. Follow the red carpet and go through the double doors. Enter the next room and go stand by the short table under the chandelier. ",
    "Turn and walk out the double doors to left of the fireplace. Walk across the room and into the door straight ahead. Once you enter the room walk to the other side of the rope on the left  and stop in between the benches and the table at the blue vase. ",
    "Walk and turn left towards the door. Enter the door, and keep walking forward, and enter a door that has a huge round mirror on the right. Turn left towards the brown chairs, and stop there. "
  ],
  "path": [
    "3b36912b85834ca78616c6a7337d6303",
    "e51fa073bf2a449989cd5c29ec46fffa",
    "7551be9b1e4a45fa959217431fc4c463",
    "f8a5d4f68a4f49dd83688e863efeddff",
    "154cbcc9b744473780da78d787e1ad34",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "259fd84d195d4d9bac4e14bdf953521d"
  ],
  "path_id": 4377,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04007040659440984,
  "num_matches": 2423,
  "direction_num": 10
},{
  "distance": 9.33,
  "heading": 2.909,
  "instructions": [
    "Walk across the deck, past the patio furniture and wait at the base of the steps. ",
    "Travel straight past the two chairs and table on the left. Keep straight until you are at the base of the brick steps. ",
    "Walk forward with the banister on your right. Stop in front of the plants on the left of the stairwell. "
  ],
  "path": [
    "88f27f2d89d84d689bbe1ba584e211c5",
    "e74cca5444c34dbf9b071e6ef0a538ce",
    "65f77641cf3b4650bf492763e6ec5790",
    "1b8c3792715f4483aab0d36698658ef6",
    "136ca89bcb5d441c877de80ebbeb6490"
  ],
  "path_id": 1369,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.0303551079370325,
  "num_matches": 1663,
  "direction_num": 8
},{
  "distance": 6.16,
  "heading": 0.27,
  "instructions": [
    "Exit bedroom and walk across hall to bedroom, enter bedroom and turn left, walk to bathroom and enter, wait by window. ",
    "Turn around and go through the bedroom. Turn left by the bed and then turn left to enter the bathroom. ",
    "Leave the Garden room, and head into the sunset  bedroom straight across. Enter the bathroom in the room. Stop before you reach the sink. "
  ],
  "path": [
    "223b4ced68cd4688b6612a2795409490",
    "aaa8773c86214e9990d4c3ede3223499",
    "62994d72dab246fbb839f3699b9cacd6",
    "4f1ecaca2cc744b0beb75e146bc8ecc7",
    "c20f8e6497d14696b2cecf24ed288470",
    "1e05b7a24e664d3f98f3498d911bc48a"
  ],
  "path_id": 5693,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.049230403048980916,
  "num_matches": 1591,
  "direction_num": 4
},{
  "distance": 13.2,
  "heading": 3.383,
  "instructions": [
    "Walk down staircase. Wait by the two gold and white pillars at bottom. ",
    "Walk down the stairs and when it splits into two staircases, turn right and go down the rest of the stairs.  Stop on the marble where the two staircases meet up at the end with two pillars on one side and the circle mosaic on the opposite side. ",
    "Turn around, and go down the staircase. Turn right down the right staircase. "
  ],
  "path": [
    "79aedad1206b4eea9c4b639ea2182eb7",
    "1c91ed40af2246f2b126dd0f661970df",
    "385019f5d018430fa233d483b253076c",
    "fd263d778b534f798d0e1ae48886e5f3",
    "f490656d21134ff79be372d985ad965c",
    "813bb8880cdf4a24b48d97af1b4443a2"
  ],
  "path_id": 7015,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.03539361982964578,
  "num_matches": 2005,
  "direction_num": 8
},{
  "distance": 13.16,
  "heading": 1.812,
  "instructions": [
    "Pass the pews and turn right. Then turn left and go towards the desk. Turn left again and enter the large room. Stop in front of the lectern. ",
    "walk towards the banister and turn right.  Walk around the wooden chair and enter the next room, Then turn left and stop next to the chair. ",
    "Walk passed the throne, and turn left to reach the main hallway. Turn left into the large wooden entryway and stop. "
  ],
  "path": [
    "2094de1e2c934d9ca603a405739df547",
    "57675495582049a08d338804d36e72e6",
    "dad0e2b0427b40ec8e23f21760179e22",
    "b44972ac14a04dc1a18556e918b0c0c7",
    "16cbae81701541f6a55597d6dc746163",
    "d34877b97e1545188e177b2715e434c5"
  ],
  "path_id": 6184,
  "scan": "dhjEzFoUFzH",
  "source": "R2R",
  "similarity": 0.0738742932516572,
  "num_matches": 5406,
  "direction_num": 9
},{
  "distance": 9.06,
  "heading": 5.105,
  "instructions": [
    "Walk right and up the first set of stairs. ",
    "walk away from leather couch towards giant stone arch, turn left after you walk under arch, up black staircase, stop at the top of the stairs. ",
    "Walk straight then turn left and go up the steps on the left. Wait there near the white couch. "
  ],
  "path": [
    "e8bc16aba1c747abb860a4f5ad106142",
    "3e1caa061ec04144a0eac5c40da7c04f",
    "6e31c6927a6948a7a32918d626028b8d",
    "8ae0426af8824849ba75a6147325c30c",
    "718e7b8d4f63458d951d734b777c4562",
    "5bef72c3da8d49e4b62a50234fe97cb3"
  ],
  "path_id": 4428,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07256466886145696,
  "num_matches": 1690,
  "direction_num": 6
},{
  "distance": 12.06,
  "heading": 3.2,
  "instructions": [
    "Go down the brick walkway towards the brick stairs.  Go into the large room on the left, before you get to the stairs.Wait. ",
    "Walk passed the open double doors. Walk along the patio passing the woven lounge chairs. Walk into the open double doors on the other side of the lounge chairs and into the home. ",
    "Walk straight along the path past the table and chairs and turn left and enter on the first open doors you see. "
  ],
  "path": [
    "e3e9e67979e94b6e9f8cbb441dadc8da",
    "979afc5dbfbb44b3ba60cb5cafedda0d",
    "88f27f2d89d84d689bbe1ba584e211c5",
    "e74cca5444c34dbf9b071e6ef0a538ce",
    "65f77641cf3b4650bf492763e6ec5790",
    "1b8c3792715f4483aab0d36698658ef6",
    "2fe8aba87e074b98affe61cbdb5513ce"
  ],
  "path_id": 599,
  "scan": "SN83YJsR3w2",
  "source": "R2R",
  "similarity": 0.029753744148669232,
  "num_matches": 2115,
  "direction_num": 6
},{
  "distance": 15.01,
  "heading": 1.233,
  "instructions": [
    "Walk forward towards the gray chair. Turn right and continue down the hallway. Walk up the stairs and wait near the bathroom on the left. ",
    "Exit bedroom and head for staircase, stop at the landing. ",
    "Leave the bedroom, and go down the hall. Go up the stairs, and stop outside of the bathroom on the left. "
  ],
  "path": [
    "4cc5a83b4e2d4cfbacbab1bdca3565b3",
    "8c90120538ea4dcba0d08f680cce2c26",
    "15224ab8675346808c6cb06f06fcaddf",
    "4c328fadee7746aaa3bc81984c4bce68",
    "f51948f5b87546778b9800960f09f87b",
    "aaa698435aea48b29113314ee362e54b",
    "eeef7235c2fe462eb3e0481b001537ce"
  ],
  "path_id": 5416,
  "scan": "gTV8FGcVJC9",
  "source": "R2R",
  "similarity": 0.07239629255669308,
  "num_matches": 1660,
  "direction_num": 7
},{
  "distance": 7.95,
  "heading": 4.985,
  "instructions": [
    "Exit the room. Turn right then continue down the hallway. Walk straight until you get to the front room. Wait near the two Christmas trees. ",
    "Exit room, and make a right to go down corridor.  Pass the Christmas tree, and enter the room straight ahead.  Wait by mirror. ",
    "Exit, and turn right. Walk all the way forward towards the very end room that is in front of you. Enter inside the room, and stop in front of the two small Christmas tree. "
  ],
  "path": [
    "69dc547801584e1a9aa129ff36289f52",
    "6249652893364b62b1c30df6c6516a71",
    "78320616d9c54b66bccceaf17ace30cf",
    "27a601b205344b9dbe17e9f7afb07c87",
    "38ad5b94f1f64668a5c2040a541e5ae9",
    "de655166da274d40841f1e5e488ab641",
    "e5c88ad5db1a4b3a977455b0c161d792"
  ],
  "path_id": 4807,
  "scan": "qoiz87JEwZ2",
  "source": "R2R",
  "similarity": 0.09451951134194927,
  "num_matches": 3090,
  "direction_num": 9
},{
  "distance": 9.67,
  "heading": 3.561,
  "instructions": [
    "Go into the room. Turn right and go into the room next door. Pass the table and chairs then pass the bed and go into the bathroom on the right. Wait near the sink. ",
    "Leave the bathroom, and bedroom. Enter the bedroom through the door on the right in the bedroom. Enter the bathroom through the door on the left of the bed. Stop in front of the sink. ",
    "Go straight into the bedroom and turn right. Go through the next door and into the bathroom in the back right corner. "
  ],
  "path": [
    "0d56bf44653d4ddc999ada13084978d9",
    "f8190b68f53e40268771352a91bab873",
    "0a447b165b724cc8a73b00aafb9f8997",
    "5bc65c559e2c4edc92ac6e9832d28ab1",
    "b3ea270a560d4fc784e7c7d4ca0e2248",
    "61e6284b6ef541e59a87efa918514255",
    "e4e27ec0f9e040419422ab67a86bdefe"
  ],
  "path_id": 7244,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0681719417440138,
  "num_matches": 1873,
  "direction_num": 7
},{
  "distance": 10.52,
  "heading": 3.917,
  "instructions": [
    "walk along the edge of the house and enter the house through the patio door. ",
    "Walk along the outside of the house underneath the glass overhang. You will come to an entrance with glass double doors. Enter the building and wait. ",
    "Walk toward the sitting area that overlooks the harbor and go left through the doors to enter the building.  Stop next to the birdcage. "
  ],
  "path": [
    "ca9293fce518481282c3bc9bd6230f4c",
    "deade6958e8845448d4594169d435b5c",
    "884a0669e02341679743a69f4049a41f",
    "0ed4c12ae2734b52866842a32a2bbaad",
    "987ba42081144f569eac1ddea227612a",
    "42b4de3318a74ec78dcd6f80803ea859",
    "bc563332fa4c48abaef8a1cb712075f8"
  ],
  "path_id": 3317,
  "scan": "EDJbREhghzL",
  "source": "R2R",
  "similarity": 0.04083952014414356,
  "num_matches": 1886,
  "direction_num": 1
},{
  "distance": 13.01,
  "heading": 0.485,
  "instructions": [
    "Keeping the swimming pool to your right, move forward until you just pass the end of the pool. Walk around the planter on your left, then go forward and up the one step. Move straight ahead until you are next to the third of the three planters. Keep the planters on your right, Stop next to the third planter and await further orders. ",
    "Turn around and walk past the pool and stand next to the block wall near the patio doors. ",
    "Walk towards the end of the pool with the steps to get in the pool. Walk straight passed the steps of the pool to the double doors to go indoors. Stop near the door and the three small plants on the ground. "
  ],
  "path": [
    "fd0949b7763b44f4ab5a8de9e2ac1fdb",
    "72db3b5a55bd4bf99fef4c0774263fa1",
    "d347f148995543ce8ae28d7c50ba5250",
    "d7fd6e3ab372450b8f38600aea06b680",
    "4838fa0d949e4cd3905f5e1ba665c59b",
    "626241dbd7334a45868a1092a3e195af",
    "f51ad0a5eae14774abac510880e1f364"
  ],
  "path_id": 5861,
  "scan": "82sE5b5pLXE",
  "source": "R2R",
  "similarity": 0.07693183017438966,
  "num_matches": 2114,
  "direction_num": 9
},{
  "distance": 8.15,
  "heading": 0.75,
  "instructions": [
    "Walk out of the bedroom and make a right. Follow the railing and stop after passing the American flag. ",
    "Exit the bedroom and turn right to face the hallway.  Walk forward until you reach the end of the paisley carpet and turn left.  Walk forward toward the American flag, then take a few steps forward into the room and stop about 2 feet from the corner of the fireplace. ",
    "Go behind you and walk passed the stairs and go passed the american flag and stop near it. "
  ],
  "path": [
    "d5693cccdffa464d92381eff5fdb96a7",
    "1b6ad918388b4528bf0b511db7fd6279",
    "7deb7519052e480a933602dc9e37bd2d",
    "53e850a074ec4c9ebecb3c8f41361d57",
    "f67fc5e261794b2b8c4ef494604d2059"
  ],
  "path_id": 7164,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.05670364877337295,
  "num_matches": 1953,
  "direction_num": 6
},{
  "distance": 20.88,
  "heading": 1.689,
  "instructions": [
    "Walk to the opposite side of the dining area and wait there. ",
    "Go straight until you pass many round tables with chairs. When you pass the large table on the left. Head straight until you get to more round tables with chairs. ",
    "Turn around and walk to the middle of the dining room where it is open. Once you reach this area, enter the other side of the dining room to the left of the last column on the right. Once you pass the first table, stop. "
  ],
  "path": [
    "3965f87919674798a78e36931b3a4af1",
    "6785a37dc18b4dee9c60aa496efca3e2",
    "3a4650fded724e8587bc8fa91e0bdfc2",
    "f3d21b0654584b5292ecae9791515ad4",
    "7c16246e3d12454b97b6a5cf88a21032",
    "abd467777dcc41c0995588b7f97b388b",
    "5ccb4ab1767649358547b22ff92b9f3a"
  ],
  "path_id": 5931,
  "scan": "r1Q1Z4BcV1o",
  "source": "R2R",
  "similarity": 0.03490590983648158,
  "num_matches": 1561,
  "direction_num": 5
},{
  "distance": 13.87,
  "heading": 4.588,
  "instructions": [
    "Walk towards the staircase and at the bottom, turn right and walk to the front door.  Go through the door and step outside. ",
    "Go into the room with the large open staircase ahead of you and to the left. Once inside that room, turn right and head to the center doors on the wall opposite the staircase. Go through those exit doors and stop halfway between the doors and the four pillars ahead of you. ",
    "Walk forward and make a right towards the chairs. Stay at the center of the huge carpet, and walk forward towards the open door and exit the door. Stand on the tiles outside the door, and stop there. "
  ],
  "path": [
    "ffd41f034ca44fe280a59b6a192be618",
    "6d88b250b28f4f28afbcf356f6a33909",
    "f59c4b4ff65e4a539bbba69e67de001e",
    "d35b945333f5413a9f5586b794cd2680",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1",
    "062df9954974450a9eb914da2727062d"
  ],
  "path_id": 3656,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.0922640997259762,
  "num_matches": 4748,
  "direction_num": 9
},{
  "distance": 7.12,
  "heading": 5.627,
  "instructions": [
    "Go out of the room with the blue walls to the main large room and to the colorful stairs. Wait about five stairs up. ",
    "Pass the white chair and the turn left and go straight until the stairs. Go up three steps and stop. ",
    "Leave the TV room through the door behind the chair. Take a right and go up the stairs. Stop on the fourth stair from the bottom. "
  ],
  "path": [
    "c4b53f73a3734bc7a5b51747e5d1d5f7",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "444a5cc79a15455d96cfd41bc1f67e57",
    "d9b5196ff58c494d8bebdeb3b6ccd061",
    "51328414aea04771890766f436b40021"
  ],
  "path_id": 2593,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06963417031125331,
  "num_matches": 1641,
  "direction_num": 3
},{
  "distance": 6.47,
  "heading": 4.691,
  "instructions": [
    "Exit study and walk across dining room to hallway with closets. Stop at closets. ",
    "After you leave the office you need to walk to the doorway of the entryway across the hall. You need to wait inside the entryway. ",
    "Go toward the stairs past some bookshelves. Go straight across the room past a wooden valet, and stop when you can see down a hall into a bathroom. "
  ],
  "path": [
    "1316450be64b472c9f84f6f71a991757",
    "f5df82be55df4d13af8d03695bad0163",
    "cf33698ad71e4ff48d7ff42e35e3fd83",
    "61ff336a2ec442268785b388864ea348",
    "a9366b89465a49028782a840a165a7e8",
    "2f20259787124d7e8a85408cd5767c65"
  ],
  "path_id": 2816,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.06530151519520623,
  "num_matches": 1504,
  "direction_num": 4
},{
  "distance": 6.76,
  "heading": 2.062,
  "instructions": [
    "Turn around to walk down the hallway and enter the first room on the left. Wait near the counter. ",
    "Go straight down the hallway. Turn left on the first door. Wait at the entrance. ",
    "walk away from door to outside, down the hallway, turn left and enter the first doorway and stop. "
  ],
  "path": [
    "3d6254ee55de4e4b997c64bd06d78af7",
    "d3038501401941f8afe4e9e2df5eda73",
    "732ae10002fe4de0a6f62864391cdf11",
    "cc7f149e59eb47fd8bde336f2bf3391d",
    "9e94e381ffbf44eabc4b3fb0f8bff78a"
  ],
  "path_id": 4077,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.12733482008301833,
  "num_matches": 3496,
  "direction_num": 7
},{
  "distance": 17.39,
  "heading": 1.243,
  "instructions": [
    "Walk forward toward the blue furniture and take a left. In the main room go out of the main door on the right. Stop once you are outside. ",
    "Walk into the the room with the blue furniture. Walk left out of the door and into the room across the hall. Go right and stand just outside the double doors. ",
    "Enter the room with the blue curtains, blue carpet and blue upholstered furniture. Then exit via the double doors to the left. Continue through the passage way until you see a large open staircase towards your left, then head right towards the middle set of doors leading outside. Go through those doors and stop. "
  ],
  "path": [
    "8b22751d94034268b26b9960c1d28e4e",
    "c645fc0e7e2a488fbed3580e98bd041e",
    "cfd9511c06b34cd1b89ba36919a4e6b6",
    "b6bcf908137f4b2d83d66e5fe6c35656",
    "73de1f780b804c92a2441ac92c442c49",
    "9cc6191a6e1642f984e54b1a79b83761",
    "5e5ce62aa2f540f1b5978222f8a9deb1"
  ],
  "path_id": 2557,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.07294246483586178,
  "num_matches": 3773,
  "direction_num": 10
},{
  "distance": 7.87,
  "heading": 0.329,
  "instructions": [
    "Turn around and walk out the door behind you. Go across the room to the other side of the table. Go in the door to the left of the painting with sailboats and stop. ",
    "Walk into the room with black leather chairs.  Walk towards the statue of a woman and go into the door on the right. Wait in this room by the wooden table. ",
    "Leave the kitchen and go straight Enter the room on the TV room through the second door to the right straight ahead. Stop in front of the first chair on the left. "
  ],
  "path": [
    "e3eeb7b8deed4a2fa0000daec3538b75",
    "f4032225a0c6462ba02f728d031c2638",
    "7025038ba12d4a63a40c866489226fbe",
    "3b0c7d0596fd45b69261b73e6b669d7c",
    "3c0f16214b6042aba12ad974fc5dd6f6",
    "b03eb3aa3b6e4c5abb5e78830372ff89"
  ],
  "path_id": 2515,
  "scan": "JmbYfDe2QKZ",
  "source": "R2R",
  "similarity": 0.05963717800526296,
  "num_matches": 1522,
  "direction_num": 7
},{
  "distance": 9.26,
  "heading": 0.42,
  "instructions": [
    "walk towards the door with the exit sign above it, turn and walk through the doorway on the left, enter the bedroom, walk around the foot of the bed, towards the bathtub, turn left and stop in front of the flower barrier near the bathroom. ",
    "Turn left into bedroom. Walk around bed to entrance to toilet and wait. ",
    "Turn around. Walk through the door to your left. Walk around the bed and stop facing into the bath room where you can see the mirror, sink and toilet as well as still see the tub in the room. "
  ],
  "path": [
    "1b6ad918388b4528bf0b511db7fd6279",
    "d5693cccdffa464d92381eff5fdb96a7",
    "ffcdf5557c684ebf81f6ab3dcef17325",
    "4db175db9ecf4f07b8c8de9ab885611a",
    "dad7d0531dd2422bac0484433e926a45",
    "cf778c1cb15b4dd8a7ac0001ac7e6b94"
  ],
  "path_id": 2216,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.06956038895232829,
  "num_matches": 2663,
  "direction_num": 6
},{
  "distance": 6.03,
  "heading": 0.702,
  "instructions": [
    "Go left between the pool and the chairs and stop once you reach the door. ",
    "Walk past the bed and pool and stop in front of the wooden door to the left of the diamond mirror on the wall at the end of the pool. ",
    "Wait at the other end of the pool. "
  ],
  "path": [
    "c72099534821414c956a08c899742eb8",
    "d0f90601ac1b46fdb7258c230495f8a0",
    "d8f7db8824674725a8334d3554cda5bf",
    "1a9eaf7e67c444ffbec01b999b40c5a2",
    "a9aa7ad5b14e499082ed36083484cfa8"
  ],
  "path_id": 6192,
  "scan": "r47D5H71a5s",
  "source": "R2R",
  "similarity": 0.1213055134964954,
  "num_matches": 1704,
  "direction_num": 3
},{
  "distance": 12.79,
  "heading": 3.349,
  "instructions": [
    "walk up the stairs, turn right at rope barrier, turn left after rope barrier,  turn right and walk through doorway, stop next to chair on left. ",
    "Go up the stairs. Turn right when you see a chandelier, then go through the door opposite chairs and a couch. ",
    "Go up the stairs and through the second entry way on the right. Stop by the chair on the left. "
  ],
  "path": [
    "385019f5d018430fa233d483b253076c",
    "1c91ed40af2246f2b126dd0f661970df",
    "79aedad1206b4eea9c4b639ea2182eb7",
    "dd6b2993f882400ab51f9e8c38148b7a",
    "fd433ad8502149ec849c4c51bb989e4a",
    "7e3147f2e0c24ea78fe71609fd36e7ee",
    "8113cb01c8d944a1af5f2dfc7f008b0c"
  ],
  "path_id": 4671,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04979182731023413,
  "num_matches": 3480,
  "direction_num": 7
},{
  "distance": 10.85,
  "heading": 4.728,
  "instructions": [
    "Exit the barbecue area and enter through the door on left. Walk across the living area and wait in the hallway. ",
    "Follow the wall of the house, keeping the house on your left side.  Enter the house by the first doorway you come to.  These will be double glass doors.  After you enter the house, walk through the living room.  Walk between the couch and the television mounted on the wall, with the television on your left.  Stop when you get past the far edge of the couch, by the column. ",
    "Walk towards the outside patio set, walk through the first door on the left, walk through the living room past the furniture, stop when you reach the hallway. "
  ],
  "path": [
    "b6bfed9c855f4d67a0ece0a83fc4ef67",
    "33aaa553587c41fbb213c8f321eab8b2",
    "de39d04000ec4298a1d37e84eec6ea8d",
    "15dee203cd804c2f998b8dbbc55d6f98",
    "cd2f3a1a606346c1980d4b27004f05cf",
    "410ec890d2514ed39248e9204f785ab8",
    "7022a22f8b694102a795919fce934e03"
  ],
  "path_id": 1761,
  "scan": "mJXqzFtmKg4",
  "source": "R2R",
  "similarity": 0.043517178910930474,
  "num_matches": 2410,
  "direction_num": 7
},{
  "distance": 8.75,
  "heading": 3.146,
  "instructions": [
    "Walk to the right, around the fireplace, through the doorway and turn right. Wait in the hallway by the pocket door. ",
    "Go to the fireplace. Go to the bottom of the stairs. Go into the room nearest the television. ",
    "Walk forward to the fireplace. Turn right and walk to the bottom of the stairs. Turn left and enter the next room. Turn right into the doorway. Stop in front of the bathroom. "
  ],
  "path": [
    "d807887a425a41249a31c69a41adb313",
    "28170cad00aa4938a612db2e82628000",
    "21da82bc068c4d19a1c9168e86c417c2",
    "54f83ce9bf4543ff8219bd1c450ada78",
    "d166ebf97d1b4e1bae5234cb40ad4a50"
  ],
  "path_id": 6378,
  "scan": "D7N2EKCX4Sj",
  "source": "R2R",
  "similarity": 0.0925199569937561,
  "num_matches": 4544,
  "direction_num": 6
},{
  "distance": 8.13,
  "heading": 5.161,
  "instructions": [
    "Take a slight left at the ping pong table. Go toward the staircase. Wait by the white chair at the desk. ",
    "Walk straight past the ping pong table and then turn right and walk toward the stairs. Wait near there. ",
    "Walk past the ping pong table and stand near the edge of table by the stairs. "
  ],
  "path": [
    "6305bc16b5c342fea87e0a5ede50f960",
    "adbe4f1c6ccd4dfbb3752685700e412a",
    "b29274ad819d4011aab6f538373d0ee1",
    "2ed7a969a2d94eeb992c4f49d59cf0d7",
    "86958e49dad94db090a8dd520b4994a3"
  ],
  "path_id": 4409,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07449490939758158,
  "num_matches": 1961,
  "direction_num": 5
},{
  "distance": 16.78,
  "heading": 1.791,
  "instructions": [
    "walk and take right side. Then up stairs and reach. ",
    "Walk into the hall and take a left, then go up the stairs. Stop on the first stair landing in front of the window. ",
    "Turn around and walk forward into the room towards the stairs, then turn left and then right and walk towards the base of the stairs. Walk up the stairs until you reach the second landing where the stairs branch off to either side of you. Stop as soon as you reach this landing. "
  ],
  "path": [
    "8d01d3df74ea481bb82fd00f4ae6bae7",
    "bd0a7e319efd4fd98e373a3d2a025566",
    "37e7b9950ba44d86b27ba9c5145efe85",
    "ed46f2e3d89d4f2ea2ec7b14affef69d",
    "10b11d5c0cb7449baca31324b6a371bb",
    "ea8c31ffae82450f87d19ca1ac4d01b7",
    "bb2ed22637c342ba8acb80a377f234f9"
  ],
  "path_id": 908,
  "scan": "E9uDoFAP3SH",
  "source": "R2R",
  "similarity": 0.04011826423788378,
  "num_matches": 2118,
  "direction_num": 7
},{
  "distance": 11.51,
  "heading": 5.701,
  "instructions": [
    "Head outside to the rail and take a left, keep going until you see sliding doors on the right, and then go through the doorway and stop. ",
    "Walk outside and turn right. Walk right past the recliners and stop behind the couch. ",
    "Exit the office onto the balcony then pass the grey lounge chairs and go into the house using the glass sliding doors on the right. "
  ],
  "path": [
    "1d47ba7d0b094cee93aad6322445fd4b",
    "6a2ce6dc04294e55af92a617d00fc4aa",
    "6536cc05bf45478aa2aceaa3bc575b61",
    "4848ed4db295441c8722127d3df1c8c1",
    "5c727ef012ab4815816299f46ead2798",
    "4d2108a6225f4a47b19f54fa4a61588e",
    "5ef3f0f5642a4858a7dbc2c20dc04842"
  ],
  "path_id": 3294,
  "scan": "5LpN3gDmAk7",
  "source": "R2R",
  "similarity": 0.09343445109682061,
  "num_matches": 1589,
  "direction_num": 6
},{
  "distance": 14.31,
  "heading": 5.117,
  "instructions": [
    "Walk through the door furthest away from you and take a left. Wait at the top of the white marble stairs. ",
    "Walk across sitting room to hallway that is to the right of the fireplace. Turn left towards stairs, stop at top step between two pillars. ",
    "Move around the table and to the right. Then go over or under rope and move forward. Continue down the hall straight, then through the doors. Turn to your left and continue forward and up the stairs. "
  ],
  "path": [
    "5ee1a604d54f459cb64f33acdd18910e",
    "8be5effc17454d3f872ea16b4948015b",
    "db3f3ca133714b02877c14da914630ab",
    "10e1b4e1aab94a7988477a15f8cc518b",
    "154cbcc9b744473780da78d787e1ad34",
    "20d4286c35fa46a2b4f0db5fb1ff8d86",
    "3f75b2d4af4d4afd85666d4c1302008c"
  ],
  "path_id": 2759,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.04712656105671875,
  "num_matches": 2816,
  "direction_num": 10
},{
  "distance": 12.42,
  "heading": 4.125,
  "instructions": [
    "walk forward through the ornate double doors and into the hallway In the hall walk forward and go into the sitting room on the left. Stop in the doorway to the sitting room. ",
    "Walk through the open doors with golden decorations. Walk through the next room passed the ceiling lamp towards the grandfather clock up against the wall. Walk through the door to the left of the clock and into the next room that has glass chandeliers and wrap around Victorian couches. ",
    "Exit the room, walk down the hallway to the left next to the striped chair, wait at the door by the fire extinguisher. "
  ],
  "path": [
    "10e1b4e1aab94a7988477a15f8cc518b",
    "154cbcc9b744473780da78d787e1ad34",
    "ba5080db55e84e4f9a9c02a4549e7448",
    "9200a845d37a4e0ab6cbf58f334acbce",
    "a68b5ae6571e4a66a4727573b88227e4",
    "79878e3ae5364a658d3f7a0a683c3505"
  ],
  "path_id": 849,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.035170829369022084,
  "num_matches": 1521,
  "direction_num": 7
},{
  "distance": 6.53,
  "heading": 6.259,
  "instructions": [
    "Walk straight through corridor, and down steps. Stop at bottom of steps. ",
    "Head down the walkway towards the street ahead and stop after climbing down four steps. ",
    "Walk along the stone pathway toward the gate. Go down the stairs, and stop on the second stair from the bottom. "
  ],
  "path": [
    "b0a3ea6e7efb429eab0d0ede3174f906",
    "b1e41a74f03a4ceeabd6a6da3dc557b2",
    "19ae938a01884f31bb5b758b5a8feb83",
    "d6316b40b9c8413386ef184e5a5382ab",
    "701293ca052c452c8454a11cf5f140f5",
    "d910a01091f047bc9a4344fcf362621c"
  ],
  "path_id": 5729,
  "scan": "PX4nDJXEHrG",
  "source": "R2R",
  "similarity": 0.11941055047679645,
  "num_matches": 1880,
  "direction_num": 6
},{
  "distance": 10.7,
  "heading": 0.164,
  "instructions": [
    "Walk into the hallway and to the right. Wait in the doorway next to the bathroom, at the end of the hall. ",
    "Exit the bedroom and turn right.  Walk down the hallway toward a bathroom and another bedroom.  Stop inside the doorway to the right, the one with a bed in it. ",
    "You need to leave the bedroom and make a right turn in the hallway. Next, walk to the end of the hall to the bedroom that is to the right of the room with the large sink. When you get to the doorway of the bedroom stop. "
  ],
  "path": [
    "ca38c3e0cbcf4a4992d79889e5793cb7",
    "2754c89e3b2645d598ace5d7878f5d13",
    "980150b99a2946a0894c33df8fb616d2",
    "e5c5d8fa1ad94d97bcdb74e69e938ea0",
    "d2a0481db3044dfbac40244bdbf9f9e1",
    "91b54e8895bf4d63922b5ef7ea839d4c"
  ],
  "path_id": 3543,
  "scan": "1LXtFkjw3qL",
  "source": "R2R",
  "similarity": 0.10848734990463337,
  "num_matches": 3742,
  "direction_num": 6
},{
  "distance": 12.12,
  "heading": 0.024,
  "instructions": [
    "Walk around the big roped off display and turn left. Go through that entryway and down that hallway. Stop by the other roped off display on your right. ",
    "Turn to the left and climb over the rope.  Go down the hallway.  Jump over the rope on the right side at the end of the hallway.  Wait right there by the fireplace. ",
    "Go left through the second door by the columns, then enter the next room and turn right, wait by the table. "
  ],
  "path": [
    "adcc15e35b9441139036aeefda56e0a4",
    "293a1e64b85e4e84a3a44fe8ee9d9bd4",
    "629b626095374e3ab7d9b7ba98f2f7ba",
    "564526d4eff54e61b077aefcfb070cfd",
    "bf7dedec250d405f809a7124509d7c2f",
    "4335216422a24ad9bd6a662531d49f90"
  ],
  "path_id": 252,
  "scan": "VLzqgDo317F",
  "source": "R2R",
  "similarity": 0.0352279474842579,
  "num_matches": 1772,
  "direction_num": 9
},{
  "distance": 8.39,
  "heading": 1.59,
  "instructions": [
    "Turn to your left and walk around the table to your left. Pass by the next table as well and turn left between that table and the last table and stop. ",
    "Walk between the tables, turn left and continue through the chairs. Stop near the last row. ",
    "Walk forward past dinning tables, wait by last table on the left by the door. "
  ],
  "path": [
    "5e54afb639e8489282ebf3ac01821cc7",
    "434eafc01e8e4a32beeeddba478776bf",
    "dcb7e1f526b646819aa4a485171958a7",
    "7b7943b56b9a4febae48c82f6e3f507d",
    "4122ef1b23ca44b78c7cb26fa1c6a645"
  ],
  "path_id": 5295,
  "scan": "PuKPg4mmafe",
  "source": "R2R",
  "similarity": 0.11403795044099843,
  "num_matches": 4263,
  "direction_num": 7
},{
  "distance": 12.12,
  "heading": 3.397,
  "instructions": [
    "With the ping pong table behind you, walk down the length of the room.  When you see two staircases, take the one on the right and stop on the first stop. ",
    "Walk straight past everything and go down one step down the stairs then stop. ",
    "Walk straight ahead toward the stairs. Wait on the second step. "
  ],
  "path": [
    "6944cb3d349a424899b2ed5b4c972763",
    "334f156071b34579ae4772f623b03429",
    "60e9c84ab617491594f5c2950cc6f3ee",
    "77b24e884d9f47599994c1ade95f0b89",
    "caada625c5b4460da34bd695539db791",
    "5bef72c3da8d49e4b62a50234fe97cb3",
    "718e7b8d4f63458d951d734b777c4562"
  ],
  "path_id": 7277,
  "scan": "ZMojNkEp431",
  "source": "R2R",
  "similarity": 0.07944399652736513,
  "num_matches": 2460,
  "direction_num": 7
}]